/* automatically generated by rust-bindgen 0.66.1 */

#[allow(non_snake_case, non_camel_case_types, non_upper_case_globals)]
pub mod root {
    #[allow(unused_imports)]
    use self::super::root;
    pub const AERON_FILE_SEP: u8 = 47u8;
    pub const AERON_COMPILER_GCC: u32 = 1;
    pub const AERON_COMPILER_LLVM: u32 = 1;
    pub const AERON_CPU_X64: u32 = 1;
    pub mod std {
        #[allow(unused_imports)]
        use self::super::super::root;
        #[repr(C)]
        #[derive(Copy, Clone)]
        pub struct basic_string {
            pub _address: u8,
        }
        pub type basic_string__Char_alloc_type = u8;
        pub type basic_string__Alloc_traits = u8;
        pub type basic_string_traits_type = u8;
        pub type basic_string_value_type = u8;
        pub type basic_string_allocator_type = u8;
        pub type basic_string_size_type = u8;
        pub type basic_string_difference_type = u8;
        pub type basic_string_reference = u8;
        pub type basic_string_const_reference = u8;
        pub type basic_string_pointer = u8;
        pub type basic_string_const_pointer = u8;
        pub type basic_string_iterator = u8;
        pub type basic_string_const_iterator = u8;
        pub type basic_string_const_reverse_iterator = u8;
        pub type basic_string_reverse_iterator = u8;
        pub type basic_string___const_iterator = u8;
        #[repr(C)]
        #[derive(Copy, Clone)]
        pub struct basic_string__Alloc_hider {
            pub _address: u8,
        }
        pub const basic_string__S_local_capacity: root::std::basic_string__bindgen_ty_1 = 0;
        pub type basic_string__bindgen_ty_1 = i32;
        #[repr(C)]
        #[repr(align(8))]
        #[derive(Copy, Clone)]
        pub union basic_string__bindgen_ty_2 {
            pub _bindgen_opaque_blob: u64,
        }
        #[repr(C)]
        #[derive(Copy, Clone)]
        pub struct pair {
            pub _address: u8,
        }
        pub type pair_first_type = u8;
        pub type pair_second_type = u8;
        pub type pair__PCCP = u8;
        pub type pair__PCCFP = u8;
        #[repr(C)]
        #[derive(Copy, Clone)]
        pub struct pair___zero_as_null_pointer_constant {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Copy, Clone)]
        pub struct hash {
            pub _address: u8,
        }
        #[repr(C)]
        #[repr(align(8))]
        #[derive(Copy, Clone)]
        pub struct exception {
            pub _bindgen_opaque_blob: u64,
        }
        #[test]
        fn bindgen_test_layout_exception() {
            assert_eq!(
                ::std::mem::size_of::<exception>(),
                8usize,
                concat!("Size of: ", stringify!(exception))
            );
            assert_eq!(
                ::std::mem::align_of::<exception>(),
                8usize,
                concat!("Alignment of ", stringify!(exception))
            );
        }
        extern "C" {
            #[link_name = "\u{1}_ZNSt9exceptionC1Ev"]
            pub fn exception_exception(this: *mut root::std::exception);
        }
        extern "C" {
            #[link_name = "\u{1}_ZNSt9exceptionC1ERKS_"]
            pub fn exception_exception1(
                this: *mut root::std::exception,
                arg1: *const root::std::exception,
            );
        }
        extern "C" {
            #[link_name = "\u{1}_ZNSt9exceptionC1EOS_"]
            pub fn exception_exception2(
                this: *mut root::std::exception,
                arg1: *mut root::std::exception,
            );
        }
        impl exception {
            #[inline]
            pub unsafe fn new() -> Self {
                let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
                exception_exception(__bindgen_tmp.as_mut_ptr());
                __bindgen_tmp.assume_init()
            }
            #[inline]
            pub unsafe fn new1(arg1: *const root::std::exception) -> Self {
                let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
                exception_exception1(__bindgen_tmp.as_mut_ptr(), arg1);
                __bindgen_tmp.assume_init()
            }
            #[inline]
            pub unsafe fn new2(arg1: *mut root::std::exception) -> Self {
                let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
                exception_exception2(__bindgen_tmp.as_mut_ptr(), arg1);
                __bindgen_tmp.assume_init()
            }
        }
        extern "C" {
            #[link_name = "\u{1}_ZNSt9exceptionD1Ev"]
            pub fn exception_exception_destructor(this: *mut root::std::exception);
        }
        extern "C" {
            #[link_name = "\u{1}_ZNKSt9exception4whatEv"]
            pub fn exception_what(
                this: *mut ::std::os::raw::c_void,
            ) -> *const ::std::os::raw::c_char;
        }
        #[repr(C)]
        #[derive(Copy, Clone)]
        pub struct allocator {
            pub _address: u8,
        }
        pub type allocator_value_type = u8;
        pub type allocator_size_type = u64;
        pub type allocator_difference_type = u64;
        pub type allocator_pointer = u8;
        pub type allocator_const_pointer = u8;
        pub type allocator_reference = u8;
        pub type allocator_const_reference = u8;
        #[repr(C)]
        #[derive(Copy, Clone)]
        pub struct allocator_rebind {
            pub _address: u8,
        }
        pub type allocator_rebind_other = u8;
        pub type allocator_propagate_on_container_move_assignment = u8;
        pub type allocator_is_always_equal = u8;
        #[repr(C)]
        #[derive(Copy, Clone)]
        pub struct equal_to {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Copy, Clone)]
        pub struct unordered_map {
            pub _address: u8,
        }
        pub type unordered_map__Hashtable = u8;
        pub type unordered_map_key_type = u8;
        pub type unordered_map_value_type = u8;
        pub type unordered_map_mapped_type = u8;
        pub type unordered_map_hasher = u8;
        pub type unordered_map_key_equal = u8;
        pub type unordered_map_allocator_type = u8;
        pub type unordered_map_pointer = u8;
        pub type unordered_map_const_pointer = u8;
        pub type unordered_map_reference = u8;
        pub type unordered_map_const_reference = u8;
        pub type unordered_map_iterator = u8;
        pub type unordered_map_const_iterator = u8;
        pub type unordered_map_local_iterator = u8;
        pub type unordered_map_const_local_iterator = u8;
        pub type unordered_map_size_type = u8;
        pub type unordered_map_difference_type = u8;
        #[repr(C)]
        #[derive(Copy, Clone)]
        pub struct vector {
            pub _address: u8,
        }
        pub type vector__Base = u8;
        pub type vector__Tp_alloc_type = u8;
        pub type vector__Alloc_traits = u8;
        pub type vector_value_type = u8;
        pub type vector_pointer = u8;
        pub type vector_const_pointer = u8;
        pub type vector_reference = u8;
        pub type vector_const_reference = u8;
        pub type vector_iterator = u8;
        pub type vector_const_iterator = u8;
        pub type vector_const_reverse_iterator = u8;
        pub type vector_reverse_iterator = u8;
        pub type vector_size_type = u64;
        pub type vector_difference_type = u64;
        pub type vector_allocator_type = u8;
        #[repr(C)]
        #[derive(Copy, Clone)]
        pub struct vector__Temporary_value {
            pub _address: u8,
        }
        #[repr(C)]
        #[repr(align(1))]
        #[derive(Copy, Clone)]
        pub union vector__Temporary_value__Storage {
            pub _bindgen_opaque_blob: u8,
        }
        pub type nano = u8;
        pub type milli = u8;
        pub mod chrono {
            #[allow(unused_imports)]
            use self::super::super::super::root;
            #[repr(C)]
            #[derive(Copy, Clone)]
            pub struct duration {
                pub _address: u8,
            }
            pub type duration___is_float = u8;
            pub type duration___divide = u8;
            pub type duration___is_harmonic = u8;
            pub type duration_rep = u8;
            pub type duration_period = u8;
        }
        #[repr(C)]
        #[repr(align(8))]
        #[derive(Copy, Clone)]
        pub struct recursive_mutex {
            pub _bindgen_opaque_blob: [u64; 5usize],
        }
        pub type recursive_mutex_native_handle_type = u64;
        #[test]
        fn bindgen_test_layout_recursive_mutex() {
            assert_eq!(
                ::std::mem::size_of::<recursive_mutex>(),
                40usize,
                concat!("Size of: ", stringify!(recursive_mutex))
            );
            assert_eq!(
                ::std::mem::align_of::<recursive_mutex>(),
                8usize,
                concat!("Alignment of ", stringify!(recursive_mutex))
            );
        }
        extern "C" {
            #[link_name = "\u{1}_ZNSt15recursive_mutex4lockEv"]
            pub fn recursive_mutex_lock(this: *mut root::std::recursive_mutex);
        }
        extern "C" {
            #[link_name = "\u{1}_ZNSt15recursive_mutex8try_lockEv"]
            pub fn recursive_mutex_try_lock(this: *mut root::std::recursive_mutex) -> bool;
        }
        extern "C" {
            #[link_name = "\u{1}_ZNSt15recursive_mutex6unlockEv"]
            pub fn recursive_mutex_unlock(this: *mut root::std::recursive_mutex);
        }
        extern "C" {
            #[link_name = "\u{1}_ZNSt15recursive_mutex13native_handleEv"]
            pub fn recursive_mutex_native_handle(
                this: *mut root::std::recursive_mutex,
            ) -> root::std::recursive_mutex_native_handle_type;
        }
        extern "C" {
            #[link_name = "\u{1}_ZNSt15recursive_mutexC1Ev"]
            pub fn recursive_mutex_recursive_mutex(this: *mut root::std::recursive_mutex);
        }
        extern "C" {
            #[link_name = "\u{1}_ZNSt15recursive_mutexD1Ev"]
            pub fn recursive_mutex_recursive_mutex_destructor(
                this: *mut root::std::recursive_mutex,
            );
        }
        impl recursive_mutex {
            #[inline]
            pub unsafe fn lock(&mut self) {
                recursive_mutex_lock(self)
            }
            #[inline]
            pub unsafe fn try_lock(&mut self) -> bool {
                recursive_mutex_try_lock(self)
            }
            #[inline]
            pub unsafe fn unlock(&mut self) {
                recursive_mutex_unlock(self)
            }
            #[inline]
            pub unsafe fn native_handle(
                &mut self,
            ) -> root::std::recursive_mutex_native_handle_type {
                recursive_mutex_native_handle(self)
            }
            #[inline]
            pub unsafe fn new() -> Self {
                let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
                recursive_mutex_recursive_mutex(__bindgen_tmp.as_mut_ptr());
                __bindgen_tmp.assume_init()
            }
            #[inline]
            pub unsafe fn destruct(&mut self) {
                recursive_mutex_recursive_mutex_destructor(self)
            }
        }
        #[repr(C)]
        #[derive(Copy, Clone)]
        pub struct function {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Copy, Clone)]
        pub struct default_delete {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Copy, Clone)]
        pub struct unique_ptr {
            pub _address: u8,
        }
        pub type unique_ptr__DeleterConstraint = u8;
        pub type unique_ptr_pointer = u8;
        pub type unique_ptr_element_type = u8;
        pub type unique_ptr_deleter_type = u8;
        pub type unique_ptr___safe_conversion_up = u8;
        pub type string = [u64; 4usize];
        #[repr(C)]
        #[derive(Copy, Clone)]
        pub struct shared_ptr {
            pub _address: u8,
        }
        pub type shared_ptr__Constructible = u8;
        pub type shared_ptr__Assignable = u8;
        pub type shared_ptr_element_type = u8;
        #[repr(C)]
        #[derive(Copy, Clone)]
        pub struct weak_ptr {
            pub _address: u8,
        }
        pub type weak_ptr__Constructible = u8;
        pub type weak_ptr__Assignable = u8;
        pub type array_value_type = u8;
        pub type array_pointer = u8;
        pub type array_const_pointer = u8;
        pub type array_reference = u8;
        pub type array_const_reference = u8;
        pub type array_iterator = u8;
        pub type array_const_iterator = u8;
        pub type array_size_type = u64;
        pub type array_difference_type = u64;
        pub type array_reverse_iterator = u8;
        pub type array_const_reverse_iterator = u8;
        #[repr(C)]
        #[derive(Copy, Clone)]
        pub struct char_traits {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Copy, Clone)]
        pub struct atomic {
            pub _address: u8,
        }
        pub type atomic_value_type = u8;
        #[repr(C)]
        #[derive(Copy, Clone)]
        pub struct deque {
            pub _address: u8,
        }
        pub type deque__Base = u8;
        pub type deque__Tp_alloc_type = u8;
        pub type deque__Alloc_traits = u8;
        pub type deque__Map_pointer = u8;
        pub type deque_value_type = u8;
        pub type deque_pointer = u8;
        pub type deque_const_pointer = u8;
        pub type deque_reference = u8;
        pub type deque_const_reference = u8;
        pub type deque_iterator = u8;
        pub type deque_const_iterator = u8;
        pub type deque_const_reverse_iterator = u8;
        pub type deque_reverse_iterator = u8;
        pub type deque_size_type = u64;
        pub type deque_difference_type = u64;
        pub type deque_allocator_type = u8;
        #[repr(C)]
        #[repr(align(8))]
        #[derive(Copy, Clone)]
        pub struct thread {
            pub _bindgen_opaque_blob: u64,
        }
        pub type thread_native_handle_type = u64;
        #[repr(C)]
        #[repr(align(8))]
        #[derive(Copy, Clone)]
        pub struct thread_id {
            pub _bindgen_opaque_blob: u64,
        }
        #[test]
        fn bindgen_test_layout_thread_id() {
            assert_eq!(
                ::std::mem::size_of::<thread_id>(),
                8usize,
                concat!("Size of: ", stringify!(thread_id))
            );
            assert_eq!(
                ::std::mem::align_of::<thread_id>(),
                8usize,
                concat!("Alignment of ", stringify!(thread_id))
            );
        }
        extern "C" {
            #[link_name = "\u{1}_ZNSt6thread2idC1Ev"]
            pub fn thread_id_id(this: *mut root::std::thread_id);
        }
        extern "C" {
            #[link_name = "\u{1}_ZNSt6thread2idC1Em"]
            pub fn thread_id_id1(
                this: *mut root::std::thread_id,
                __id: root::std::thread_native_handle_type,
            );
        }
        impl thread_id {
            #[inline]
            pub unsafe fn new() -> Self {
                let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
                thread_id_id(__bindgen_tmp.as_mut_ptr());
                __bindgen_tmp.assume_init()
            }
            #[inline]
            pub unsafe fn new1(__id: root::std::thread_native_handle_type) -> Self {
                let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
                thread_id_id1(__bindgen_tmp.as_mut_ptr(), __id);
                __bindgen_tmp.assume_init()
            }
        }
        pub type thread___not_same = u8;
        #[repr(C)]
        #[repr(align(8))]
        #[derive(Copy, Clone)]
        pub struct thread__State {
            pub _bindgen_opaque_blob: u64,
        }
        #[test]
        fn bindgen_test_layout_thread__State() {
            assert_eq!(
                ::std::mem::size_of::<thread__State>(),
                8usize,
                concat!("Size of: ", stringify!(thread__State))
            );
            assert_eq!(
                ::std::mem::align_of::<thread__State>(),
                8usize,
                concat!("Alignment of ", stringify!(thread__State))
            );
        }
        pub type thread__State_ptr = u64;
        #[repr(C)]
        #[derive(Copy, Clone)]
        pub struct thread__State_impl {}
        #[repr(C)]
        #[derive(Copy, Clone)]
        pub struct thread__Invoker {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Copy, Clone)]
        pub struct thread__Invoker___result {
            pub _address: u8,
        }
        pub type thread__Call_wrapper = u8;
        #[test]
        fn bindgen_test_layout_thread() {
            assert_eq!(
                ::std::mem::size_of::<thread>(),
                8usize,
                concat!("Size of: ", stringify!(thread))
            );
            assert_eq!(
                ::std::mem::align_of::<thread>(),
                8usize,
                concat!("Alignment of ", stringify!(thread))
            );
        }
        extern "C" {
            #[link_name = "\u{1}_ZNSt6thread4swapERS_"]
            pub fn thread_swap(this: *mut root::std::thread, __t: *mut root::std::thread);
        }
        extern "C" {
            #[link_name = "\u{1}_ZNKSt6thread8joinableEv"]
            pub fn thread_joinable(this: *const root::std::thread) -> bool;
        }
        extern "C" {
            #[link_name = "\u{1}_ZNSt6thread4joinEv"]
            pub fn thread_join(this: *mut root::std::thread);
        }
        extern "C" {
            #[link_name = "\u{1}_ZNSt6thread6detachEv"]
            pub fn thread_detach(this: *mut root::std::thread);
        }
        extern "C" {
            #[link_name = "\u{1}_ZNKSt6thread6get_idEv"]
            pub fn thread_get_id(this: *const root::std::thread) -> root::std::thread_id;
        }
        extern "C" {
            #[link_name = "\u{1}_ZNSt6thread13native_handleEv"]
            pub fn thread_native_handle(
                this: *mut root::std::thread,
            ) -> root::std::thread_native_handle_type;
        }
        extern "C" {
            #[link_name = "\u{1}_ZNSt6thread20hardware_concurrencyEv"]
            pub fn thread_hardware_concurrency() -> ::std::os::raw::c_uint;
        }
        extern "C" {
            #[link_name = "\u{1}_ZNSt6threadC1Ev"]
            pub fn thread_thread(this: *mut root::std::thread);
        }
        extern "C" {
            #[link_name = "\u{1}_ZNSt6threadC1EOS_"]
            pub fn thread_thread1(this: *mut root::std::thread, __t: *mut root::std::thread);
        }
        extern "C" {
            #[link_name = "\u{1}_ZNSt6threadD1Ev"]
            pub fn thread_thread_destructor(this: *mut root::std::thread);
        }
        impl thread {
            #[inline]
            pub unsafe fn swap(&mut self, __t: *mut root::std::thread) {
                thread_swap(self, __t)
            }
            #[inline]
            pub unsafe fn joinable(&self) -> bool {
                thread_joinable(self)
            }
            #[inline]
            pub unsafe fn join(&mut self) {
                thread_join(self)
            }
            #[inline]
            pub unsafe fn detach(&mut self) {
                thread_detach(self)
            }
            #[inline]
            pub unsafe fn get_id(&self) -> root::std::thread_id {
                thread_get_id(self)
            }
            #[inline]
            pub unsafe fn native_handle(&mut self) -> root::std::thread_native_handle_type {
                thread_native_handle(self)
            }
            #[inline]
            pub unsafe fn hardware_concurrency() -> ::std::os::raw::c_uint {
                thread_hardware_concurrency()
            }
            #[inline]
            pub unsafe fn new() -> Self {
                let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
                thread_thread(__bindgen_tmp.as_mut_ptr());
                __bindgen_tmp.assume_init()
            }
            #[inline]
            pub unsafe fn new1(__t: *mut root::std::thread) -> Self {
                let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
                thread_thread1(__bindgen_tmp.as_mut_ptr(), __t);
                __bindgen_tmp.assume_init()
            }
            #[inline]
            pub unsafe fn destruct(&mut self) {
                thread_thread_destructor(self)
            }
        }
        extern "C" {
            #[link_name = "\u{1}_ZNSt6thread6_StateD1Ev"]
            pub fn thread__State__State_destructor(this: *mut root::std::thread__State);
        }
    }
    pub mod __gnu_cxx {
        #[allow(unused_imports)]
        use self::super::super::root;
    }
    pub type __off_t = ::std::os::raw::c_long;
    pub type off_t = root::__off_t;
    pub mod aeron {
        #[allow(unused_imports)]
        use self::super::super::root;
        pub mod util {
            #[allow(unused_imports)]
            use self::super::super::super::root;
            pub type Iterator = [u8; 0usize];
            #[repr(C)]
            pub struct InvokeOnScopeExit {
                pub m_func: root::aeron::util::InvokeOnScopeExit_func_t,
            }
            pub type InvokeOnScopeExit_func_t = [u64; 4usize];
            #[test]
            fn bindgen_test_layout_InvokeOnScopeExit() {
                const UNINIT: ::std::mem::MaybeUninit<InvokeOnScopeExit> =
                    ::std::mem::MaybeUninit::uninit();
                let ptr = UNINIT.as_ptr();
                assert_eq!(
                    ::std::mem::size_of::<InvokeOnScopeExit>(),
                    32usize,
                    concat!("Size of: ", stringify!(InvokeOnScopeExit))
                );
                assert_eq!(
                    ::std::mem::align_of::<InvokeOnScopeExit>(),
                    8usize,
                    concat!("Alignment of ", stringify!(InvokeOnScopeExit))
                );
                assert_eq!(
                    unsafe { ::std::ptr::addr_of!((*ptr).m_func) as usize - ptr as usize },
                    0usize,
                    concat!(
                        "Offset of field: ",
                        stringify!(InvokeOnScopeExit),
                        "::",
                        stringify!(m_func)
                    )
                );
            }
            extern "C" {
                #[link_name = "\u{1}_ZN5aeron4util17InvokeOnScopeExitC1ERKSt8functionIFvvEE"]
                pub fn InvokeOnScopeExit_InvokeOnScopeExit(
                    this: *mut root::aeron::util::InvokeOnScopeExit,
                    func: *const root::aeron::util::InvokeOnScopeExit_func_t,
                );
            }
            extern "C" {
                #[link_name = "\u{1}_ZN5aeron4util17InvokeOnScopeExitD1Ev"]
                pub fn InvokeOnScopeExit_InvokeOnScopeExit_destructor(
                    this: *mut root::aeron::util::InvokeOnScopeExit,
                );
            }
            impl InvokeOnScopeExit {
                #[inline]
                pub unsafe fn new(
                    func: *const root::aeron::util::InvokeOnScopeExit_func_t,
                ) -> Self {
                    let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
                    InvokeOnScopeExit_InvokeOnScopeExit(__bindgen_tmp.as_mut_ptr(), func);
                    __bindgen_tmp.assume_init()
                }
                #[inline]
                pub unsafe fn destruct(&mut self) {
                    InvokeOnScopeExit_InvokeOnScopeExit_destructor(self)
                }
            }
            #[repr(C)]
            pub struct OnScopeExit {
                pub m_holder: u64,
            }
            #[repr(C)]
            pub struct OnScopeExit_FuncHolderBase__bindgen_vtable(::std::os::raw::c_void);
            #[repr(C)]
            pub struct OnScopeExit_FuncHolderBase {
                pub vtable_: *const OnScopeExit_FuncHolderBase__bindgen_vtable,
            }
            #[test]
            fn bindgen_test_layout_OnScopeExit_FuncHolderBase() {
                assert_eq!(
                    ::std::mem::size_of::<OnScopeExit_FuncHolderBase>(),
                    8usize,
                    concat!("Size of: ", stringify!(OnScopeExit_FuncHolderBase))
                );
                assert_eq!(
                    ::std::mem::align_of::<OnScopeExit_FuncHolderBase>(),
                    8usize,
                    concat!("Alignment of ", stringify!(OnScopeExit_FuncHolderBase))
                );
            }
            #[repr(C)]
            pub struct OnScopeExit_FuncHolder<func_t> {
                pub _base: root::aeron::util::OnScopeExit_FuncHolderBase,
                pub f: func_t,
                pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<func_t>>,
            }
            #[test]
            fn bindgen_test_layout_OnScopeExit() {
                const UNINIT: ::std::mem::MaybeUninit<OnScopeExit> =
                    ::std::mem::MaybeUninit::uninit();
                let ptr = UNINIT.as_ptr();
                assert_eq!(
                    ::std::mem::size_of::<OnScopeExit>(),
                    8usize,
                    concat!("Size of: ", stringify!(OnScopeExit))
                );
                assert_eq!(
                    ::std::mem::align_of::<OnScopeExit>(),
                    8usize,
                    concat!("Alignment of ", stringify!(OnScopeExit))
                );
                assert_eq!(
                    unsafe { ::std::ptr::addr_of!((*ptr).m_holder) as usize - ptr as usize },
                    0usize,
                    concat!(
                        "Offset of field: ",
                        stringify!(OnScopeExit),
                        "::",
                        stringify!(m_holder)
                    )
                );
            }
            extern "C" {
                #[link_name = "\u{1}_ZN5aeron4util11OnScopeExit14FuncHolderBaseD1Ev"]
                pub fn OnScopeExit_FuncHolderBase_FuncHolderBase_destructor(
                    this: *mut root::aeron::util::OnScopeExit_FuncHolderBase,
                );
            }
            #[repr(C)]
            pub struct CallbackGuard {
                pub m_isInCallback: *mut bool,
            }
            #[test]
            fn bindgen_test_layout_CallbackGuard() {
                const UNINIT: ::std::mem::MaybeUninit<CallbackGuard> =
                    ::std::mem::MaybeUninit::uninit();
                let ptr = UNINIT.as_ptr();
                assert_eq!(
                    ::std::mem::size_of::<CallbackGuard>(),
                    8usize,
                    concat!("Size of: ", stringify!(CallbackGuard))
                );
                assert_eq!(
                    ::std::mem::align_of::<CallbackGuard>(),
                    8usize,
                    concat!("Alignment of ", stringify!(CallbackGuard))
                );
                assert_eq!(
                    unsafe { ::std::ptr::addr_of!((*ptr).m_isInCallback) as usize - ptr as usize },
                    0usize,
                    concat!(
                        "Offset of field: ",
                        stringify!(CallbackGuard),
                        "::",
                        stringify!(m_isInCallback)
                    )
                );
            }
            extern "C" {
                #[link_name = "\u{1}_ZN5aeron4util13CallbackGuardC1ERb"]
                pub fn CallbackGuard_CallbackGuard(
                    this: *mut root::aeron::util::CallbackGuard,
                    isInCallback: *mut bool,
                );
            }
            extern "C" {
                #[link_name = "\u{1}_ZN5aeron4util13CallbackGuardD1Ev"]
                pub fn CallbackGuard_CallbackGuard_destructor(
                    this: *mut root::aeron::util::CallbackGuard,
                );
            }
            impl CallbackGuard {
                #[inline]
                pub unsafe fn new(isInCallback: *mut bool) -> Self {
                    let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
                    CallbackGuard_CallbackGuard(__bindgen_tmp.as_mut_ptr(), isInCallback);
                    __bindgen_tmp.assume_init()
                }
                #[inline]
                pub unsafe fn destruct(&mut self) {
                    CallbackGuard_CallbackGuard_destructor(self)
                }
            }
            pub type index_t = ::std::os::raw::c_int;
            pub type exception_handler_t = [u64; 4usize];
            pub const ExceptionCategory_EXCEPTION_CATEGORY_FATAL:
                root::aeron::util::ExceptionCategory = 0;
            pub const ExceptionCategory_EXCEPTION_CATEGORY_ERROR:
                root::aeron::util::ExceptionCategory = 1;
            pub const ExceptionCategory_EXCEPTION_CATEGORY_WARN:
                root::aeron::util::ExceptionCategory = 2;
            pub type ExceptionCategory = ::std::os::raw::c_long;
            #[repr(C)]
            pub struct SourcedException {
                pub _base: root::std::exception,
                pub m_where: root::std::string,
                pub m_what: root::std::string,
                pub m_category: root::aeron::util::ExceptionCategory,
            }
            #[test]
            fn bindgen_test_layout_SourcedException() {
                const UNINIT: ::std::mem::MaybeUninit<SourcedException> =
                    ::std::mem::MaybeUninit::uninit();
                let ptr = UNINIT.as_ptr();
                assert_eq!(
                    ::std::mem::size_of::<SourcedException>(),
                    80usize,
                    concat!("Size of: ", stringify!(SourcedException))
                );
                assert_eq!(
                    ::std::mem::align_of::<SourcedException>(),
                    8usize,
                    concat!("Alignment of ", stringify!(SourcedException))
                );
                assert_eq!(
                    unsafe { ::std::ptr::addr_of!((*ptr).m_where) as usize - ptr as usize },
                    8usize,
                    concat!(
                        "Offset of field: ",
                        stringify!(SourcedException),
                        "::",
                        stringify!(m_where)
                    )
                );
                assert_eq!(
                    unsafe { ::std::ptr::addr_of!((*ptr).m_what) as usize - ptr as usize },
                    40usize,
                    concat!(
                        "Offset of field: ",
                        stringify!(SourcedException),
                        "::",
                        stringify!(m_what)
                    )
                );
                assert_eq!(
                    unsafe { ::std::ptr::addr_of!((*ptr).m_category) as usize - ptr as usize },
                    72usize,
                    concat!(
                        "Offset of field: ",
                        stringify!(SourcedException),
                        "::",
                        stringify!(m_category)
                    )
                );
            }
            extern "C" {
                #[link_name = "\u{1}_ZNK5aeron4util16SourcedException5whereEv"]
                pub fn SourcedException_where(
                    this: *const root::aeron::util::SourcedException,
                ) -> *const ::std::os::raw::c_char;
            }
            extern "C" {
                #[link_name = "\u{1}_ZNK5aeron4util16SourcedException8categoryEv"]
                pub fn SourcedException_category(
                    this: *const root::aeron::util::SourcedException,
                ) -> root::aeron::util::ExceptionCategory;
            }
            extern "C" {
                #[link_name = "\u{1}_ZN5aeron4util16SourcedExceptionC1ENS0_17ExceptionCategoryERKNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEESA_SA_i"]
                pub fn SourcedException_SourcedException(
                    this: *mut root::aeron::util::SourcedException,
                    category: root::aeron::util::ExceptionCategory,
                    what: *const root::std::string,
                    function: *const root::std::string,
                    file: *const root::std::string,
                    line: ::std::os::raw::c_int,
                );
            }
            extern "C" {
                #[link_name = "\u{1}_ZN5aeron4util16SourcedExceptionC1ERKNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEES9_S9_i"]
                pub fn SourcedException_SourcedException1(
                    this: *mut root::aeron::util::SourcedException,
                    what: *const root::std::string,
                    function: *const root::std::string,
                    file: *const root::std::string,
                    line: ::std::os::raw::c_int,
                );
            }
            impl SourcedException {
                #[inline]
                pub unsafe fn where_(&self) -> *const ::std::os::raw::c_char {
                    SourcedException_where(self)
                }
                #[inline]
                pub unsafe fn category(&self) -> root::aeron::util::ExceptionCategory {
                    SourcedException_category(self)
                }
                #[inline]
                pub unsafe fn new(
                    category: root::aeron::util::ExceptionCategory,
                    what: *const root::std::string,
                    function: *const root::std::string,
                    file: *const root::std::string,
                    line: ::std::os::raw::c_int,
                ) -> Self {
                    let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
                    SourcedException_SourcedException(
                        __bindgen_tmp.as_mut_ptr(),
                        category,
                        what,
                        function,
                        file,
                        line,
                    );
                    __bindgen_tmp.assume_init()
                }
                #[inline]
                pub unsafe fn new1(
                    what: *const root::std::string,
                    function: *const root::std::string,
                    file: *const root::std::string,
                    line: ::std::os::raw::c_int,
                ) -> Self {
                    let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
                    SourcedException_SourcedException1(
                        __bindgen_tmp.as_mut_ptr(),
                        what,
                        function,
                        file,
                        line,
                    );
                    __bindgen_tmp.assume_init()
                }
            }
            extern "C" {
                #[link_name = "\u{1}_ZNK5aeron4util16SourcedException4whatEv"]
                pub fn SourcedException_what(
                    this: *mut ::std::os::raw::c_void,
                ) -> *const ::std::os::raw::c_char;
            }
            #[repr(C)]
            pub struct IOException {
                pub _base: root::aeron::util::SourcedException,
            }
            #[test]
            fn bindgen_test_layout_IOException() {
                assert_eq!(
                    ::std::mem::size_of::<IOException>(),
                    80usize,
                    concat!("Size of: ", stringify!(IOException))
                );
                assert_eq!(
                    ::std::mem::align_of::<IOException>(),
                    8usize,
                    concat!("Alignment of ", stringify!(IOException))
                );
            }
            extern "C" {
                #[link_name = "\u{1}_ZN5aeron4util11IOExceptionC1ERKNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEES9_S9_i"]
                pub fn IOException_IOException(
                    this: *mut root::aeron::util::IOException,
                    what: *const root::std::string,
                    function: *const root::std::string,
                    file: *const root::std::string,
                    line: ::std::os::raw::c_int,
                );
            }
            impl IOException {
                #[inline]
                pub unsafe fn new(
                    what: *const root::std::string,
                    function: *const root::std::string,
                    file: *const root::std::string,
                    line: ::std::os::raw::c_int,
                ) -> Self {
                    let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
                    IOException_IOException(__bindgen_tmp.as_mut_ptr(), what, function, file, line);
                    __bindgen_tmp.assume_init()
                }
            }
            #[repr(C)]
            pub struct FormatException {
                pub _base: root::aeron::util::SourcedException,
            }
            #[test]
            fn bindgen_test_layout_FormatException() {
                assert_eq!(
                    ::std::mem::size_of::<FormatException>(),
                    80usize,
                    concat!("Size of: ", stringify!(FormatException))
                );
                assert_eq!(
                    ::std::mem::align_of::<FormatException>(),
                    8usize,
                    concat!("Alignment of ", stringify!(FormatException))
                );
            }
            extern "C" {
                #[link_name = "\u{1}_ZN5aeron4util15FormatExceptionC1ERKNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEES9_S9_i"]
                pub fn FormatException_FormatException(
                    this: *mut root::aeron::util::FormatException,
                    what: *const root::std::string,
                    function: *const root::std::string,
                    file: *const root::std::string,
                    line: ::std::os::raw::c_int,
                );
            }
            impl FormatException {
                #[inline]
                pub unsafe fn new(
                    what: *const root::std::string,
                    function: *const root::std::string,
                    file: *const root::std::string,
                    line: ::std::os::raw::c_int,
                ) -> Self {
                    let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
                    FormatException_FormatException(
                        __bindgen_tmp.as_mut_ptr(),
                        what,
                        function,
                        file,
                        line,
                    );
                    __bindgen_tmp.assume_init()
                }
            }
            #[repr(C)]
            pub struct OutOfBoundsException {
                pub _base: root::aeron::util::SourcedException,
            }
            #[test]
            fn bindgen_test_layout_OutOfBoundsException() {
                assert_eq!(
                    ::std::mem::size_of::<OutOfBoundsException>(),
                    80usize,
                    concat!("Size of: ", stringify!(OutOfBoundsException))
                );
                assert_eq!(
                    ::std::mem::align_of::<OutOfBoundsException>(),
                    8usize,
                    concat!("Alignment of ", stringify!(OutOfBoundsException))
                );
            }
            extern "C" {
                #[link_name = "\u{1}_ZN5aeron4util20OutOfBoundsExceptionC1ERKNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEES9_S9_i"]
                pub fn OutOfBoundsException_OutOfBoundsException(
                    this: *mut root::aeron::util::OutOfBoundsException,
                    what: *const root::std::string,
                    function: *const root::std::string,
                    file: *const root::std::string,
                    line: ::std::os::raw::c_int,
                );
            }
            impl OutOfBoundsException {
                #[inline]
                pub unsafe fn new(
                    what: *const root::std::string,
                    function: *const root::std::string,
                    file: *const root::std::string,
                    line: ::std::os::raw::c_int,
                ) -> Self {
                    let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
                    OutOfBoundsException_OutOfBoundsException(
                        __bindgen_tmp.as_mut_ptr(),
                        what,
                        function,
                        file,
                        line,
                    );
                    __bindgen_tmp.assume_init()
                }
            }
            #[repr(C)]
            pub struct ParseException {
                pub _base: root::aeron::util::SourcedException,
            }
            #[test]
            fn bindgen_test_layout_ParseException() {
                assert_eq!(
                    ::std::mem::size_of::<ParseException>(),
                    80usize,
                    concat!("Size of: ", stringify!(ParseException))
                );
                assert_eq!(
                    ::std::mem::align_of::<ParseException>(),
                    8usize,
                    concat!("Alignment of ", stringify!(ParseException))
                );
            }
            extern "C" {
                #[link_name = "\u{1}_ZN5aeron4util14ParseExceptionC1ERKNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEES9_S9_i"]
                pub fn ParseException_ParseException(
                    this: *mut root::aeron::util::ParseException,
                    what: *const root::std::string,
                    function: *const root::std::string,
                    file: *const root::std::string,
                    line: ::std::os::raw::c_int,
                );
            }
            impl ParseException {
                #[inline]
                pub unsafe fn new(
                    what: *const root::std::string,
                    function: *const root::std::string,
                    file: *const root::std::string,
                    line: ::std::os::raw::c_int,
                ) -> Self {
                    let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
                    ParseException_ParseException(
                        __bindgen_tmp.as_mut_ptr(),
                        what,
                        function,
                        file,
                        line,
                    );
                    __bindgen_tmp.assume_init()
                }
            }
            #[repr(C)]
            pub struct ElementNotFound {
                pub _base: root::aeron::util::SourcedException,
            }
            #[test]
            fn bindgen_test_layout_ElementNotFound() {
                assert_eq!(
                    ::std::mem::size_of::<ElementNotFound>(),
                    80usize,
                    concat!("Size of: ", stringify!(ElementNotFound))
                );
                assert_eq!(
                    ::std::mem::align_of::<ElementNotFound>(),
                    8usize,
                    concat!("Alignment of ", stringify!(ElementNotFound))
                );
            }
            extern "C" {
                #[link_name = "\u{1}_ZN5aeron4util15ElementNotFoundC1ERKNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEES9_S9_i"]
                pub fn ElementNotFound_ElementNotFound(
                    this: *mut root::aeron::util::ElementNotFound,
                    what: *const root::std::string,
                    function: *const root::std::string,
                    file: *const root::std::string,
                    line: ::std::os::raw::c_int,
                );
            }
            impl ElementNotFound {
                #[inline]
                pub unsafe fn new(
                    what: *const root::std::string,
                    function: *const root::std::string,
                    file: *const root::std::string,
                    line: ::std::os::raw::c_int,
                ) -> Self {
                    let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
                    ElementNotFound_ElementNotFound(
                        __bindgen_tmp.as_mut_ptr(),
                        what,
                        function,
                        file,
                        line,
                    );
                    __bindgen_tmp.assume_init()
                }
            }
            #[repr(C)]
            pub struct IllegalArgumentException {
                pub _base: root::aeron::util::SourcedException,
            }
            #[test]
            fn bindgen_test_layout_IllegalArgumentException() {
                assert_eq!(
                    ::std::mem::size_of::<IllegalArgumentException>(),
                    80usize,
                    concat!("Size of: ", stringify!(IllegalArgumentException))
                );
                assert_eq!(
                    ::std::mem::align_of::<IllegalArgumentException>(),
                    8usize,
                    concat!("Alignment of ", stringify!(IllegalArgumentException))
                );
            }
            extern "C" {
                #[link_name = "\u{1}_ZN5aeron4util24IllegalArgumentExceptionC1ERKNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEES9_S9_i"]
                pub fn IllegalArgumentException_IllegalArgumentException(
                    this: *mut root::aeron::util::IllegalArgumentException,
                    what: *const root::std::string,
                    function: *const root::std::string,
                    file: *const root::std::string,
                    line: ::std::os::raw::c_int,
                );
            }
            impl IllegalArgumentException {
                #[inline]
                pub unsafe fn new(
                    what: *const root::std::string,
                    function: *const root::std::string,
                    file: *const root::std::string,
                    line: ::std::os::raw::c_int,
                ) -> Self {
                    let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
                    IllegalArgumentException_IllegalArgumentException(
                        __bindgen_tmp.as_mut_ptr(),
                        what,
                        function,
                        file,
                        line,
                    );
                    __bindgen_tmp.assume_init()
                }
            }
            #[repr(C)]
            pub struct IllegalStateException {
                pub _base: root::aeron::util::SourcedException,
            }
            #[test]
            fn bindgen_test_layout_IllegalStateException() {
                assert_eq!(
                    ::std::mem::size_of::<IllegalStateException>(),
                    80usize,
                    concat!("Size of: ", stringify!(IllegalStateException))
                );
                assert_eq!(
                    ::std::mem::align_of::<IllegalStateException>(),
                    8usize,
                    concat!("Alignment of ", stringify!(IllegalStateException))
                );
            }
            extern "C" {
                #[link_name = "\u{1}_ZN5aeron4util21IllegalStateExceptionC1ERKNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEES9_S9_i"]
                pub fn IllegalStateException_IllegalStateException(
                    this: *mut root::aeron::util::IllegalStateException,
                    what: *const root::std::string,
                    function: *const root::std::string,
                    file: *const root::std::string,
                    line: ::std::os::raw::c_int,
                );
            }
            impl IllegalStateException {
                #[inline]
                pub unsafe fn new(
                    what: *const root::std::string,
                    function: *const root::std::string,
                    file: *const root::std::string,
                    line: ::std::os::raw::c_int,
                ) -> Self {
                    let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
                    IllegalStateException_IllegalStateException(
                        __bindgen_tmp.as_mut_ptr(),
                        what,
                        function,
                        file,
                        line,
                    );
                    __bindgen_tmp.assume_init()
                }
            }
            #[repr(C)]
            pub struct DriverTimeoutException {
                pub _base: root::aeron::util::SourcedException,
            }
            #[test]
            fn bindgen_test_layout_DriverTimeoutException() {
                assert_eq!(
                    ::std::mem::size_of::<DriverTimeoutException>(),
                    80usize,
                    concat!("Size of: ", stringify!(DriverTimeoutException))
                );
                assert_eq!(
                    ::std::mem::align_of::<DriverTimeoutException>(),
                    8usize,
                    concat!("Alignment of ", stringify!(DriverTimeoutException))
                );
            }
            extern "C" {
                #[link_name = "\u{1}_ZN5aeron4util22DriverTimeoutExceptionC1ERKNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEES9_S9_i"]
                pub fn DriverTimeoutException_DriverTimeoutException(
                    this: *mut root::aeron::util::DriverTimeoutException,
                    what: *const root::std::string,
                    function: *const root::std::string,
                    file: *const root::std::string,
                    line: ::std::os::raw::c_int,
                );
            }
            impl DriverTimeoutException {
                #[inline]
                pub unsafe fn new(
                    what: *const root::std::string,
                    function: *const root::std::string,
                    file: *const root::std::string,
                    line: ::std::os::raw::c_int,
                ) -> Self {
                    let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
                    DriverTimeoutException_DriverTimeoutException(
                        __bindgen_tmp.as_mut_ptr(),
                        what,
                        function,
                        file,
                        line,
                    );
                    __bindgen_tmp.assume_init()
                }
            }
            #[repr(C)]
            pub struct ConductorServiceTimeoutException {
                pub _base: root::aeron::util::SourcedException,
            }
            #[test]
            fn bindgen_test_layout_ConductorServiceTimeoutException() {
                assert_eq!(
                    ::std::mem::size_of::<ConductorServiceTimeoutException>(),
                    80usize,
                    concat!("Size of: ", stringify!(ConductorServiceTimeoutException))
                );
                assert_eq!(
                    ::std::mem::align_of::<ConductorServiceTimeoutException>(),
                    8usize,
                    concat!(
                        "Alignment of ",
                        stringify!(ConductorServiceTimeoutException)
                    )
                );
            }
            extern "C" {
                #[link_name = "\u{1}_ZN5aeron4util32ConductorServiceTimeoutExceptionC1ERKNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEES9_S9_i"]
                pub fn ConductorServiceTimeoutException_ConductorServiceTimeoutException(
                    this: *mut root::aeron::util::ConductorServiceTimeoutException,
                    what: *const root::std::string,
                    function: *const root::std::string,
                    file: *const root::std::string,
                    line: ::std::os::raw::c_int,
                );
            }
            impl ConductorServiceTimeoutException {
                #[inline]
                pub unsafe fn new(
                    what: *const root::std::string,
                    function: *const root::std::string,
                    file: *const root::std::string,
                    line: ::std::os::raw::c_int,
                ) -> Self {
                    let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
                    ConductorServiceTimeoutException_ConductorServiceTimeoutException(
                        __bindgen_tmp.as_mut_ptr(),
                        what,
                        function,
                        file,
                        line,
                    );
                    __bindgen_tmp.assume_init()
                }
            }
            #[repr(C)]
            pub struct ClientTimeoutException {
                pub _base: root::aeron::util::SourcedException,
            }
            #[test]
            fn bindgen_test_layout_ClientTimeoutException() {
                assert_eq!(
                    ::std::mem::size_of::<ClientTimeoutException>(),
                    80usize,
                    concat!("Size of: ", stringify!(ClientTimeoutException))
                );
                assert_eq!(
                    ::std::mem::align_of::<ClientTimeoutException>(),
                    8usize,
                    concat!("Alignment of ", stringify!(ClientTimeoutException))
                );
            }
            extern "C" {
                #[link_name = "\u{1}_ZN5aeron4util22ClientTimeoutExceptionC1ERKNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEES9_S9_i"]
                pub fn ClientTimeoutException_ClientTimeoutException(
                    this: *mut root::aeron::util::ClientTimeoutException,
                    what: *const root::std::string,
                    function: *const root::std::string,
                    file: *const root::std::string,
                    line: ::std::os::raw::c_int,
                );
            }
            impl ClientTimeoutException {
                #[inline]
                pub unsafe fn new(
                    what: *const root::std::string,
                    function: *const root::std::string,
                    file: *const root::std::string,
                    line: ::std::os::raw::c_int,
                ) -> Self {
                    let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
                    ClientTimeoutException_ClientTimeoutException(
                        __bindgen_tmp.as_mut_ptr(),
                        what,
                        function,
                        file,
                        line,
                    );
                    __bindgen_tmp.assume_init()
                }
            }
            #[repr(C)]
            pub struct AeronException {
                pub _base: root::aeron::util::SourcedException,
            }
            #[test]
            fn bindgen_test_layout_AeronException() {
                assert_eq!(
                    ::std::mem::size_of::<AeronException>(),
                    80usize,
                    concat!("Size of: ", stringify!(AeronException))
                );
                assert_eq!(
                    ::std::mem::align_of::<AeronException>(),
                    8usize,
                    concat!("Alignment of ", stringify!(AeronException))
                );
            }
            extern "C" {
                #[link_name = "\u{1}_ZN5aeron4util14AeronExceptionC1ERKNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEES9_S9_i"]
                pub fn AeronException_AeronException(
                    this: *mut root::aeron::util::AeronException,
                    what: *const root::std::string,
                    function: *const root::std::string,
                    file: *const root::std::string,
                    line: ::std::os::raw::c_int,
                );
            }
            impl AeronException {
                #[inline]
                pub unsafe fn new(
                    what: *const root::std::string,
                    function: *const root::std::string,
                    file: *const root::std::string,
                    line: ::std::os::raw::c_int,
                ) -> Self {
                    let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
                    AeronException_AeronException(
                        __bindgen_tmp.as_mut_ptr(),
                        what,
                        function,
                        file,
                        line,
                    );
                    __bindgen_tmp.assume_init()
                }
            }
            #[repr(C)]
            pub struct UnknownSubscriptionException {
                pub _base: root::aeron::util::SourcedException,
            }
            #[test]
            fn bindgen_test_layout_UnknownSubscriptionException() {
                assert_eq!(
                    ::std::mem::size_of::<UnknownSubscriptionException>(),
                    80usize,
                    concat!("Size of: ", stringify!(UnknownSubscriptionException))
                );
                assert_eq!(
                    ::std::mem::align_of::<UnknownSubscriptionException>(),
                    8usize,
                    concat!("Alignment of ", stringify!(UnknownSubscriptionException))
                );
            }
            extern "C" {
                #[link_name = "\u{1}_ZN5aeron4util28UnknownSubscriptionExceptionC1ERKNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEES9_S9_i"]
                pub fn UnknownSubscriptionException_UnknownSubscriptionException(
                    this: *mut root::aeron::util::UnknownSubscriptionException,
                    what: *const root::std::string,
                    function: *const root::std::string,
                    file: *const root::std::string,
                    line: ::std::os::raw::c_int,
                );
            }
            impl UnknownSubscriptionException {
                #[inline]
                pub unsafe fn new(
                    what: *const root::std::string,
                    function: *const root::std::string,
                    file: *const root::std::string,
                    line: ::std::os::raw::c_int,
                ) -> Self {
                    let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
                    UnknownSubscriptionException_UnknownSubscriptionException(
                        __bindgen_tmp.as_mut_ptr(),
                        what,
                        function,
                        file,
                        line,
                    );
                    __bindgen_tmp.assume_init()
                }
            }
            #[repr(C)]
            pub struct ReentrantException {
                pub _base: root::aeron::util::SourcedException,
            }
            #[test]
            fn bindgen_test_layout_ReentrantException() {
                assert_eq!(
                    ::std::mem::size_of::<ReentrantException>(),
                    80usize,
                    concat!("Size of: ", stringify!(ReentrantException))
                );
                assert_eq!(
                    ::std::mem::align_of::<ReentrantException>(),
                    8usize,
                    concat!("Alignment of ", stringify!(ReentrantException))
                );
            }
            extern "C" {
                #[link_name = "\u{1}_ZN5aeron4util18ReentrantExceptionC1ERKNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEES9_S9_i"]
                pub fn ReentrantException_ReentrantException(
                    this: *mut root::aeron::util::ReentrantException,
                    what: *const root::std::string,
                    function: *const root::std::string,
                    file: *const root::std::string,
                    line: ::std::os::raw::c_int,
                );
            }
            impl ReentrantException {
                #[inline]
                pub unsafe fn new(
                    what: *const root::std::string,
                    function: *const root::std::string,
                    file: *const root::std::string,
                    line: ::std::os::raw::c_int,
                ) -> Self {
                    let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
                    ReentrantException_ReentrantException(
                        __bindgen_tmp.as_mut_ptr(),
                        what,
                        function,
                        file,
                        line,
                    );
                    __bindgen_tmp.assume_init()
                }
            }
            #[repr(C)]
            pub struct RegistrationException {
                pub _base: root::aeron::util::SourcedException,
                pub m_errorCode: ::std::os::raw::c_int,
            }
            #[test]
            fn bindgen_test_layout_RegistrationException() {
                const UNINIT: ::std::mem::MaybeUninit<RegistrationException> =
                    ::std::mem::MaybeUninit::uninit();
                let ptr = UNINIT.as_ptr();
                assert_eq!(
                    ::std::mem::size_of::<RegistrationException>(),
                    88usize,
                    concat!("Size of: ", stringify!(RegistrationException))
                );
                assert_eq!(
                    ::std::mem::align_of::<RegistrationException>(),
                    8usize,
                    concat!("Alignment of ", stringify!(RegistrationException))
                );
                assert_eq!(
                    unsafe { ::std::ptr::addr_of!((*ptr).m_errorCode) as usize - ptr as usize },
                    80usize,
                    concat!(
                        "Offset of field: ",
                        stringify!(RegistrationException),
                        "::",
                        stringify!(m_errorCode)
                    )
                );
            }
            extern "C" {
                #[link_name = "\u{1}_ZNK5aeron4util21RegistrationException9errorCodeEv"]
                pub fn RegistrationException_errorCode(
                    this: *const root::aeron::util::RegistrationException,
                ) -> ::std::os::raw::c_int;
            }
            extern "C" {
                #[link_name = "\u{1}_ZN5aeron4util21RegistrationExceptionC1EiNS0_17ExceptionCategoryERKNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEESA_SA_i"]
                pub fn RegistrationException_RegistrationException(
                    this: *mut root::aeron::util::RegistrationException,
                    errorCode: ::std::os::raw::c_int,
                    exceptionCategory: root::aeron::util::ExceptionCategory,
                    what: *const root::std::string,
                    function: *const root::std::string,
                    file: *const root::std::string,
                    line: ::std::os::raw::c_int,
                );
            }
            impl RegistrationException {
                #[inline]
                pub unsafe fn errorCode(&self) -> ::std::os::raw::c_int {
                    RegistrationException_errorCode(self)
                }
                #[inline]
                pub unsafe fn new(
                    errorCode: ::std::os::raw::c_int,
                    exceptionCategory: root::aeron::util::ExceptionCategory,
                    what: *const root::std::string,
                    function: *const root::std::string,
                    file: *const root::std::string,
                    line: ::std::os::raw::c_int,
                ) -> Self {
                    let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
                    RegistrationException_RegistrationException(
                        __bindgen_tmp.as_mut_ptr(),
                        errorCode,
                        exceptionCategory,
                        what,
                        function,
                        file,
                        line,
                    );
                    __bindgen_tmp.assume_init()
                }
            }
            #[repr(C)]
            pub struct TimeoutException {
                pub _base: root::aeron::util::AeronException,
            }
            #[test]
            fn bindgen_test_layout_TimeoutException() {
                assert_eq!(
                    ::std::mem::size_of::<TimeoutException>(),
                    80usize,
                    concat!("Size of: ", stringify!(TimeoutException))
                );
                assert_eq!(
                    ::std::mem::align_of::<TimeoutException>(),
                    8usize,
                    concat!("Alignment of ", stringify!(TimeoutException))
                );
            }
            extern "C" {
                #[link_name = "\u{1}_ZN5aeron4util16TimeoutExceptionC1ERKNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEES9_S9_i"]
                pub fn TimeoutException_TimeoutException(
                    this: *mut root::aeron::util::TimeoutException,
                    what: *const root::std::string,
                    function: *const root::std::string,
                    file: *const root::std::string,
                    line: ::std::os::raw::c_int,
                );
            }
            impl TimeoutException {
                #[inline]
                pub unsafe fn new(
                    what: *const root::std::string,
                    function: *const root::std::string,
                    file: *const root::std::string,
                    line: ::std::os::raw::c_int,
                ) -> Self {
                    let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
                    TimeoutException_TimeoutException(
                        __bindgen_tmp.as_mut_ptr(),
                        what,
                        function,
                        file,
                        line,
                    );
                    __bindgen_tmp.assume_init()
                }
            }
            #[repr(C)]
            pub struct ChannelEndpointException {
                pub _base: root::aeron::util::AeronException,
                pub m_statusIndicatorCounterId: ::std::os::raw::c_int,
            }
            #[test]
            fn bindgen_test_layout_ChannelEndpointException() {
                const UNINIT: ::std::mem::MaybeUninit<ChannelEndpointException> =
                    ::std::mem::MaybeUninit::uninit();
                let ptr = UNINIT.as_ptr();
                assert_eq!(
                    ::std::mem::size_of::<ChannelEndpointException>(),
                    88usize,
                    concat!("Size of: ", stringify!(ChannelEndpointException))
                );
                assert_eq!(
                    ::std::mem::align_of::<ChannelEndpointException>(),
                    8usize,
                    concat!("Alignment of ", stringify!(ChannelEndpointException))
                );
                assert_eq!(
                    unsafe {
                        ::std::ptr::addr_of!((*ptr).m_statusIndicatorCounterId) as usize
                            - ptr as usize
                    },
                    80usize,
                    concat!(
                        "Offset of field: ",
                        stringify!(ChannelEndpointException),
                        "::",
                        stringify!(m_statusIndicatorCounterId)
                    )
                );
            }
            extern "C" {
                #[link_name = "\u{1}_ZNK5aeron4util24ChannelEndpointException17statusIndicatorIdEv"]
                pub fn ChannelEndpointException_statusIndicatorId(
                    this: *const root::aeron::util::ChannelEndpointException,
                ) -> ::std::os::raw::c_int;
            }
            extern "C" {
                #[link_name = "\u{1}_ZN5aeron4util24ChannelEndpointExceptionC1EiRKNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEES9_S9_i"]
                pub fn ChannelEndpointException_ChannelEndpointException(
                    this: *mut root::aeron::util::ChannelEndpointException,
                    statusIndicatorCounterId: ::std::os::raw::c_int,
                    what: *const root::std::string,
                    function: *const root::std::string,
                    file: *const root::std::string,
                    line: ::std::os::raw::c_int,
                );
            }
            impl ChannelEndpointException {
                #[inline]
                pub unsafe fn statusIndicatorId(&self) -> ::std::os::raw::c_int {
                    ChannelEndpointException_statusIndicatorId(self)
                }
                #[inline]
                pub unsafe fn new(
                    statusIndicatorCounterId: ::std::os::raw::c_int,
                    what: *const root::std::string,
                    function: *const root::std::string,
                    file: *const root::std::string,
                    line: ::std::os::raw::c_int,
                ) -> Self {
                    let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
                    ChannelEndpointException_ChannelEndpointException(
                        __bindgen_tmp.as_mut_ptr(),
                        statusIndicatorCounterId,
                        what,
                        function,
                        file,
                        line,
                    );
                    __bindgen_tmp.assume_init()
                }
            }
            extern "C" {
                #[link_name = "\u{1}_ZN5aeron4util10trimWSLeftENSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEEPKc"]
                pub fn trimWSLeft(
                    str_: root::std::string,
                    wschars: *const ::std::os::raw::c_char,
                ) -> root::std::string;
            }
            extern "C" {
                #[link_name = "\u{1}_ZN5aeron4util11trimWSRightENSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEEPKc"]
                pub fn trimWSRight(
                    str_: root::std::string,
                    wschars: *const ::std::os::raw::c_char,
                ) -> root::std::string;
            }
            extern "C" {
                #[link_name = "\u{1}_ZN5aeron4util10trimWSBothENSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEEPKc"]
                pub fn trimWSBoth(
                    str_: root::std::string,
                    wschars: *const ::std::os::raw::c_char,
                ) -> root::std::string;
            }
            extern "C" {
                #[link_name = "\u{1}_ZN5aeron4util10startsWithERKNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEEmS8_"]
                pub fn startsWith(
                    input: *const root::std::string,
                    position: usize,
                    prefix: *const root::std::string,
                ) -> bool;
            }
            extern "C" {
                #[link_name = "\u{1}_ZN5aeron4util8endsWithERKNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEES8_"]
                pub fn endsWith(
                    str_: *const root::std::string,
                    suffix: *const root::std::string,
                ) -> bool;
            }
            extern "C" {
                #[link_name = "\u{1}_ZN5aeron4util9strPrintfB5cxx11EPKcz"]
                pub fn strPrintf(format: *const ::std::os::raw::c_char, ...) -> root::std::string;
            }
            extern "C" {
                #[link_name = "\u{1}_ZN5aeron4util19continuationBarrierERKNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEE"]
                pub fn continuationBarrier(label: *const root::std::string) -> bool;
            }
            #[repr(C)]
            pub struct MemoryMappedFile {
                pub m_memory: *mut ::std::os::raw::c_uchar,
                pub m_memorySize: usize,
            }
            pub type MemoryMappedFile_ptr_t = [u64; 2usize];
            #[repr(C)]
            #[derive(Copy, Clone)]
            pub struct MemoryMappedFile_FileHandle {
                pub handle: ::std::os::raw::c_int,
            }
            #[test]
            fn bindgen_test_layout_MemoryMappedFile_FileHandle() {
                const UNINIT: ::std::mem::MaybeUninit<MemoryMappedFile_FileHandle> =
                    ::std::mem::MaybeUninit::uninit();
                let ptr = UNINIT.as_ptr();
                assert_eq!(
                    ::std::mem::size_of::<MemoryMappedFile_FileHandle>(),
                    4usize,
                    concat!("Size of: ", stringify!(MemoryMappedFile_FileHandle))
                );
                assert_eq!(
                    ::std::mem::align_of::<MemoryMappedFile_FileHandle>(),
                    4usize,
                    concat!("Alignment of ", stringify!(MemoryMappedFile_FileHandle))
                );
                assert_eq!(
                    unsafe { ::std::ptr::addr_of!((*ptr).handle) as usize - ptr as usize },
                    0usize,
                    concat!(
                        "Offset of field: ",
                        stringify!(MemoryMappedFile_FileHandle),
                        "::",
                        stringify!(handle)
                    )
                );
            }
            extern "C" {
                #[link_name = "\u{1}_ZN5aeron4util16MemoryMappedFile11m_page_sizeE"]
                pub static mut MemoryMappedFile_m_page_size: usize;
            }
            #[test]
            fn bindgen_test_layout_MemoryMappedFile() {
                const UNINIT: ::std::mem::MaybeUninit<MemoryMappedFile> =
                    ::std::mem::MaybeUninit::uninit();
                let ptr = UNINIT.as_ptr();
                assert_eq!(
                    ::std::mem::size_of::<MemoryMappedFile>(),
                    16usize,
                    concat!("Size of: ", stringify!(MemoryMappedFile))
                );
                assert_eq!(
                    ::std::mem::align_of::<MemoryMappedFile>(),
                    8usize,
                    concat!("Alignment of ", stringify!(MemoryMappedFile))
                );
                assert_eq!(
                    unsafe { ::std::ptr::addr_of!((*ptr).m_memory) as usize - ptr as usize },
                    0usize,
                    concat!(
                        "Offset of field: ",
                        stringify!(MemoryMappedFile),
                        "::",
                        stringify!(m_memory)
                    )
                );
                assert_eq!(
                    unsafe { ::std::ptr::addr_of!((*ptr).m_memorySize) as usize - ptr as usize },
                    8usize,
                    concat!(
                        "Offset of field: ",
                        stringify!(MemoryMappedFile),
                        "::",
                        stringify!(m_memorySize)
                    )
                );
            }
            extern "C" {
                #[link_name = "\u{1}_ZN5aeron4util16MemoryMappedFile9createNewEPKclmb"]
                pub fn MemoryMappedFile_createNew(
                    filename: *const ::std::os::raw::c_char,
                    offset: root::off_t,
                    length: usize,
                    preTouch: bool,
                ) -> root::aeron::util::MemoryMappedFile_ptr_t;
            }
            extern "C" {
                #[link_name = "\u{1}_ZN5aeron4util16MemoryMappedFile11mapExistingEPKclmbb"]
                pub fn MemoryMappedFile_mapExisting(
                    filename: *const ::std::os::raw::c_char,
                    offset: root::off_t,
                    length: usize,
                    readOnly: bool,
                    preTouch: bool,
                ) -> root::aeron::util::MemoryMappedFile_ptr_t;
            }
            extern "C" {
                #[link_name = "\u{1}_ZN5aeron4util16MemoryMappedFile11mapExistingEPKcbb"]
                pub fn MemoryMappedFile_mapExisting1(
                    filename: *const ::std::os::raw::c_char,
                    readOnly: bool,
                    preTouch: bool,
                ) -> root::aeron::util::MemoryMappedFile_ptr_t;
            }
            extern "C" {
                #[link_name = "\u{1}_ZN5aeron4util16MemoryMappedFile19mapExistingReadOnlyEPKc"]
                pub fn MemoryMappedFile_mapExistingReadOnly(
                    filename: *const ::std::os::raw::c_char,
                ) -> root::aeron::util::MemoryMappedFile_ptr_t;
            }
            extern "C" {
                #[link_name = "\u{1}_ZNK5aeron4util16MemoryMappedFile12getMemoryPtrEv"]
                pub fn MemoryMappedFile_getMemoryPtr(
                    this: *const root::aeron::util::MemoryMappedFile,
                ) -> *mut ::std::os::raw::c_uchar;
            }
            extern "C" {
                #[link_name = "\u{1}_ZNK5aeron4util16MemoryMappedFile13getMemorySizeEv"]
                pub fn MemoryMappedFile_getMemorySize(
                    this: *const root::aeron::util::MemoryMappedFile,
                ) -> usize;
            }
            extern "C" {
                #[link_name = "\u{1}_ZN5aeron4util16MemoryMappedFile11getPageSizeEv"]
                pub fn MemoryMappedFile_getPageSize() -> usize;
            }
            extern "C" {
                #[link_name = "\u{1}_ZN5aeron4util16MemoryMappedFile11getFileSizeEPKc"]
                pub fn MemoryMappedFile_getFileSize(
                    filename: *const ::std::os::raw::c_char,
                ) -> ::std::os::raw::c_long;
            }
            extern "C" {
                #[link_name = "\u{1}_ZN5aeron4util16MemoryMappedFileD1Ev"]
                pub fn MemoryMappedFile_MemoryMappedFile_destructor(
                    this: *mut root::aeron::util::MemoryMappedFile,
                );
            }
            impl MemoryMappedFile {
                #[inline]
                pub unsafe fn createNew(
                    filename: *const ::std::os::raw::c_char,
                    offset: root::off_t,
                    length: usize,
                    preTouch: bool,
                ) -> root::aeron::util::MemoryMappedFile_ptr_t {
                    MemoryMappedFile_createNew(filename, offset, length, preTouch)
                }
                #[inline]
                pub unsafe fn mapExisting(
                    filename: *const ::std::os::raw::c_char,
                    offset: root::off_t,
                    length: usize,
                    readOnly: bool,
                    preTouch: bool,
                ) -> root::aeron::util::MemoryMappedFile_ptr_t {
                    MemoryMappedFile_mapExisting(filename, offset, length, readOnly, preTouch)
                }
                #[inline]
                pub unsafe fn mapExisting1(
                    filename: *const ::std::os::raw::c_char,
                    readOnly: bool,
                    preTouch: bool,
                ) -> root::aeron::util::MemoryMappedFile_ptr_t {
                    MemoryMappedFile_mapExisting1(filename, readOnly, preTouch)
                }
                #[inline]
                pub unsafe fn mapExistingReadOnly(
                    filename: *const ::std::os::raw::c_char,
                ) -> root::aeron::util::MemoryMappedFile_ptr_t {
                    MemoryMappedFile_mapExistingReadOnly(filename)
                }
                #[inline]
                pub unsafe fn getMemoryPtr(&self) -> *mut ::std::os::raw::c_uchar {
                    MemoryMappedFile_getMemoryPtr(self)
                }
                #[inline]
                pub unsafe fn getMemorySize(&self) -> usize {
                    MemoryMappedFile_getMemorySize(self)
                }
                #[inline]
                pub unsafe fn getPageSize() -> usize {
                    MemoryMappedFile_getPageSize()
                }
                #[inline]
                pub unsafe fn getFileSize(
                    filename: *const ::std::os::raw::c_char,
                ) -> ::std::os::raw::c_long {
                    MemoryMappedFile_getFileSize(filename)
                }
                #[inline]
                pub unsafe fn destruct(&mut self) {
                    MemoryMappedFile_MemoryMappedFile_destructor(self)
                }
            }
        }
        pub mod concurrent {
            #[allow(unused_imports)]
            use self::super::super::super::root;
            pub mod atomic {
                #[allow(unused_imports)]
                use self::super::super::super::super::root;
                extern "C" {
                    #[link_name = "\u{1}_ZN5aeron10concurrent6atomic12thread_fenceEv"]
                    pub fn thread_fence();
                }
                extern "C" {
                    #[link_name = "\u{1}_ZN5aeron10concurrent6atomic5fenceEv"]
                    pub fn fence();
                }
                extern "C" {
                    #[link_name = "\u{1}_ZN5aeron10concurrent6atomic7acquireEv"]
                    pub fn acquire();
                }
                extern "C" {
                    #[link_name = "\u{1}_ZN5aeron10concurrent6atomic7releaseEv"]
                    pub fn release();
                }
                extern "C" {
                    #[link_name = "\u{1}_ZN5aeron10concurrent6atomic9cpu_pauseEv"]
                    pub fn cpu_pause();
                }
                extern "C" {
                    #[link_name = "\u{1}_ZN5aeron10concurrent6atomic16getInt32VolatileEPVi"]
                    pub fn getInt32Volatile(
                        source: *mut ::std::os::raw::c_int,
                    ) -> ::std::os::raw::c_int;
                }
                extern "C" {
                    #[link_name = "\u{1}_ZN5aeron10concurrent6atomic16putInt32VolatileEPVii"]
                    pub fn putInt32Volatile(
                        address: *mut ::std::os::raw::c_int,
                        value: ::std::os::raw::c_int,
                    );
                }
                extern "C" {
                    #[link_name = "\u{1}_ZN5aeron10concurrent6atomic15putInt32OrderedEPVii"]
                    pub fn putInt32Ordered(
                        address: *mut ::std::os::raw::c_int,
                        value: ::std::os::raw::c_int,
                    );
                }
                extern "C" {
                    #[link_name = "\u{1}_ZN5aeron10concurrent6atomic14putInt32AtomicEPVii"]
                    pub fn putInt32Atomic(
                        address: *mut ::std::os::raw::c_int,
                        value: ::std::os::raw::c_int,
                    );
                }
                extern "C" {
                    #[link_name = "\u{1}_ZN5aeron10concurrent6atomic16getInt64VolatileEPVl"]
                    pub fn getInt64Volatile(
                        source: *mut ::std::os::raw::c_long,
                    ) -> ::std::os::raw::c_long;
                }
                extern "C" {
                    #[link_name = "\u{1}_ZN5aeron10concurrent6atomic16putInt64VolatileEPVll"]
                    pub fn putInt64Volatile(
                        address: *mut ::std::os::raw::c_long,
                        value: ::std::os::raw::c_long,
                    );
                }
                extern "C" {
                    #[link_name = "\u{1}_ZN5aeron10concurrent6atomic15putInt64OrderedEPVll"]
                    pub fn putInt64Ordered(
                        address: *mut ::std::os::raw::c_long,
                        value: ::std::os::raw::c_long,
                    );
                }
                extern "C" {
                    #[link_name = "\u{1}_ZN5aeron10concurrent6atomic14putInt64AtomicEPVll"]
                    pub fn putInt64Atomic(
                        address: *mut ::std::os::raw::c_long,
                        value: ::std::os::raw::c_long,
                    );
                }
                extern "C" {
                    #[link_name = "\u{1}_ZN5aeron10concurrent6atomic14getAndAddInt64EPVll"]
                    pub fn getAndAddInt64(
                        address: *mut ::std::os::raw::c_long,
                        value: ::std::os::raw::c_long,
                    ) -> ::std::os::raw::c_long;
                }
                extern "C" {
                    #[link_name = "\u{1}_ZN5aeron10concurrent6atomic14getAndAddInt32EPVii"]
                    pub fn getAndAddInt32(
                        address: *mut ::std::os::raw::c_int,
                        value: ::std::os::raw::c_int,
                    ) -> ::std::os::raw::c_int;
                }
                extern "C" {
                    #[link_name = "\u{1}_ZN5aeron10concurrent6atomic4xchgEPVii"]
                    pub fn xchg(
                        address: *mut ::std::os::raw::c_int,
                        value: ::std::os::raw::c_int,
                    ) -> ::std::os::raw::c_int;
                }
                extern "C" {
                    #[link_name = "\u{1}_ZN5aeron10concurrent6atomic4xchgEPVll"]
                    pub fn xchg1(
                        address: *mut ::std::os::raw::c_long,
                        value: ::std::os::raw::c_long,
                    ) -> ::std::os::raw::c_long;
                }
                extern "C" {
                    #[link_name = "\u{1}_ZN5aeron10concurrent6atomic7cmpxchgEPViii"]
                    pub fn cmpxchg(
                        address: *mut ::std::os::raw::c_int,
                        expected: ::std::os::raw::c_int,
                        desired: ::std::os::raw::c_int,
                    ) -> ::std::os::raw::c_int;
                }
                extern "C" {
                    #[link_name = "\u{1}_ZN5aeron10concurrent6atomic7cmpxchgEPVlll"]
                    pub fn cmpxchg1(
                        address: *mut ::std::os::raw::c_long,
                        expected: ::std::os::raw::c_long,
                        desired: ::std::os::raw::c_long,
                    ) -> ::std::os::raw::c_long;
                }
            }
            #[repr(C)]
            #[derive(Copy, Clone)]
            pub struct AtomicBuffer {
                pub m_buffer: *mut ::std::os::raw::c_uchar,
                pub m_length: root::aeron::concurrent::AtomicBuffer_length_t,
            }
            pub type AtomicBuffer_length_t = ::std::os::raw::c_uint;
            #[test]
            fn bindgen_test_layout_AtomicBuffer() {
                const UNINIT: ::std::mem::MaybeUninit<AtomicBuffer> =
                    ::std::mem::MaybeUninit::uninit();
                let ptr = UNINIT.as_ptr();
                assert_eq!(
                    ::std::mem::size_of::<AtomicBuffer>(),
                    16usize,
                    concat!("Size of: ", stringify!(AtomicBuffer))
                );
                assert_eq!(
                    ::std::mem::align_of::<AtomicBuffer>(),
                    8usize,
                    concat!("Alignment of ", stringify!(AtomicBuffer))
                );
                assert_eq!(
                    unsafe { ::std::ptr::addr_of!((*ptr).m_buffer) as usize - ptr as usize },
                    0usize,
                    concat!(
                        "Offset of field: ",
                        stringify!(AtomicBuffer),
                        "::",
                        stringify!(m_buffer)
                    )
                );
                assert_eq!(
                    unsafe { ::std::ptr::addr_of!((*ptr).m_length) as usize - ptr as usize },
                    8usize,
                    concat!(
                        "Offset of field: ",
                        stringify!(AtomicBuffer),
                        "::",
                        stringify!(m_length)
                    )
                );
            }
            extern "C" {
                #[link_name = "\u{1}_ZN5aeron10concurrent12AtomicBuffer4wrapEPhm"]
                pub fn AtomicBuffer_wrap(
                    this: *mut root::aeron::concurrent::AtomicBuffer,
                    buffer: *mut ::std::os::raw::c_uchar,
                    length: usize,
                );
            }
            extern "C" {
                #[link_name = "\u{1}_ZN5aeron10concurrent12AtomicBuffer4wrapERKS1_"]
                pub fn AtomicBuffer_wrap1(
                    this: *mut root::aeron::concurrent::AtomicBuffer,
                    buffer: *const root::aeron::concurrent::AtomicBuffer,
                );
            }
            extern "C" {
                #[link_name = "\u{1}_ZNK5aeron10concurrent12AtomicBuffer8capacityEv"]
                pub fn AtomicBuffer_capacity(
                    this: *const root::aeron::concurrent::AtomicBuffer,
                ) -> root::aeron::util::index_t;
            }
            extern "C" {
                #[link_name = "\u{1}_ZN5aeron10concurrent12AtomicBuffer8capacityEm"]
                pub fn AtomicBuffer_capacity1(
                    this: *mut root::aeron::concurrent::AtomicBuffer,
                    length: usize,
                );
            }
            extern "C" {
                #[link_name = "\u{1}_ZNK5aeron10concurrent12AtomicBuffer6bufferEv"]
                pub fn AtomicBuffer_buffer(
                    this: *const root::aeron::concurrent::AtomicBuffer,
                ) -> *mut ::std::os::raw::c_uchar;
            }
            extern "C" {
                #[link_name = "\u{1}_ZNK5aeron10concurrent12AtomicBuffer7sbeDataEv"]
                pub fn AtomicBuffer_sbeData(
                    this: *const root::aeron::concurrent::AtomicBuffer,
                ) -> *mut ::std::os::raw::c_char;
            }
            extern "C" {
                #[link_name = "\u{1}_ZN5aeron10concurrent12AtomicBuffer8putInt64Eil"]
                pub fn AtomicBuffer_putInt64(
                    this: *mut root::aeron::concurrent::AtomicBuffer,
                    offset: root::aeron::util::index_t,
                    v: ::std::os::raw::c_long,
                );
            }
            extern "C" {
                #[link_name = "\u{1}_ZNK5aeron10concurrent12AtomicBuffer8getInt64Ei"]
                pub fn AtomicBuffer_getInt64(
                    this: *const root::aeron::concurrent::AtomicBuffer,
                    offset: root::aeron::util::index_t,
                ) -> ::std::os::raw::c_long;
            }
            extern "C" {
                #[link_name = "\u{1}_ZN5aeron10concurrent12AtomicBuffer8putInt32Eii"]
                pub fn AtomicBuffer_putInt32(
                    this: *mut root::aeron::concurrent::AtomicBuffer,
                    offset: root::aeron::util::index_t,
                    v: ::std::os::raw::c_int,
                );
            }
            extern "C" {
                #[link_name = "\u{1}_ZNK5aeron10concurrent12AtomicBuffer8getInt32Ei"]
                pub fn AtomicBuffer_getInt32(
                    this: *const root::aeron::concurrent::AtomicBuffer,
                    offset: root::aeron::util::index_t,
                ) -> ::std::os::raw::c_int;
            }
            extern "C" {
                #[link_name = "\u{1}_ZNK5aeron10concurrent12AtomicBuffer8getInt16Ei"]
                pub fn AtomicBuffer_getInt16(
                    this: *const root::aeron::concurrent::AtomicBuffer,
                    offset: root::aeron::util::index_t,
                ) -> ::std::os::raw::c_short;
            }
            extern "C" {
                #[link_name = "\u{1}_ZN5aeron10concurrent12AtomicBuffer8putInt16Eis"]
                pub fn AtomicBuffer_putInt16(
                    this: *mut root::aeron::concurrent::AtomicBuffer,
                    offset: root::aeron::util::index_t,
                    v: ::std::os::raw::c_short,
                );
            }
            extern "C" {
                #[link_name = "\u{1}_ZNK5aeron10concurrent12AtomicBuffer9getUInt16Ei"]
                pub fn AtomicBuffer_getUInt16(
                    this: *const root::aeron::concurrent::AtomicBuffer,
                    offset: root::aeron::util::index_t,
                ) -> ::std::os::raw::c_ushort;
            }
            extern "C" {
                #[link_name = "\u{1}_ZN5aeron10concurrent12AtomicBuffer9putUInt16Eit"]
                pub fn AtomicBuffer_putUInt16(
                    this: *mut root::aeron::concurrent::AtomicBuffer,
                    offset: root::aeron::util::index_t,
                    v: ::std::os::raw::c_ushort,
                );
            }
            extern "C" {
                #[link_name = "\u{1}_ZNK5aeron10concurrent12AtomicBuffer8getUInt8Ei"]
                pub fn AtomicBuffer_getUInt8(
                    this: *const root::aeron::concurrent::AtomicBuffer,
                    offset: root::aeron::util::index_t,
                ) -> ::std::os::raw::c_uchar;
            }
            extern "C" {
                #[link_name = "\u{1}_ZN5aeron10concurrent12AtomicBuffer8putUInt8Eih"]
                pub fn AtomicBuffer_putUInt8(
                    this: *mut root::aeron::concurrent::AtomicBuffer,
                    offset: root::aeron::util::index_t,
                    v: ::std::os::raw::c_uchar,
                );
            }
            extern "C" {
                #[link_name = "\u{1}_ZN5aeron10concurrent12AtomicBuffer15putInt64OrderedEil"]
                pub fn AtomicBuffer_putInt64Ordered(
                    this: *mut root::aeron::concurrent::AtomicBuffer,
                    offset: root::aeron::util::index_t,
                    v: ::std::os::raw::c_long,
                );
            }
            extern "C" {
                #[link_name = "\u{1}_ZNK5aeron10concurrent12AtomicBuffer16getInt64VolatileEi"]
                pub fn AtomicBuffer_getInt64Volatile(
                    this: *const root::aeron::concurrent::AtomicBuffer,
                    offset: root::aeron::util::index_t,
                ) -> ::std::os::raw::c_long;
            }
            extern "C" {
                #[link_name = "\u{1}_ZN5aeron10concurrent12AtomicBuffer15putInt32OrderedEii"]
                pub fn AtomicBuffer_putInt32Ordered(
                    this: *mut root::aeron::concurrent::AtomicBuffer,
                    offset: root::aeron::util::index_t,
                    v: ::std::os::raw::c_int,
                );
            }
            extern "C" {
                #[link_name = "\u{1}_ZNK5aeron10concurrent12AtomicBuffer16getInt32VolatileEi"]
                pub fn AtomicBuffer_getInt32Volatile(
                    this: *const root::aeron::concurrent::AtomicBuffer,
                    offset: root::aeron::util::index_t,
                ) -> ::std::os::raw::c_int;
            }
            extern "C" {
                #[link_name = "\u{1}_ZN5aeron10concurrent12AtomicBuffer14putInt64AtomicEil"]
                pub fn AtomicBuffer_putInt64Atomic(
                    this: *mut root::aeron::concurrent::AtomicBuffer,
                    offset: root::aeron::util::index_t,
                    v: ::std::os::raw::c_long,
                );
            }
            extern "C" {
                #[link_name = "\u{1}_ZN5aeron10concurrent12AtomicBuffer14putInt32AtomicEii"]
                pub fn AtomicBuffer_putInt32Atomic(
                    this: *mut root::aeron::concurrent::AtomicBuffer,
                    offset: root::aeron::util::index_t,
                    v: ::std::os::raw::c_int,
                );
            }
            extern "C" {
                #[link_name = "\u{1}_ZN5aeron10concurrent12AtomicBuffer15addInt64OrderedEil"]
                pub fn AtomicBuffer_addInt64Ordered(
                    this: *mut root::aeron::concurrent::AtomicBuffer,
                    offset: root::aeron::util::index_t,
                    delta: ::std::os::raw::c_long,
                );
            }
            extern "C" {
                #[link_name = "\u{1}_ZN5aeron10concurrent12AtomicBuffer18compareAndSetInt64Eill"]
                pub fn AtomicBuffer_compareAndSetInt64(
                    this: *mut root::aeron::concurrent::AtomicBuffer,
                    offset: root::aeron::util::index_t,
                    expectedValue: ::std::os::raw::c_long,
                    updateValue: ::std::os::raw::c_long,
                ) -> bool;
            }
            extern "C" {
                #[link_name = "\u{1}_ZN5aeron10concurrent12AtomicBuffer14getAndSetInt64Eil"]
                pub fn AtomicBuffer_getAndSetInt64(
                    this: *mut root::aeron::concurrent::AtomicBuffer,
                    offset: root::aeron::util::index_t,
                    value: ::std::os::raw::c_long,
                ) -> ::std::os::raw::c_long;
            }
            extern "C" {
                #[link_name = "\u{1}_ZN5aeron10concurrent12AtomicBuffer14getAndSetInt32Eii"]
                pub fn AtomicBuffer_getAndSetInt32(
                    this: *mut root::aeron::concurrent::AtomicBuffer,
                    offset: root::aeron::util::index_t,
                    value: ::std::os::raw::c_int,
                ) -> ::std::os::raw::c_int;
            }
            extern "C" {
                #[link_name = "\u{1}_ZN5aeron10concurrent12AtomicBuffer14getAndAddInt64Eil"]
                pub fn AtomicBuffer_getAndAddInt64(
                    this: *mut root::aeron::concurrent::AtomicBuffer,
                    offset: root::aeron::util::index_t,
                    delta: ::std::os::raw::c_long,
                ) -> ::std::os::raw::c_long;
            }
            extern "C" {
                #[link_name = "\u{1}_ZN5aeron10concurrent12AtomicBuffer15addInt32OrderedEii"]
                pub fn AtomicBuffer_addInt32Ordered(
                    this: *mut root::aeron::concurrent::AtomicBuffer,
                    offset: root::aeron::util::index_t,
                    delta: ::std::os::raw::c_int,
                );
            }
            extern "C" {
                #[link_name = "\u{1}_ZN5aeron10concurrent12AtomicBuffer18compareAndSetInt32Eiii"]
                pub fn AtomicBuffer_compareAndSetInt32(
                    this: *mut root::aeron::concurrent::AtomicBuffer,
                    offset: root::aeron::util::index_t,
                    expectedValue: ::std::os::raw::c_int,
                    updateValue: ::std::os::raw::c_int,
                ) -> bool;
            }
            extern "C" {
                #[link_name = "\u{1}_ZN5aeron10concurrent12AtomicBuffer14getAndAddInt32Eii"]
                pub fn AtomicBuffer_getAndAddInt32(
                    this: *mut root::aeron::concurrent::AtomicBuffer,
                    offset: root::aeron::util::index_t,
                    delta: ::std::os::raw::c_int,
                ) -> ::std::os::raw::c_int;
            }
            extern "C" {
                #[link_name = "\u{1}_ZN5aeron10concurrent12AtomicBuffer8putBytesEiRKS1_ii"]
                pub fn AtomicBuffer_putBytes(
                    this: *mut root::aeron::concurrent::AtomicBuffer,
                    index: root::aeron::util::index_t,
                    srcBuffer: *const root::aeron::concurrent::AtomicBuffer,
                    srcIndex: root::aeron::util::index_t,
                    length: root::aeron::util::index_t,
                );
            }
            extern "C" {
                #[link_name = "\u{1}_ZN5aeron10concurrent12AtomicBuffer8putBytesEiPKhi"]
                pub fn AtomicBuffer_putBytes1(
                    this: *mut root::aeron::concurrent::AtomicBuffer,
                    index: root::aeron::util::index_t,
                    srcBuffer: *mut ::std::os::raw::c_uchar,
                    length: root::aeron::util::index_t,
                );
            }
            extern "C" {
                #[link_name = "\u{1}_ZNK5aeron10concurrent12AtomicBuffer8getBytesEiPhi"]
                pub fn AtomicBuffer_getBytes(
                    this: *const root::aeron::concurrent::AtomicBuffer,
                    index: root::aeron::util::index_t,
                    dst: *mut ::std::os::raw::c_uchar,
                    length: root::aeron::util::index_t,
                );
            }
            extern "C" {
                #[link_name = "\u{1}_ZN5aeron10concurrent12AtomicBuffer9setMemoryEimh"]
                pub fn AtomicBuffer_setMemory(
                    this: *mut root::aeron::concurrent::AtomicBuffer,
                    offset: root::aeron::util::index_t,
                    length: usize,
                    value: ::std::os::raw::c_uchar,
                );
            }
            extern "C" {
                #[link_name = "\u{1}_ZNK5aeron10concurrent12AtomicBuffer9getStringB5cxx11Ei"]
                pub fn AtomicBuffer_getString(
                    this: *const root::aeron::concurrent::AtomicBuffer,
                    offset: root::aeron::util::index_t,
                ) -> root::std::string;
            }
            extern "C" {
                #[link_name = "\u{1}_ZNK5aeron10concurrent12AtomicBuffer22getStringWithoutLengthB5cxx11Eim"]
                pub fn AtomicBuffer_getStringWithoutLength(
                    this: *const root::aeron::concurrent::AtomicBuffer,
                    offset: root::aeron::util::index_t,
                    length: usize,
                ) -> root::std::string;
            }
            extern "C" {
                #[link_name = "\u{1}_ZNK5aeron10concurrent12AtomicBuffer15getStringLengthEi"]
                pub fn AtomicBuffer_getStringLength(
                    this: *const root::aeron::concurrent::AtomicBuffer,
                    offset: root::aeron::util::index_t,
                ) -> ::std::os::raw::c_int;
            }
            extern "C" {
                #[link_name = "\u{1}_ZN5aeron10concurrent12AtomicBuffer9putStringEiRKNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEE"]
                pub fn AtomicBuffer_putString(
                    this: *mut root::aeron::concurrent::AtomicBuffer,
                    offset: root::aeron::util::index_t,
                    value: *const root::std::string,
                ) -> ::std::os::raw::c_int;
            }
            extern "C" {
                #[link_name = "\u{1}_ZN5aeron10concurrent12AtomicBuffer22putStringWithoutLengthEiRKNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEE"]
                pub fn AtomicBuffer_putStringWithoutLength(
                    this: *mut root::aeron::concurrent::AtomicBuffer,
                    offset: root::aeron::util::index_t,
                    value: *const root::std::string,
                ) -> ::std::os::raw::c_int;
            }
            extern "C" {
                #[link_name = "\u{1}_ZNK5aeron10concurrent12AtomicBuffer11boundsCheckEim"]
                pub fn AtomicBuffer_boundsCheck(
                    this: *const root::aeron::concurrent::AtomicBuffer,
                    index: root::aeron::util::index_t,
                    length: ::std::os::raw::c_ulong,
                );
            }
            extern "C" {
                #[link_name = "\u{1}_ZN5aeron10concurrent12AtomicBufferC1Ev"]
                pub fn AtomicBuffer_AtomicBuffer(this: *mut root::aeron::concurrent::AtomicBuffer);
            }
            extern "C" {
                #[link_name = "\u{1}_ZN5aeron10concurrent12AtomicBufferC1EPhm"]
                pub fn AtomicBuffer_AtomicBuffer1(
                    this: *mut root::aeron::concurrent::AtomicBuffer,
                    buffer: *mut ::std::os::raw::c_uchar,
                    length: usize,
                );
            }
            extern "C" {
                #[link_name = "\u{1}_ZN5aeron10concurrent12AtomicBufferC1EPhmh"]
                pub fn AtomicBuffer_AtomicBuffer2(
                    this: *mut root::aeron::concurrent::AtomicBuffer,
                    buffer: *mut ::std::os::raw::c_uchar,
                    length: usize,
                    initialValue: ::std::os::raw::c_uchar,
                );
            }
            impl AtomicBuffer {
                #[inline]
                pub unsafe fn wrap(&mut self, buffer: *mut ::std::os::raw::c_uchar, length: usize) {
                    AtomicBuffer_wrap(self, buffer, length)
                }
                #[inline]
                pub unsafe fn wrap1(
                    &mut self,
                    buffer: *const root::aeron::concurrent::AtomicBuffer,
                ) {
                    AtomicBuffer_wrap1(self, buffer)
                }
                #[inline]
                pub unsafe fn capacity(&self) -> root::aeron::util::index_t {
                    AtomicBuffer_capacity(self)
                }
                #[inline]
                pub unsafe fn capacity1(&mut self, length: usize) {
                    AtomicBuffer_capacity1(self, length)
                }
                #[inline]
                pub unsafe fn buffer(&self) -> *mut ::std::os::raw::c_uchar {
                    AtomicBuffer_buffer(self)
                }
                #[inline]
                pub unsafe fn sbeData(&self) -> *mut ::std::os::raw::c_char {
                    AtomicBuffer_sbeData(self)
                }
                #[inline]
                pub unsafe fn putInt64(
                    &mut self,
                    offset: root::aeron::util::index_t,
                    v: ::std::os::raw::c_long,
                ) {
                    AtomicBuffer_putInt64(self, offset, v)
                }
                #[inline]
                pub unsafe fn getInt64(
                    &self,
                    offset: root::aeron::util::index_t,
                ) -> ::std::os::raw::c_long {
                    AtomicBuffer_getInt64(self, offset)
                }
                #[inline]
                pub unsafe fn putInt32(
                    &mut self,
                    offset: root::aeron::util::index_t,
                    v: ::std::os::raw::c_int,
                ) {
                    AtomicBuffer_putInt32(self, offset, v)
                }
                #[inline]
                pub unsafe fn getInt32(
                    &self,
                    offset: root::aeron::util::index_t,
                ) -> ::std::os::raw::c_int {
                    AtomicBuffer_getInt32(self, offset)
                }
                #[inline]
                pub unsafe fn getInt16(
                    &self,
                    offset: root::aeron::util::index_t,
                ) -> ::std::os::raw::c_short {
                    AtomicBuffer_getInt16(self, offset)
                }
                #[inline]
                pub unsafe fn putInt16(
                    &mut self,
                    offset: root::aeron::util::index_t,
                    v: ::std::os::raw::c_short,
                ) {
                    AtomicBuffer_putInt16(self, offset, v)
                }
                #[inline]
                pub unsafe fn getUInt16(
                    &self,
                    offset: root::aeron::util::index_t,
                ) -> ::std::os::raw::c_ushort {
                    AtomicBuffer_getUInt16(self, offset)
                }
                #[inline]
                pub unsafe fn putUInt16(
                    &mut self,
                    offset: root::aeron::util::index_t,
                    v: ::std::os::raw::c_ushort,
                ) {
                    AtomicBuffer_putUInt16(self, offset, v)
                }
                #[inline]
                pub unsafe fn getUInt8(
                    &self,
                    offset: root::aeron::util::index_t,
                ) -> ::std::os::raw::c_uchar {
                    AtomicBuffer_getUInt8(self, offset)
                }
                #[inline]
                pub unsafe fn putUInt8(
                    &mut self,
                    offset: root::aeron::util::index_t,
                    v: ::std::os::raw::c_uchar,
                ) {
                    AtomicBuffer_putUInt8(self, offset, v)
                }
                #[inline]
                pub unsafe fn putInt64Ordered(
                    &mut self,
                    offset: root::aeron::util::index_t,
                    v: ::std::os::raw::c_long,
                ) {
                    AtomicBuffer_putInt64Ordered(self, offset, v)
                }
                #[inline]
                pub unsafe fn getInt64Volatile(
                    &self,
                    offset: root::aeron::util::index_t,
                ) -> ::std::os::raw::c_long {
                    AtomicBuffer_getInt64Volatile(self, offset)
                }
                #[inline]
                pub unsafe fn putInt32Ordered(
                    &mut self,
                    offset: root::aeron::util::index_t,
                    v: ::std::os::raw::c_int,
                ) {
                    AtomicBuffer_putInt32Ordered(self, offset, v)
                }
                #[inline]
                pub unsafe fn getInt32Volatile(
                    &self,
                    offset: root::aeron::util::index_t,
                ) -> ::std::os::raw::c_int {
                    AtomicBuffer_getInt32Volatile(self, offset)
                }
                #[inline]
                pub unsafe fn putInt64Atomic(
                    &mut self,
                    offset: root::aeron::util::index_t,
                    v: ::std::os::raw::c_long,
                ) {
                    AtomicBuffer_putInt64Atomic(self, offset, v)
                }
                #[inline]
                pub unsafe fn putInt32Atomic(
                    &mut self,
                    offset: root::aeron::util::index_t,
                    v: ::std::os::raw::c_int,
                ) {
                    AtomicBuffer_putInt32Atomic(self, offset, v)
                }
                #[inline]
                pub unsafe fn addInt64Ordered(
                    &mut self,
                    offset: root::aeron::util::index_t,
                    delta: ::std::os::raw::c_long,
                ) {
                    AtomicBuffer_addInt64Ordered(self, offset, delta)
                }
                #[inline]
                pub unsafe fn compareAndSetInt64(
                    &mut self,
                    offset: root::aeron::util::index_t,
                    expectedValue: ::std::os::raw::c_long,
                    updateValue: ::std::os::raw::c_long,
                ) -> bool {
                    AtomicBuffer_compareAndSetInt64(self, offset, expectedValue, updateValue)
                }
                #[inline]
                pub unsafe fn getAndSetInt64(
                    &mut self,
                    offset: root::aeron::util::index_t,
                    value: ::std::os::raw::c_long,
                ) -> ::std::os::raw::c_long {
                    AtomicBuffer_getAndSetInt64(self, offset, value)
                }
                #[inline]
                pub unsafe fn getAndSetInt32(
                    &mut self,
                    offset: root::aeron::util::index_t,
                    value: ::std::os::raw::c_int,
                ) -> ::std::os::raw::c_int {
                    AtomicBuffer_getAndSetInt32(self, offset, value)
                }
                #[inline]
                pub unsafe fn getAndAddInt64(
                    &mut self,
                    offset: root::aeron::util::index_t,
                    delta: ::std::os::raw::c_long,
                ) -> ::std::os::raw::c_long {
                    AtomicBuffer_getAndAddInt64(self, offset, delta)
                }
                #[inline]
                pub unsafe fn addInt32Ordered(
                    &mut self,
                    offset: root::aeron::util::index_t,
                    delta: ::std::os::raw::c_int,
                ) {
                    AtomicBuffer_addInt32Ordered(self, offset, delta)
                }
                #[inline]
                pub unsafe fn compareAndSetInt32(
                    &mut self,
                    offset: root::aeron::util::index_t,
                    expectedValue: ::std::os::raw::c_int,
                    updateValue: ::std::os::raw::c_int,
                ) -> bool {
                    AtomicBuffer_compareAndSetInt32(self, offset, expectedValue, updateValue)
                }
                #[inline]
                pub unsafe fn getAndAddInt32(
                    &mut self,
                    offset: root::aeron::util::index_t,
                    delta: ::std::os::raw::c_int,
                ) -> ::std::os::raw::c_int {
                    AtomicBuffer_getAndAddInt32(self, offset, delta)
                }
                #[inline]
                pub unsafe fn putBytes(
                    &mut self,
                    index: root::aeron::util::index_t,
                    srcBuffer: *const root::aeron::concurrent::AtomicBuffer,
                    srcIndex: root::aeron::util::index_t,
                    length: root::aeron::util::index_t,
                ) {
                    AtomicBuffer_putBytes(self, index, srcBuffer, srcIndex, length)
                }
                #[inline]
                pub unsafe fn putBytes1(
                    &mut self,
                    index: root::aeron::util::index_t,
                    srcBuffer: *mut ::std::os::raw::c_uchar,
                    length: root::aeron::util::index_t,
                ) {
                    AtomicBuffer_putBytes1(self, index, srcBuffer, length)
                }
                #[inline]
                pub unsafe fn getBytes(
                    &self,
                    index: root::aeron::util::index_t,
                    dst: *mut ::std::os::raw::c_uchar,
                    length: root::aeron::util::index_t,
                ) {
                    AtomicBuffer_getBytes(self, index, dst, length)
                }
                #[inline]
                pub unsafe fn setMemory(
                    &mut self,
                    offset: root::aeron::util::index_t,
                    length: usize,
                    value: ::std::os::raw::c_uchar,
                ) {
                    AtomicBuffer_setMemory(self, offset, length, value)
                }
                #[inline]
                pub unsafe fn getString(
                    &self,
                    offset: root::aeron::util::index_t,
                ) -> root::std::string {
                    AtomicBuffer_getString(self, offset)
                }
                #[inline]
                pub unsafe fn getStringWithoutLength(
                    &self,
                    offset: root::aeron::util::index_t,
                    length: usize,
                ) -> root::std::string {
                    AtomicBuffer_getStringWithoutLength(self, offset, length)
                }
                #[inline]
                pub unsafe fn getStringLength(
                    &self,
                    offset: root::aeron::util::index_t,
                ) -> ::std::os::raw::c_int {
                    AtomicBuffer_getStringLength(self, offset)
                }
                #[inline]
                pub unsafe fn putString(
                    &mut self,
                    offset: root::aeron::util::index_t,
                    value: *const root::std::string,
                ) -> ::std::os::raw::c_int {
                    AtomicBuffer_putString(self, offset, value)
                }
                #[inline]
                pub unsafe fn putStringWithoutLength(
                    &mut self,
                    offset: root::aeron::util::index_t,
                    value: *const root::std::string,
                ) -> ::std::os::raw::c_int {
                    AtomicBuffer_putStringWithoutLength(self, offset, value)
                }
                #[inline]
                pub unsafe fn boundsCheck(
                    &self,
                    index: root::aeron::util::index_t,
                    length: ::std::os::raw::c_ulong,
                ) {
                    AtomicBuffer_boundsCheck(self, index, length)
                }
                #[inline]
                pub unsafe fn new() -> Self {
                    let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
                    AtomicBuffer_AtomicBuffer(__bindgen_tmp.as_mut_ptr());
                    __bindgen_tmp.assume_init()
                }
                #[inline]
                pub unsafe fn new1(buffer: *mut ::std::os::raw::c_uchar, length: usize) -> Self {
                    let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
                    AtomicBuffer_AtomicBuffer1(__bindgen_tmp.as_mut_ptr(), buffer, length);
                    __bindgen_tmp.assume_init()
                }
                #[inline]
                pub unsafe fn new2(
                    buffer: *mut ::std::os::raw::c_uchar,
                    length: usize,
                    initialValue: ::std::os::raw::c_uchar,
                ) -> Self {
                    let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
                    AtomicBuffer_AtomicBuffer2(
                        __bindgen_tmp.as_mut_ptr(),
                        buffer,
                        length,
                        initialValue,
                    );
                    __bindgen_tmp.assume_init()
                }
            }
            pub mod logbuffer {
                #[allow(unused_imports)]
                use self::super::super::super::super::root;
                pub mod DataFrameHeader {
                    #[allow(unused_imports)]
                    use self::super::super::super::super::super::root;
                    #[repr(C, packed(4))]
                    #[derive(Copy, Clone)]
                    pub struct DataFrameHeaderDefn {
                        pub frameLength: ::std::os::raw::c_int,
                        pub version: ::std::os::raw::c_uchar,
                        pub flags: ::std::os::raw::c_uchar,
                        pub type_: ::std::os::raw::c_ushort,
                        pub termOffset: ::std::os::raw::c_int,
                        pub sessionId: ::std::os::raw::c_int,
                        pub streamId: ::std::os::raw::c_int,
                        pub termId: ::std::os::raw::c_int,
                        pub reservedValue: ::std::os::raw::c_long,
                    }
                    #[test]
                    fn bindgen_test_layout_DataFrameHeaderDefn() {
                        const UNINIT: ::std::mem::MaybeUninit<DataFrameHeaderDefn> =
                            ::std::mem::MaybeUninit::uninit();
                        let ptr = UNINIT.as_ptr();
                        assert_eq!(
                            ::std::mem::size_of::<DataFrameHeaderDefn>(),
                            32usize,
                            concat!("Size of: ", stringify!(DataFrameHeaderDefn))
                        );
                        assert_eq!(
                            ::std::mem::align_of::<DataFrameHeaderDefn>(),
                            4usize,
                            concat!("Alignment of ", stringify!(DataFrameHeaderDefn))
                        );
                        assert_eq!(
                            unsafe {
                                ::std::ptr::addr_of!((*ptr).frameLength) as usize - ptr as usize
                            },
                            0usize,
                            concat!(
                                "Offset of field: ",
                                stringify!(DataFrameHeaderDefn),
                                "::",
                                stringify!(frameLength)
                            )
                        );
                        assert_eq!(
                            unsafe { ::std::ptr::addr_of!((*ptr).version) as usize - ptr as usize },
                            4usize,
                            concat!(
                                "Offset of field: ",
                                stringify!(DataFrameHeaderDefn),
                                "::",
                                stringify!(version)
                            )
                        );
                        assert_eq!(
                            unsafe { ::std::ptr::addr_of!((*ptr).flags) as usize - ptr as usize },
                            5usize,
                            concat!(
                                "Offset of field: ",
                                stringify!(DataFrameHeaderDefn),
                                "::",
                                stringify!(flags)
                            )
                        );
                        assert_eq!(
                            unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
                            6usize,
                            concat!(
                                "Offset of field: ",
                                stringify!(DataFrameHeaderDefn),
                                "::",
                                stringify!(type_)
                            )
                        );
                        assert_eq!(
                            unsafe {
                                ::std::ptr::addr_of!((*ptr).termOffset) as usize - ptr as usize
                            },
                            8usize,
                            concat!(
                                "Offset of field: ",
                                stringify!(DataFrameHeaderDefn),
                                "::",
                                stringify!(termOffset)
                            )
                        );
                        assert_eq!(
                            unsafe {
                                ::std::ptr::addr_of!((*ptr).sessionId) as usize - ptr as usize
                            },
                            12usize,
                            concat!(
                                "Offset of field: ",
                                stringify!(DataFrameHeaderDefn),
                                "::",
                                stringify!(sessionId)
                            )
                        );
                        assert_eq!(
                            unsafe {
                                ::std::ptr::addr_of!((*ptr).streamId) as usize - ptr as usize
                            },
                            16usize,
                            concat!(
                                "Offset of field: ",
                                stringify!(DataFrameHeaderDefn),
                                "::",
                                stringify!(streamId)
                            )
                        );
                        assert_eq!(
                            unsafe { ::std::ptr::addr_of!((*ptr).termId) as usize - ptr as usize },
                            20usize,
                            concat!(
                                "Offset of field: ",
                                stringify!(DataFrameHeaderDefn),
                                "::",
                                stringify!(termId)
                            )
                        );
                        assert_eq!(
                            unsafe {
                                ::std::ptr::addr_of!((*ptr).reservedValue) as usize - ptr as usize
                            },
                            24usize,
                            concat!(
                                "Offset of field: ",
                                stringify!(DataFrameHeaderDefn),
                                "::",
                                stringify!(reservedValue)
                            )
                        );
                    }
                }
                #[repr(C)]
                #[derive(Copy, Clone)]
                pub struct BufferClaim {
                    pub m_buffer: root::aeron::concurrent::AtomicBuffer,
                }
                #[test]
                fn bindgen_test_layout_BufferClaim() {
                    const UNINIT: ::std::mem::MaybeUninit<BufferClaim> =
                        ::std::mem::MaybeUninit::uninit();
                    let ptr = UNINIT.as_ptr();
                    assert_eq!(
                        ::std::mem::size_of::<BufferClaim>(),
                        16usize,
                        concat!("Size of: ", stringify!(BufferClaim))
                    );
                    assert_eq!(
                        ::std::mem::align_of::<BufferClaim>(),
                        8usize,
                        concat!("Alignment of ", stringify!(BufferClaim))
                    );
                    assert_eq!(
                        unsafe { ::std::ptr::addr_of!((*ptr).m_buffer) as usize - ptr as usize },
                        0usize,
                        concat!(
                            "Offset of field: ",
                            stringify!(BufferClaim),
                            "::",
                            stringify!(m_buffer)
                        )
                    );
                }
                extern "C" {
                    #[link_name = "\u{1}_ZN5aeron10concurrent9logbuffer11BufferClaim4wrapEPhi"]
                    pub fn BufferClaim_wrap(
                        this: *mut root::aeron::concurrent::logbuffer::BufferClaim,
                        buffer: *mut ::std::os::raw::c_uchar,
                        length: root::aeron::util::index_t,
                    );
                }
                extern "C" {
                    #[link_name = "\u{1}_ZN5aeron10concurrent9logbuffer11BufferClaim4wrapERNS0_12AtomicBufferEii"]
                    pub fn BufferClaim_wrap1(
                        this: *mut root::aeron::concurrent::logbuffer::BufferClaim,
                        buffer: *mut root::aeron::concurrent::AtomicBuffer,
                        offset: root::aeron::util::index_t,
                        length: root::aeron::util::index_t,
                    );
                }
                extern "C" {
                    #[link_name = "\u{1}_ZN5aeron10concurrent9logbuffer11BufferClaim6bufferEv"]
                    pub fn BufferClaim_buffer(
                        this: *mut root::aeron::concurrent::logbuffer::BufferClaim,
                    ) -> *mut root::aeron::concurrent::AtomicBuffer;
                }
                extern "C" {
                    #[link_name = "\u{1}_ZNK5aeron10concurrent9logbuffer11BufferClaim6offsetEv"]
                    pub fn BufferClaim_offset(
                        this: *const root::aeron::concurrent::logbuffer::BufferClaim,
                    ) -> root::aeron::util::index_t;
                }
                extern "C" {
                    #[link_name = "\u{1}_ZNK5aeron10concurrent9logbuffer11BufferClaim6lengthEv"]
                    pub fn BufferClaim_length(
                        this: *const root::aeron::concurrent::logbuffer::BufferClaim,
                    ) -> root::aeron::util::index_t;
                }
                extern "C" {
                    #[link_name = "\u{1}_ZNK5aeron10concurrent9logbuffer11BufferClaim5flagsEv"]
                    pub fn BufferClaim_flags(
                        this: *const root::aeron::concurrent::logbuffer::BufferClaim,
                    ) -> ::std::os::raw::c_uchar;
                }
                extern "C" {
                    #[link_name = "\u{1}_ZN5aeron10concurrent9logbuffer11BufferClaim5flagsEh"]
                    pub fn BufferClaim_flags1(
                        this: *mut root::aeron::concurrent::logbuffer::BufferClaim,
                        flags: ::std::os::raw::c_uchar,
                    ) -> *mut root::aeron::concurrent::logbuffer::BufferClaim;
                }
                extern "C" {
                    #[link_name = "\u{1}_ZNK5aeron10concurrent9logbuffer11BufferClaim10headerTypeEv"]
                    pub fn BufferClaim_headerType(
                        this: *const root::aeron::concurrent::logbuffer::BufferClaim,
                    ) -> ::std::os::raw::c_ushort;
                }
                extern "C" {
                    #[link_name = "\u{1}_ZN5aeron10concurrent9logbuffer11BufferClaim10headerTypeEt"]
                    pub fn BufferClaim_headerType1(
                        this: *mut root::aeron::concurrent::logbuffer::BufferClaim,
                        type_: ::std::os::raw::c_ushort,
                    ) -> *mut root::aeron::concurrent::logbuffer::BufferClaim;
                }
                extern "C" {
                    #[link_name = "\u{1}_ZNK5aeron10concurrent9logbuffer11BufferClaim13reservedValueEv"]
                    pub fn BufferClaim_reservedValue(
                        this: *const root::aeron::concurrent::logbuffer::BufferClaim,
                    ) -> ::std::os::raw::c_long;
                }
                extern "C" {
                    #[link_name = "\u{1}_ZN5aeron10concurrent9logbuffer11BufferClaim13reservedValueEl"]
                    pub fn BufferClaim_reservedValue1(
                        this: *mut root::aeron::concurrent::logbuffer::BufferClaim,
                        value: ::std::os::raw::c_long,
                    ) -> *mut root::aeron::concurrent::logbuffer::BufferClaim;
                }
                extern "C" {
                    #[link_name = "\u{1}_ZN5aeron10concurrent9logbuffer11BufferClaim6commitEv"]
                    pub fn BufferClaim_commit(
                        this: *mut root::aeron::concurrent::logbuffer::BufferClaim,
                    );
                }
                extern "C" {
                    #[link_name = "\u{1}_ZN5aeron10concurrent9logbuffer11BufferClaim5abortEv"]
                    pub fn BufferClaim_abort(
                        this: *mut root::aeron::concurrent::logbuffer::BufferClaim,
                    );
                }
                extern "C" {
                    #[link_name = "\u{1}_ZN5aeron10concurrent9logbuffer11BufferClaimC1Ev"]
                    pub fn BufferClaim_BufferClaim(
                        this: *mut root::aeron::concurrent::logbuffer::BufferClaim,
                    );
                }
                impl BufferClaim {
                    #[inline]
                    pub unsafe fn wrap(
                        &mut self,
                        buffer: *mut ::std::os::raw::c_uchar,
                        length: root::aeron::util::index_t,
                    ) {
                        BufferClaim_wrap(self, buffer, length)
                    }
                    #[inline]
                    pub unsafe fn wrap1(
                        &mut self,
                        buffer: *mut root::aeron::concurrent::AtomicBuffer,
                        offset: root::aeron::util::index_t,
                        length: root::aeron::util::index_t,
                    ) {
                        BufferClaim_wrap1(self, buffer, offset, length)
                    }
                    #[inline]
                    pub unsafe fn buffer(&mut self) -> *mut root::aeron::concurrent::AtomicBuffer {
                        BufferClaim_buffer(self)
                    }
                    #[inline]
                    pub unsafe fn offset(&self) -> root::aeron::util::index_t {
                        BufferClaim_offset(self)
                    }
                    #[inline]
                    pub unsafe fn length(&self) -> root::aeron::util::index_t {
                        BufferClaim_length(self)
                    }
                    #[inline]
                    pub unsafe fn flags(&self) -> ::std::os::raw::c_uchar {
                        BufferClaim_flags(self)
                    }
                    #[inline]
                    pub unsafe fn flags1(
                        &mut self,
                        flags: ::std::os::raw::c_uchar,
                    ) -> *mut root::aeron::concurrent::logbuffer::BufferClaim {
                        BufferClaim_flags1(self, flags)
                    }
                    #[inline]
                    pub unsafe fn headerType(&self) -> ::std::os::raw::c_ushort {
                        BufferClaim_headerType(self)
                    }
                    #[inline]
                    pub unsafe fn headerType1(
                        &mut self,
                        type_: ::std::os::raw::c_ushort,
                    ) -> *mut root::aeron::concurrent::logbuffer::BufferClaim {
                        BufferClaim_headerType1(self, type_)
                    }
                    #[inline]
                    pub unsafe fn reservedValue(&self) -> ::std::os::raw::c_long {
                        BufferClaim_reservedValue(self)
                    }
                    #[inline]
                    pub unsafe fn reservedValue1(
                        &mut self,
                        value: ::std::os::raw::c_long,
                    ) -> *mut root::aeron::concurrent::logbuffer::BufferClaim {
                        BufferClaim_reservedValue1(self, value)
                    }
                    #[inline]
                    pub unsafe fn commit(&mut self) {
                        BufferClaim_commit(self)
                    }
                    #[inline]
                    pub unsafe fn abort(&mut self) {
                        BufferClaim_abort(self)
                    }
                    #[inline]
                    pub unsafe fn new() -> Self {
                        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
                        BufferClaim_BufferClaim(__bindgen_tmp.as_mut_ptr());
                        __bindgen_tmp.assume_init()
                    }
                }
                pub mod FrameDescriptor {
                    #[allow(unused_imports)]
                    use self::super::super::super::super::super::root;
                }
                #[repr(C)]
                #[derive(Copy, Clone)]
                pub struct HeaderWriter {
                    pub m_sessionId: ::std::os::raw::c_int,
                    pub m_streamId: ::std::os::raw::c_int,
                }
                #[test]
                fn bindgen_test_layout_HeaderWriter() {
                    const UNINIT: ::std::mem::MaybeUninit<HeaderWriter> =
                        ::std::mem::MaybeUninit::uninit();
                    let ptr = UNINIT.as_ptr();
                    assert_eq!(
                        ::std::mem::size_of::<HeaderWriter>(),
                        8usize,
                        concat!("Size of: ", stringify!(HeaderWriter))
                    );
                    assert_eq!(
                        ::std::mem::align_of::<HeaderWriter>(),
                        4usize,
                        concat!("Alignment of ", stringify!(HeaderWriter))
                    );
                    assert_eq!(
                        unsafe { ::std::ptr::addr_of!((*ptr).m_sessionId) as usize - ptr as usize },
                        0usize,
                        concat!(
                            "Offset of field: ",
                            stringify!(HeaderWriter),
                            "::",
                            stringify!(m_sessionId)
                        )
                    );
                    assert_eq!(
                        unsafe { ::std::ptr::addr_of!((*ptr).m_streamId) as usize - ptr as usize },
                        4usize,
                        concat!(
                            "Offset of field: ",
                            stringify!(HeaderWriter),
                            "::",
                            stringify!(m_streamId)
                        )
                    );
                }
                extern "C" {
                    #[link_name = "\u{1}_ZNK5aeron10concurrent9logbuffer12HeaderWriter5writeERNS0_12AtomicBufferEiii"]
                    pub fn HeaderWriter_write(
                        this: *const root::aeron::concurrent::logbuffer::HeaderWriter,
                        termBuffer: *mut root::aeron::concurrent::AtomicBuffer,
                        offset: root::aeron::util::index_t,
                        length: root::aeron::util::index_t,
                        termId: ::std::os::raw::c_int,
                    );
                }
                extern "C" {
                    #[link_name = "\u{1}_ZN5aeron10concurrent9logbuffer12HeaderWriterC1ENS0_12AtomicBufferE"]
                    pub fn HeaderWriter_HeaderWriter(
                        this: *mut root::aeron::concurrent::logbuffer::HeaderWriter,
                        defaultHdr: root::aeron::concurrent::AtomicBuffer,
                    );
                }
                impl HeaderWriter {
                    #[inline]
                    pub unsafe fn write(
                        &self,
                        termBuffer: *mut root::aeron::concurrent::AtomicBuffer,
                        offset: root::aeron::util::index_t,
                        length: root::aeron::util::index_t,
                        termId: ::std::os::raw::c_int,
                    ) {
                        HeaderWriter_write(self, termBuffer, offset, length, termId)
                    }
                    #[inline]
                    pub unsafe fn new(defaultHdr: root::aeron::concurrent::AtomicBuffer) -> Self {
                        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
                        HeaderWriter_HeaderWriter(__bindgen_tmp.as_mut_ptr(), defaultHdr);
                        __bindgen_tmp.assume_init()
                    }
                }
                pub mod LogBufferDescriptor {
                    #[allow(unused_imports)]
                    use self::super::super::super::super::super::root;
                    #[repr(C, packed(4))]
                    #[derive(Copy, Clone)]
                    pub struct LogMetaDataDefn {
                        pub termTailCounters: [::std::os::raw::c_long; 3usize],
                        pub activeTermCount: ::std::os::raw::c_int,
                        pub pad1: [::std::os::raw::c_schar; 100usize],
                        pub endOfStreamPosition: ::std::os::raw::c_long,
                        pub isConnected: ::std::os::raw::c_int,
                        pub activeTransportCount: ::std::os::raw::c_int,
                        pub pad2: [::std::os::raw::c_schar; 112usize],
                        pub correlationId: ::std::os::raw::c_long,
                        pub initialTermId: ::std::os::raw::c_int,
                        pub defaultFrameHeaderLength: ::std::os::raw::c_int,
                        pub mtuLength: ::std::os::raw::c_int,
                        pub termLength: ::std::os::raw::c_int,
                        pub pageSize: ::std::os::raw::c_int,
                        pub pad3: [::std::os::raw::c_schar; 36usize],
                    }
                    #[test]
                    fn bindgen_test_layout_LogMetaDataDefn() {
                        const UNINIT: ::std::mem::MaybeUninit<LogMetaDataDefn> =
                            ::std::mem::MaybeUninit::uninit();
                        let ptr = UNINIT.as_ptr();
                        assert_eq!(
                            ::std::mem::size_of::<LogMetaDataDefn>(),
                            320usize,
                            concat!("Size of: ", stringify!(LogMetaDataDefn))
                        );
                        assert_eq!(
                            ::std::mem::align_of::<LogMetaDataDefn>(),
                            4usize,
                            concat!("Alignment of ", stringify!(LogMetaDataDefn))
                        );
                        assert_eq!(
                            unsafe {
                                ::std::ptr::addr_of!((*ptr).termTailCounters) as usize
                                    - ptr as usize
                            },
                            0usize,
                            concat!(
                                "Offset of field: ",
                                stringify!(LogMetaDataDefn),
                                "::",
                                stringify!(termTailCounters)
                            )
                        );
                        assert_eq!(
                            unsafe {
                                ::std::ptr::addr_of!((*ptr).activeTermCount) as usize - ptr as usize
                            },
                            24usize,
                            concat!(
                                "Offset of field: ",
                                stringify!(LogMetaDataDefn),
                                "::",
                                stringify!(activeTermCount)
                            )
                        );
                        assert_eq!(
                            unsafe { ::std::ptr::addr_of!((*ptr).pad1) as usize - ptr as usize },
                            28usize,
                            concat!(
                                "Offset of field: ",
                                stringify!(LogMetaDataDefn),
                                "::",
                                stringify!(pad1)
                            )
                        );
                        assert_eq!(
                            unsafe {
                                ::std::ptr::addr_of!((*ptr).endOfStreamPosition) as usize
                                    - ptr as usize
                            },
                            128usize,
                            concat!(
                                "Offset of field: ",
                                stringify!(LogMetaDataDefn),
                                "::",
                                stringify!(endOfStreamPosition)
                            )
                        );
                        assert_eq!(
                            unsafe {
                                ::std::ptr::addr_of!((*ptr).isConnected) as usize - ptr as usize
                            },
                            136usize,
                            concat!(
                                "Offset of field: ",
                                stringify!(LogMetaDataDefn),
                                "::",
                                stringify!(isConnected)
                            )
                        );
                        assert_eq!(
                            unsafe {
                                ::std::ptr::addr_of!((*ptr).activeTransportCount) as usize
                                    - ptr as usize
                            },
                            140usize,
                            concat!(
                                "Offset of field: ",
                                stringify!(LogMetaDataDefn),
                                "::",
                                stringify!(activeTransportCount)
                            )
                        );
                        assert_eq!(
                            unsafe { ::std::ptr::addr_of!((*ptr).pad2) as usize - ptr as usize },
                            144usize,
                            concat!(
                                "Offset of field: ",
                                stringify!(LogMetaDataDefn),
                                "::",
                                stringify!(pad2)
                            )
                        );
                        assert_eq!(
                            unsafe {
                                ::std::ptr::addr_of!((*ptr).correlationId) as usize - ptr as usize
                            },
                            256usize,
                            concat!(
                                "Offset of field: ",
                                stringify!(LogMetaDataDefn),
                                "::",
                                stringify!(correlationId)
                            )
                        );
                        assert_eq!(
                            unsafe {
                                ::std::ptr::addr_of!((*ptr).initialTermId) as usize - ptr as usize
                            },
                            264usize,
                            concat!(
                                "Offset of field: ",
                                stringify!(LogMetaDataDefn),
                                "::",
                                stringify!(initialTermId)
                            )
                        );
                        assert_eq!(
                            unsafe {
                                ::std::ptr::addr_of!((*ptr).defaultFrameHeaderLength) as usize
                                    - ptr as usize
                            },
                            268usize,
                            concat!(
                                "Offset of field: ",
                                stringify!(LogMetaDataDefn),
                                "::",
                                stringify!(defaultFrameHeaderLength)
                            )
                        );
                        assert_eq!(
                            unsafe {
                                ::std::ptr::addr_of!((*ptr).mtuLength) as usize - ptr as usize
                            },
                            272usize,
                            concat!(
                                "Offset of field: ",
                                stringify!(LogMetaDataDefn),
                                "::",
                                stringify!(mtuLength)
                            )
                        );
                        assert_eq!(
                            unsafe {
                                ::std::ptr::addr_of!((*ptr).termLength) as usize - ptr as usize
                            },
                            276usize,
                            concat!(
                                "Offset of field: ",
                                stringify!(LogMetaDataDefn),
                                "::",
                                stringify!(termLength)
                            )
                        );
                        assert_eq!(
                            unsafe {
                                ::std::ptr::addr_of!((*ptr).pageSize) as usize - ptr as usize
                            },
                            280usize,
                            concat!(
                                "Offset of field: ",
                                stringify!(LogMetaDataDefn),
                                "::",
                                stringify!(pageSize)
                            )
                        );
                        assert_eq!(
                            unsafe { ::std::ptr::addr_of!((*ptr).pad3) as usize - ptr as usize },
                            284usize,
                            concat!(
                                "Offset of field: ",
                                stringify!(LogMetaDataDefn),
                                "::",
                                stringify!(pad3)
                            )
                        );
                    }
                    extern "C" {
                        #[link_name = "\u{1}_ZN5aeron10concurrent9logbuffer19LogBufferDescriptor15checkTermLengthEi"]
                        pub fn checkTermLength(termLength: ::std::os::raw::c_int);
                    }
                    extern "C" {
                        #[link_name = "\u{1}_ZN5aeron10concurrent9logbuffer19LogBufferDescriptor13checkPageSizeEi"]
                        pub fn checkPageSize(pageSize: ::std::os::raw::c_int);
                    }
                    extern "C" {
                        #[link_name = "\u{1}_ZN5aeron10concurrent9logbuffer19LogBufferDescriptor13initialTermIdERKNS0_12AtomicBufferE"]
                        pub fn initialTermId(
                            logMetaDataBuffer: *const root::aeron::concurrent::AtomicBuffer,
                        ) -> ::std::os::raw::c_int;
                    }
                    extern "C" {
                        #[link_name = "\u{1}_ZN5aeron10concurrent9logbuffer19LogBufferDescriptor9mtuLengthERKNS0_12AtomicBufferE"]
                        pub fn mtuLength(
                            logMetaDataBuffer: *const root::aeron::concurrent::AtomicBuffer,
                        ) -> ::std::os::raw::c_int;
                    }
                    extern "C" {
                        #[link_name = "\u{1}_ZN5aeron10concurrent9logbuffer19LogBufferDescriptor10termLengthERKNS0_12AtomicBufferE"]
                        pub fn termLength(
                            logMetaDataBuffer: *const root::aeron::concurrent::AtomicBuffer,
                        ) -> ::std::os::raw::c_int;
                    }
                    extern "C" {
                        #[link_name = "\u{1}_ZN5aeron10concurrent9logbuffer19LogBufferDescriptor8pageSizeERKNS0_12AtomicBufferE"]
                        pub fn pageSize(
                            logMetaDataBuffer: *const root::aeron::concurrent::AtomicBuffer,
                        ) -> ::std::os::raw::c_int;
                    }
                    extern "C" {
                        #[link_name = "\u{1}_ZN5aeron10concurrent9logbuffer19LogBufferDescriptor15activeTermCountERKNS0_12AtomicBufferE"]
                        pub fn activeTermCount(
                            logMetaDataBuffer: *const root::aeron::concurrent::AtomicBuffer,
                        ) -> ::std::os::raw::c_int;
                    }
                    extern "C" {
                        #[link_name = "\u{1}_ZN5aeron10concurrent9logbuffer19LogBufferDescriptor22activeTermCountOrderedERNS0_12AtomicBufferEi"]
                        pub fn activeTermCountOrdered(
                            logMetaDataBuffer: *mut root::aeron::concurrent::AtomicBuffer,
                            activeTermId: ::std::os::raw::c_int,
                        );
                    }
                    extern "C" {
                        #[link_name = "\u{1}_ZN5aeron10concurrent9logbuffer19LogBufferDescriptor18casActiveTermCountERNS0_12AtomicBufferEii"]
                        pub fn casActiveTermCount(
                            logMetaDataBuffer: *mut root::aeron::concurrent::AtomicBuffer,
                            expectedTermCount: ::std::os::raw::c_int,
                            updateTermCount: ::std::os::raw::c_int,
                        ) -> bool;
                    }
                    extern "C" {
                        #[link_name = "\u{1}_ZN5aeron10concurrent9logbuffer19LogBufferDescriptor18nextPartitionIndexEi"]
                        pub fn nextPartitionIndex(
                            currentIndex: ::std::os::raw::c_int,
                        ) -> ::std::os::raw::c_int;
                    }
                    extern "C" {
                        #[link_name = "\u{1}_ZN5aeron10concurrent9logbuffer19LogBufferDescriptor22previousPartitionIndexEi"]
                        pub fn previousPartitionIndex(
                            currentIndex: ::std::os::raw::c_int,
                        ) -> ::std::os::raw::c_int;
                    }
                    extern "C" {
                        #[link_name = "\u{1}_ZN5aeron10concurrent9logbuffer19LogBufferDescriptor11isConnectedERKNS0_12AtomicBufferE"]
                        pub fn isConnected(
                            logMetaDataBuffer: *const root::aeron::concurrent::AtomicBuffer,
                        ) -> bool;
                    }
                    extern "C" {
                        #[link_name = "\u{1}_ZN5aeron10concurrent9logbuffer19LogBufferDescriptor11isConnectedERNS0_12AtomicBufferEb"]
                        pub fn isConnected1(
                            logMetaDataBuffer: *mut root::aeron::concurrent::AtomicBuffer,
                            isConnected: bool,
                        );
                    }
                    extern "C" {
                        #[link_name = "\u{1}_ZN5aeron10concurrent9logbuffer19LogBufferDescriptor20activeTransportCountERNS0_12AtomicBufferE"]
                        pub fn activeTransportCount(
                            logMegaDataBuffer: *mut root::aeron::concurrent::AtomicBuffer,
                        ) -> ::std::os::raw::c_int;
                    }
                    extern "C" {
                        #[link_name = "\u{1}_ZN5aeron10concurrent9logbuffer19LogBufferDescriptor20activeTransportCountERNS0_12AtomicBufferEi"]
                        pub fn activeTransportCount1(
                            logMetaDataBuffer: *mut root::aeron::concurrent::AtomicBuffer,
                            numberOfActiveTransports: ::std::os::raw::c_int,
                        );
                    }
                    extern "C" {
                        #[link_name = "\u{1}_ZN5aeron10concurrent9logbuffer19LogBufferDescriptor19endOfStreamPositionERKNS0_12AtomicBufferE"]
                        pub fn endOfStreamPosition(
                            logMetaDataBuffer: *const root::aeron::concurrent::AtomicBuffer,
                        ) -> ::std::os::raw::c_long;
                    }
                    extern "C" {
                        #[link_name = "\u{1}_ZN5aeron10concurrent9logbuffer19LogBufferDescriptor19endOfStreamPositionERNS0_12AtomicBufferEl"]
                        pub fn endOfStreamPosition1(
                            logMetaDataBuffer: *mut root::aeron::concurrent::AtomicBuffer,
                            position: ::std::os::raw::c_long,
                        );
                    }
                    extern "C" {
                        #[link_name = "\u{1}_ZN5aeron10concurrent9logbuffer19LogBufferDescriptor16computeTermCountEii"]
                        pub fn computeTermCount(
                            termId: ::std::os::raw::c_int,
                            initialTermId: ::std::os::raw::c_int,
                        ) -> ::std::os::raw::c_int;
                    }
                    extern "C" {
                        #[link_name = "\u{1}_ZN5aeron10concurrent9logbuffer19LogBufferDescriptor11indexByTermEii"]
                        pub fn indexByTerm(
                            initialTermId: ::std::os::raw::c_int,
                            activeTermId: ::std::os::raw::c_int,
                        ) -> ::std::os::raw::c_int;
                    }
                    extern "C" {
                        #[link_name = "\u{1}_ZN5aeron10concurrent9logbuffer19LogBufferDescriptor16indexByTermCountEl"]
                        pub fn indexByTermCount(
                            termCount: ::std::os::raw::c_long,
                        ) -> ::std::os::raw::c_int;
                    }
                    extern "C" {
                        #[link_name = "\u{1}_ZN5aeron10concurrent9logbuffer19LogBufferDescriptor15indexByPositionEli"]
                        pub fn indexByPosition(
                            position: ::std::os::raw::c_long,
                            positionBitsToShift: ::std::os::raw::c_int,
                        ) -> ::std::os::raw::c_int;
                    }
                    extern "C" {
                        #[link_name = "\u{1}_ZN5aeron10concurrent9logbuffer19LogBufferDescriptor15computePositionEiiii"]
                        pub fn computePosition(
                            activeTermId: ::std::os::raw::c_int,
                            termOffset: ::std::os::raw::c_int,
                            positionBitsToShift: ::std::os::raw::c_int,
                            initialTermId: ::std::os::raw::c_int,
                        ) -> ::std::os::raw::c_long;
                    }
                    extern "C" {
                        #[link_name = "\u{1}_ZN5aeron10concurrent9logbuffer19LogBufferDescriptor24computeTermBeginPositionEiii"]
                        pub fn computeTermBeginPosition(
                            activeTermId: ::std::os::raw::c_int,
                            positionBitsToShift: ::std::os::raw::c_int,
                            initialTermId: ::std::os::raw::c_int,
                        ) -> ::std::os::raw::c_long;
                    }
                    extern "C" {
                        #[link_name = "\u{1}_ZN5aeron10concurrent9logbuffer19LogBufferDescriptor15rawTailVolatileERKNS0_12AtomicBufferE"]
                        pub fn rawTailVolatile(
                            logMetaDataBuffer: *const root::aeron::concurrent::AtomicBuffer,
                        ) -> ::std::os::raw::c_long;
                    }
                    extern "C" {
                        #[link_name = "\u{1}_ZN5aeron10concurrent9logbuffer19LogBufferDescriptor15rawTailVolatileERKNS0_12AtomicBufferEi"]
                        pub fn rawTailVolatile1(
                            logMetaDataBuffer: *const root::aeron::concurrent::AtomicBuffer,
                            partitionIndex: ::std::os::raw::c_int,
                        ) -> ::std::os::raw::c_long;
                    }
                    extern "C" {
                        #[link_name = "\u{1}_ZN5aeron10concurrent9logbuffer19LogBufferDescriptor7rawTailERKNS0_12AtomicBufferE"]
                        pub fn rawTail(
                            logMetaDataBuffer: *const root::aeron::concurrent::AtomicBuffer,
                        ) -> ::std::os::raw::c_long;
                    }
                    extern "C" {
                        #[link_name = "\u{1}_ZN5aeron10concurrent9logbuffer19LogBufferDescriptor7rawTailERKNS0_12AtomicBufferEi"]
                        pub fn rawTail1(
                            logMetaDataBuffer: *const root::aeron::concurrent::AtomicBuffer,
                            partitionIndex: ::std::os::raw::c_int,
                        ) -> ::std::os::raw::c_long;
                    }
                    extern "C" {
                        #[link_name = "\u{1}_ZN5aeron10concurrent9logbuffer19LogBufferDescriptor6termIdEl"]
                        pub fn termId(rawTail: ::std::os::raw::c_long) -> ::std::os::raw::c_int;
                    }
                    extern "C" {
                        #[link_name = "\u{1}_ZN5aeron10concurrent9logbuffer19LogBufferDescriptor10termOffsetEll"]
                        pub fn termOffset(
                            rawTail: ::std::os::raw::c_long,
                            termLength: ::std::os::raw::c_long,
                        ) -> ::std::os::raw::c_int;
                    }
                    extern "C" {
                        #[link_name = "\u{1}_ZN5aeron10concurrent9logbuffer19LogBufferDescriptor10casRawTailERNS0_12AtomicBufferEill"]
                        pub fn casRawTail(
                            logMetaDataBuffer: *mut root::aeron::concurrent::AtomicBuffer,
                            partitionIndex: ::std::os::raw::c_int,
                            expectedRawTail: ::std::os::raw::c_long,
                            updateRawTail: ::std::os::raw::c_long,
                        ) -> bool;
                    }
                    extern "C" {
                        #[link_name = "\u{1}_ZN5aeron10concurrent9logbuffer19LogBufferDescriptor17tailCounterOffsetEi"]
                        pub fn tailCounterOffset(
                            partitionIndex: ::std::os::raw::c_int,
                        ) -> ::std::os::raw::c_int;
                    }
                    extern "C" {
                        #[link_name = "\u{1}_ZN5aeron10concurrent9logbuffer19LogBufferDescriptor18defaultFrameHeaderERNS0_12AtomicBufferE"]
                        pub fn defaultFrameHeader(
                            logMetaDataBuffer: *mut root::aeron::concurrent::AtomicBuffer,
                        ) -> root::aeron::concurrent::AtomicBuffer;
                    }
                    extern "C" {
                        #[link_name = "\u{1}_ZN5aeron10concurrent9logbuffer19LogBufferDescriptor9rotateLogERNS0_12AtomicBufferEii"]
                        pub fn rotateLog(
                            logMetaDataBuffer: *mut root::aeron::concurrent::AtomicBuffer,
                            currentTermCount: ::std::os::raw::c_int,
                            currentTermId: ::std::os::raw::c_int,
                        );
                    }
                    extern "C" {
                        #[link_name = "\u{1}_ZN5aeron10concurrent9logbuffer19LogBufferDescriptor24initializeTailWithTermIdERNS0_12AtomicBufferEii"]
                        pub fn initializeTailWithTermId(
                            logMetaDataBuffer: *mut root::aeron::concurrent::AtomicBuffer,
                            partitionIndex: ::std::os::raw::c_int,
                            termId: ::std::os::raw::c_int,
                        );
                    }
                }
                #[repr(C)]
                #[derive(Copy, Clone)]
                pub struct Header {
                    pub m_context: *mut ::std::os::raw::c_void,
                    pub m_buffer: root::aeron::concurrent::AtomicBuffer,
                    pub m_offset: root::aeron::util::index_t,
                    pub m_initialTermId: ::std::os::raw::c_int,
                    pub m_positionBitsToShift: ::std::os::raw::c_int,
                }
                #[test]
                fn bindgen_test_layout_Header() {
                    const UNINIT: ::std::mem::MaybeUninit<Header> =
                        ::std::mem::MaybeUninit::uninit();
                    let ptr = UNINIT.as_ptr();
                    assert_eq!(
                        ::std::mem::size_of::<Header>(),
                        40usize,
                        concat!("Size of: ", stringify!(Header))
                    );
                    assert_eq!(
                        ::std::mem::align_of::<Header>(),
                        8usize,
                        concat!("Alignment of ", stringify!(Header))
                    );
                    assert_eq!(
                        unsafe { ::std::ptr::addr_of!((*ptr).m_context) as usize - ptr as usize },
                        0usize,
                        concat!(
                            "Offset of field: ",
                            stringify!(Header),
                            "::",
                            stringify!(m_context)
                        )
                    );
                    assert_eq!(
                        unsafe { ::std::ptr::addr_of!((*ptr).m_buffer) as usize - ptr as usize },
                        8usize,
                        concat!(
                            "Offset of field: ",
                            stringify!(Header),
                            "::",
                            stringify!(m_buffer)
                        )
                    );
                    assert_eq!(
                        unsafe { ::std::ptr::addr_of!((*ptr).m_offset) as usize - ptr as usize },
                        24usize,
                        concat!(
                            "Offset of field: ",
                            stringify!(Header),
                            "::",
                            stringify!(m_offset)
                        )
                    );
                    assert_eq!(
                        unsafe {
                            ::std::ptr::addr_of!((*ptr).m_initialTermId) as usize - ptr as usize
                        },
                        28usize,
                        concat!(
                            "Offset of field: ",
                            stringify!(Header),
                            "::",
                            stringify!(m_initialTermId)
                        )
                    );
                    assert_eq!(
                        unsafe {
                            ::std::ptr::addr_of!((*ptr).m_positionBitsToShift) as usize
                                - ptr as usize
                        },
                        32usize,
                        concat!(
                            "Offset of field: ",
                            stringify!(Header),
                            "::",
                            stringify!(m_positionBitsToShift)
                        )
                    );
                }
                extern "C" {
                    #[link_name = "\u{1}_ZNK5aeron10concurrent9logbuffer6Header13initialTermIdEv"]
                    pub fn Header_initialTermId(
                        this: *const root::aeron::concurrent::logbuffer::Header,
                    ) -> ::std::os::raw::c_int;
                }
                extern "C" {
                    #[link_name = "\u{1}_ZN5aeron10concurrent9logbuffer6Header13initialTermIdEi"]
                    pub fn Header_initialTermId1(
                        this: *mut root::aeron::concurrent::logbuffer::Header,
                        initialTermId: ::std::os::raw::c_int,
                    );
                }
                extern "C" {
                    #[link_name = "\u{1}_ZNK5aeron10concurrent9logbuffer6Header6offsetEv"]
                    pub fn Header_offset(
                        this: *const root::aeron::concurrent::logbuffer::Header,
                    ) -> root::aeron::util::index_t;
                }
                extern "C" {
                    #[link_name = "\u{1}_ZN5aeron10concurrent9logbuffer6Header6offsetEi"]
                    pub fn Header_offset1(
                        this: *mut root::aeron::concurrent::logbuffer::Header,
                        offset: root::aeron::util::index_t,
                    );
                }
                extern "C" {
                    #[link_name = "\u{1}_ZN5aeron10concurrent9logbuffer6Header6bufferEv"]
                    pub fn Header_buffer(
                        this: *mut root::aeron::concurrent::logbuffer::Header,
                    ) -> *mut root::aeron::concurrent::AtomicBuffer;
                }
                extern "C" {
                    #[link_name = "\u{1}_ZN5aeron10concurrent9logbuffer6Header6bufferERNS0_12AtomicBufferE"]
                    pub fn Header_buffer1(
                        this: *mut root::aeron::concurrent::logbuffer::Header,
                        buffer: *mut root::aeron::concurrent::AtomicBuffer,
                    );
                }
                extern "C" {
                    #[link_name = "\u{1}_ZNK5aeron10concurrent9logbuffer6Header11frameLengthEv"]
                    pub fn Header_frameLength(
                        this: *const root::aeron::concurrent::logbuffer::Header,
                    ) -> ::std::os::raw::c_int;
                }
                extern "C" {
                    #[link_name = "\u{1}_ZNK5aeron10concurrent9logbuffer6Header9sessionIdEv"]
                    pub fn Header_sessionId(
                        this: *const root::aeron::concurrent::logbuffer::Header,
                    ) -> ::std::os::raw::c_int;
                }
                extern "C" {
                    #[link_name = "\u{1}_ZNK5aeron10concurrent9logbuffer6Header8streamIdEv"]
                    pub fn Header_streamId(
                        this: *const root::aeron::concurrent::logbuffer::Header,
                    ) -> ::std::os::raw::c_int;
                }
                extern "C" {
                    #[link_name = "\u{1}_ZNK5aeron10concurrent9logbuffer6Header6termIdEv"]
                    pub fn Header_termId(
                        this: *const root::aeron::concurrent::logbuffer::Header,
                    ) -> ::std::os::raw::c_int;
                }
                extern "C" {
                    #[link_name = "\u{1}_ZNK5aeron10concurrent9logbuffer6Header10termOffsetEv"]
                    pub fn Header_termOffset(
                        this: *const root::aeron::concurrent::logbuffer::Header,
                    ) -> ::std::os::raw::c_int;
                }
                extern "C" {
                    #[link_name = "\u{1}_ZNK5aeron10concurrent9logbuffer6Header4typeEv"]
                    pub fn Header_type(
                        this: *const root::aeron::concurrent::logbuffer::Header,
                    ) -> ::std::os::raw::c_ushort;
                }
                extern "C" {
                    #[link_name = "\u{1}_ZNK5aeron10concurrent9logbuffer6Header5flagsEv"]
                    pub fn Header_flags(
                        this: *const root::aeron::concurrent::logbuffer::Header,
                    ) -> ::std::os::raw::c_uchar;
                }
                extern "C" {
                    #[link_name = "\u{1}_ZNK5aeron10concurrent9logbuffer6Header8positionEv"]
                    pub fn Header_position(
                        this: *const root::aeron::concurrent::logbuffer::Header,
                    ) -> ::std::os::raw::c_long;
                }
                extern "C" {
                    #[link_name = "\u{1}_ZNK5aeron10concurrent9logbuffer6Header19positionBitsToShiftEv"]
                    pub fn Header_positionBitsToShift(
                        this: *const root::aeron::concurrent::logbuffer::Header,
                    ) -> ::std::os::raw::c_int;
                }
                extern "C" {
                    #[link_name = "\u{1}_ZNK5aeron10concurrent9logbuffer6Header13reservedValueEv"]
                    pub fn Header_reservedValue(
                        this: *const root::aeron::concurrent::logbuffer::Header,
                    ) -> ::std::os::raw::c_long;
                }
                extern "C" {
                    #[link_name = "\u{1}_ZNK5aeron10concurrent9logbuffer6Header7contextEv"]
                    pub fn Header_context(
                        this: *const root::aeron::concurrent::logbuffer::Header,
                    ) -> *mut ::std::os::raw::c_void;
                }
                extern "C" {
                    #[link_name = "\u{1}_ZN5aeron10concurrent9logbuffer6HeaderC1EiiPv"]
                    pub fn Header_Header(
                        this: *mut root::aeron::concurrent::logbuffer::Header,
                        initialTermId: ::std::os::raw::c_int,
                        capacity: root::aeron::util::index_t,
                        context: *mut ::std::os::raw::c_void,
                    );
                }
                impl Header {
                    #[inline]
                    pub unsafe fn initialTermId(&self) -> ::std::os::raw::c_int {
                        Header_initialTermId(self)
                    }
                    #[inline]
                    pub unsafe fn initialTermId1(&mut self, initialTermId: ::std::os::raw::c_int) {
                        Header_initialTermId1(self, initialTermId)
                    }
                    #[inline]
                    pub unsafe fn offset(&self) -> root::aeron::util::index_t {
                        Header_offset(self)
                    }
                    #[inline]
                    pub unsafe fn offset1(&mut self, offset: root::aeron::util::index_t) {
                        Header_offset1(self, offset)
                    }
                    #[inline]
                    pub unsafe fn buffer(&mut self) -> *mut root::aeron::concurrent::AtomicBuffer {
                        Header_buffer(self)
                    }
                    #[inline]
                    pub unsafe fn buffer1(
                        &mut self,
                        buffer: *mut root::aeron::concurrent::AtomicBuffer,
                    ) {
                        Header_buffer1(self, buffer)
                    }
                    #[inline]
                    pub unsafe fn frameLength(&self) -> ::std::os::raw::c_int {
                        Header_frameLength(self)
                    }
                    #[inline]
                    pub unsafe fn sessionId(&self) -> ::std::os::raw::c_int {
                        Header_sessionId(self)
                    }
                    #[inline]
                    pub unsafe fn streamId(&self) -> ::std::os::raw::c_int {
                        Header_streamId(self)
                    }
                    #[inline]
                    pub unsafe fn termId(&self) -> ::std::os::raw::c_int {
                        Header_termId(self)
                    }
                    #[inline]
                    pub unsafe fn termOffset(&self) -> ::std::os::raw::c_int {
                        Header_termOffset(self)
                    }
                    #[inline]
                    pub unsafe fn type_(&self) -> ::std::os::raw::c_ushort {
                        Header_type(self)
                    }
                    #[inline]
                    pub unsafe fn flags(&self) -> ::std::os::raw::c_uchar {
                        Header_flags(self)
                    }
                    #[inline]
                    pub unsafe fn position(&self) -> ::std::os::raw::c_long {
                        Header_position(self)
                    }
                    #[inline]
                    pub unsafe fn positionBitsToShift(&self) -> ::std::os::raw::c_int {
                        Header_positionBitsToShift(self)
                    }
                    #[inline]
                    pub unsafe fn reservedValue(&self) -> ::std::os::raw::c_long {
                        Header_reservedValue(self)
                    }
                    #[inline]
                    pub unsafe fn context(&self) -> *mut ::std::os::raw::c_void {
                        Header_context(self)
                    }
                    #[inline]
                    pub unsafe fn new(
                        initialTermId: ::std::os::raw::c_int,
                        capacity: root::aeron::util::index_t,
                        context: *mut ::std::os::raw::c_void,
                    ) -> Self {
                        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
                        Header_Header(__bindgen_tmp.as_mut_ptr(), initialTermId, capacity, context);
                        __bindgen_tmp.assume_init()
                    }
                }
                pub type fragment_handler_t = u8;
                pub mod TermReader {
                    #[allow(unused_imports)]
                    use self::super::super::super::super::super::root;
                    #[repr(C)]
                    #[derive(Copy, Clone)]
                    pub struct ReadOutcome {
                        pub offset: ::std::os::raw::c_int,
                        pub fragmentsRead: ::std::os::raw::c_int,
                    }
                    #[test]
                    fn bindgen_test_layout_ReadOutcome() {
                        const UNINIT: ::std::mem::MaybeUninit<ReadOutcome> =
                            ::std::mem::MaybeUninit::uninit();
                        let ptr = UNINIT.as_ptr();
                        assert_eq!(
                            ::std::mem::size_of::<ReadOutcome>(),
                            8usize,
                            concat!("Size of: ", stringify!(ReadOutcome))
                        );
                        assert_eq!(
                            ::std::mem::align_of::<ReadOutcome>(),
                            4usize,
                            concat!("Alignment of ", stringify!(ReadOutcome))
                        );
                        assert_eq!(
                            unsafe { ::std::ptr::addr_of!((*ptr).offset) as usize - ptr as usize },
                            0usize,
                            concat!(
                                "Offset of field: ",
                                stringify!(ReadOutcome),
                                "::",
                                stringify!(offset)
                            )
                        );
                        assert_eq!(
                            unsafe {
                                ::std::ptr::addr_of!((*ptr).fragmentsRead) as usize - ptr as usize
                            },
                            4usize,
                            concat!(
                                "Offset of field: ",
                                stringify!(ReadOutcome),
                                "::",
                                stringify!(fragmentsRead)
                            )
                        );
                    }
                }
                pub type block_handler_t = u8;
                pub mod TermBlockScanner {
                    #[allow(unused_imports)]
                    use self::super::super::super::super::super::root;
                    extern "C" {
                        #[link_name = "\u{1}_ZN5aeron10concurrent9logbuffer16TermBlockScanner4scanERKNS0_12AtomicBufferEii"]
                        pub fn scan(
                            termBuffer: *const root::aeron::concurrent::AtomicBuffer,
                            termOffset: ::std::os::raw::c_int,
                            limitOffset: ::std::os::raw::c_int,
                        ) -> ::std::os::raw::c_int;
                    }
                }
            }
            pub type on_counters_metadata_t = u8;
            #[repr(C)]
            #[derive(Copy, Clone)]
            pub struct CountersReader {
                pub m_metadataBuffer: root::aeron::concurrent::AtomicBuffer,
                pub m_valuesBuffer: root::aeron::concurrent::AtomicBuffer,
                pub m_maxCounterId: ::std::os::raw::c_int,
            }
            #[repr(C, packed(4))]
            #[derive(Copy, Clone)]
            pub struct CountersReader_CounterValueDefn {
                pub counterValue: ::std::os::raw::c_long,
                pub registrationId: ::std::os::raw::c_long,
                pub ownerId: ::std::os::raw::c_long,
                pub padding: [::std::os::raw::c_schar; 104usize],
            }
            #[test]
            fn bindgen_test_layout_CountersReader_CounterValueDefn() {
                const UNINIT: ::std::mem::MaybeUninit<CountersReader_CounterValueDefn> =
                    ::std::mem::MaybeUninit::uninit();
                let ptr = UNINIT.as_ptr();
                assert_eq!(
                    ::std::mem::size_of::<CountersReader_CounterValueDefn>(),
                    128usize,
                    concat!("Size of: ", stringify!(CountersReader_CounterValueDefn))
                );
                assert_eq!(
                    ::std::mem::align_of::<CountersReader_CounterValueDefn>(),
                    4usize,
                    concat!("Alignment of ", stringify!(CountersReader_CounterValueDefn))
                );
                assert_eq!(
                    unsafe { ::std::ptr::addr_of!((*ptr).counterValue) as usize - ptr as usize },
                    0usize,
                    concat!(
                        "Offset of field: ",
                        stringify!(CountersReader_CounterValueDefn),
                        "::",
                        stringify!(counterValue)
                    )
                );
                assert_eq!(
                    unsafe { ::std::ptr::addr_of!((*ptr).registrationId) as usize - ptr as usize },
                    8usize,
                    concat!(
                        "Offset of field: ",
                        stringify!(CountersReader_CounterValueDefn),
                        "::",
                        stringify!(registrationId)
                    )
                );
                assert_eq!(
                    unsafe { ::std::ptr::addr_of!((*ptr).ownerId) as usize - ptr as usize },
                    16usize,
                    concat!(
                        "Offset of field: ",
                        stringify!(CountersReader_CounterValueDefn),
                        "::",
                        stringify!(ownerId)
                    )
                );
                assert_eq!(
                    unsafe { ::std::ptr::addr_of!((*ptr).padding) as usize - ptr as usize },
                    24usize,
                    concat!(
                        "Offset of field: ",
                        stringify!(CountersReader_CounterValueDefn),
                        "::",
                        stringify!(padding)
                    )
                );
            }
            #[repr(C, packed(4))]
            #[derive(Copy, Clone)]
            pub struct CountersReader_CounterMetaDataDefn {
                pub state: ::std::os::raw::c_int,
                pub typeId: ::std::os::raw::c_int,
                pub freeToReuseDeadline: ::std::os::raw::c_long,
                pub key: [::std::os::raw::c_schar; 112usize],
                pub labelLength: ::std::os::raw::c_int,
                pub label: [::std::os::raw::c_schar; 380usize],
            }
            #[test]
            fn bindgen_test_layout_CountersReader_CounterMetaDataDefn() {
                const UNINIT: ::std::mem::MaybeUninit<CountersReader_CounterMetaDataDefn> =
                    ::std::mem::MaybeUninit::uninit();
                let ptr = UNINIT.as_ptr();
                assert_eq!(
                    ::std::mem::size_of::<CountersReader_CounterMetaDataDefn>(),
                    512usize,
                    concat!("Size of: ", stringify!(CountersReader_CounterMetaDataDefn))
                );
                assert_eq!(
                    ::std::mem::align_of::<CountersReader_CounterMetaDataDefn>(),
                    4usize,
                    concat!(
                        "Alignment of ",
                        stringify!(CountersReader_CounterMetaDataDefn)
                    )
                );
                assert_eq!(
                    unsafe { ::std::ptr::addr_of!((*ptr).state) as usize - ptr as usize },
                    0usize,
                    concat!(
                        "Offset of field: ",
                        stringify!(CountersReader_CounterMetaDataDefn),
                        "::",
                        stringify!(state)
                    )
                );
                assert_eq!(
                    unsafe { ::std::ptr::addr_of!((*ptr).typeId) as usize - ptr as usize },
                    4usize,
                    concat!(
                        "Offset of field: ",
                        stringify!(CountersReader_CounterMetaDataDefn),
                        "::",
                        stringify!(typeId)
                    )
                );
                assert_eq!(
                    unsafe {
                        ::std::ptr::addr_of!((*ptr).freeToReuseDeadline) as usize - ptr as usize
                    },
                    8usize,
                    concat!(
                        "Offset of field: ",
                        stringify!(CountersReader_CounterMetaDataDefn),
                        "::",
                        stringify!(freeToReuseDeadline)
                    )
                );
                assert_eq!(
                    unsafe { ::std::ptr::addr_of!((*ptr).key) as usize - ptr as usize },
                    16usize,
                    concat!(
                        "Offset of field: ",
                        stringify!(CountersReader_CounterMetaDataDefn),
                        "::",
                        stringify!(key)
                    )
                );
                assert_eq!(
                    unsafe { ::std::ptr::addr_of!((*ptr).labelLength) as usize - ptr as usize },
                    128usize,
                    concat!(
                        "Offset of field: ",
                        stringify!(CountersReader_CounterMetaDataDefn),
                        "::",
                        stringify!(labelLength)
                    )
                );
                assert_eq!(
                    unsafe { ::std::ptr::addr_of!((*ptr).label) as usize - ptr as usize },
                    132usize,
                    concat!(
                        "Offset of field: ",
                        stringify!(CountersReader_CounterMetaDataDefn),
                        "::",
                        stringify!(label)
                    )
                );
            }
            pub const CountersReader_NULL_COUNTER_ID: ::std::os::raw::c_int = -1;
            pub const CountersReader_RECORD_UNUSED: ::std::os::raw::c_int = 0;
            pub const CountersReader_RECORD_ALLOCATED: ::std::os::raw::c_int = 1;
            pub const CountersReader_RECORD_RECLAIMED: ::std::os::raw::c_int = -1;
            pub const CountersReader_DEFAULT_REGISTRATION_ID: ::std::os::raw::c_long = 0;
            pub const CountersReader_DEFAULT_OWNER_ID: ::std::os::raw::c_long = 0;
            pub const CountersReader_NOT_FREE_TO_REUSE: ::std::os::raw::c_long =
                9223372036854775807;
            extern "C" {
                #[link_name = "\u{1}_ZN5aeron10concurrent14CountersReader14COUNTER_LENGTHE"]
                pub static CountersReader_COUNTER_LENGTH: root::aeron::util::index_t;
            }
            extern "C" {
                #[link_name = "\u{1}_ZN5aeron10concurrent14CountersReader22REGISTRATION_ID_OFFSETE"]
                pub static CountersReader_REGISTRATION_ID_OFFSET: root::aeron::util::index_t;
            }
            extern "C" {
                #[link_name = "\u{1}_ZN5aeron10concurrent14CountersReader15OWNER_ID_OFFSETE"]
                pub static CountersReader_OWNER_ID_OFFSET: root::aeron::util::index_t;
            }
            extern "C" {
                #[link_name = "\u{1}_ZN5aeron10concurrent14CountersReader15METADATA_LENGTHE"]
                pub static CountersReader_METADATA_LENGTH: root::aeron::util::index_t;
            }
            extern "C" {
                #[link_name = "\u{1}_ZN5aeron10concurrent14CountersReader14TYPE_ID_OFFSETE"]
                pub static CountersReader_TYPE_ID_OFFSET: root::aeron::util::index_t;
            }
            extern "C" {
                #[link_name = "\u{1}_ZN5aeron10concurrent14CountersReader30FREE_FOR_REUSE_DEADLINE_OFFSETE"]
                pub static CountersReader_FREE_FOR_REUSE_DEADLINE_OFFSET:
                    root::aeron::util::index_t;
            }
            extern "C" {
                #[link_name = "\u{1}_ZN5aeron10concurrent14CountersReader10KEY_OFFSETE"]
                pub static CountersReader_KEY_OFFSET: root::aeron::util::index_t;
            }
            extern "C" {
                #[link_name = "\u{1}_ZN5aeron10concurrent14CountersReader19LABEL_LENGTH_OFFSETE"]
                pub static CountersReader_LABEL_LENGTH_OFFSET: root::aeron::util::index_t;
            }
            pub const CountersReader_MAX_LABEL_LENGTH: ::std::os::raw::c_int = 380;
            pub const CountersReader_MAX_KEY_LENGTH: ::std::os::raw::c_int = 112;
            #[test]
            fn bindgen_test_layout_CountersReader() {
                const UNINIT: ::std::mem::MaybeUninit<CountersReader> =
                    ::std::mem::MaybeUninit::uninit();
                let ptr = UNINIT.as_ptr();
                assert_eq!(
                    ::std::mem::size_of::<CountersReader>(),
                    40usize,
                    concat!("Size of: ", stringify!(CountersReader))
                );
                assert_eq!(
                    ::std::mem::align_of::<CountersReader>(),
                    8usize,
                    concat!("Alignment of ", stringify!(CountersReader))
                );
                assert_eq!(
                    unsafe {
                        ::std::ptr::addr_of!((*ptr).m_metadataBuffer) as usize - ptr as usize
                    },
                    0usize,
                    concat!(
                        "Offset of field: ",
                        stringify!(CountersReader),
                        "::",
                        stringify!(m_metadataBuffer)
                    )
                );
                assert_eq!(
                    unsafe { ::std::ptr::addr_of!((*ptr).m_valuesBuffer) as usize - ptr as usize },
                    16usize,
                    concat!(
                        "Offset of field: ",
                        stringify!(CountersReader),
                        "::",
                        stringify!(m_valuesBuffer)
                    )
                );
                assert_eq!(
                    unsafe { ::std::ptr::addr_of!((*ptr).m_maxCounterId) as usize - ptr as usize },
                    32usize,
                    concat!(
                        "Offset of field: ",
                        stringify!(CountersReader),
                        "::",
                        stringify!(m_maxCounterId)
                    )
                );
            }
            extern "C" {
                #[link_name = "\u{1}_ZNK5aeron10concurrent14CountersReader20findByRegistrationIdEl"]
                pub fn CountersReader_findByRegistrationId(
                    this: *const root::aeron::concurrent::CountersReader,
                    registrationId: ::std::os::raw::c_long,
                ) -> ::std::os::raw::c_int;
            }
            extern "C" {
                #[link_name = "\u{1}_ZNK5aeron10concurrent14CountersReader29findByTypeIdAndRegistrationIdEil"]
                pub fn CountersReader_findByTypeIdAndRegistrationId(
                    this: *const root::aeron::concurrent::CountersReader,
                    typeId: ::std::os::raw::c_int,
                    registrationId: ::std::os::raw::c_long,
                ) -> ::std::os::raw::c_int;
            }
            extern "C" {
                #[link_name = "\u{1}_ZNK5aeron10concurrent14CountersReader12maxCounterIdEv"]
                pub fn CountersReader_maxCounterId(
                    this: *const root::aeron::concurrent::CountersReader,
                ) -> ::std::os::raw::c_int;
            }
            extern "C" {
                #[link_name = "\u{1}_ZNK5aeron10concurrent14CountersReader15getCounterValueEi"]
                pub fn CountersReader_getCounterValue(
                    this: *const root::aeron::concurrent::CountersReader,
                    id: ::std::os::raw::c_int,
                ) -> ::std::os::raw::c_long;
            }
            extern "C" {
                #[link_name = "\u{1}_ZNK5aeron10concurrent14CountersReader24getCounterRegistrationIdEi"]
                pub fn CountersReader_getCounterRegistrationId(
                    this: *const root::aeron::concurrent::CountersReader,
                    id: ::std::os::raw::c_int,
                ) -> ::std::os::raw::c_long;
            }
            extern "C" {
                #[link_name = "\u{1}_ZNK5aeron10concurrent14CountersReader17getCounterOwnerIdEi"]
                pub fn CountersReader_getCounterOwnerId(
                    this: *const root::aeron::concurrent::CountersReader,
                    id: ::std::os::raw::c_int,
                ) -> ::std::os::raw::c_long;
            }
            extern "C" {
                #[link_name = "\u{1}_ZNK5aeron10concurrent14CountersReader15getCounterStateEi"]
                pub fn CountersReader_getCounterState(
                    this: *const root::aeron::concurrent::CountersReader,
                    id: ::std::os::raw::c_int,
                ) -> ::std::os::raw::c_int;
            }
            extern "C" {
                #[link_name = "\u{1}_ZNK5aeron10concurrent14CountersReader16getCounterTypeIdEi"]
                pub fn CountersReader_getCounterTypeId(
                    this: *const root::aeron::concurrent::CountersReader,
                    id: ::std::os::raw::c_int,
                ) -> ::std::os::raw::c_int;
            }
            extern "C" {
                #[link_name = "\u{1}_ZNK5aeron10concurrent14CountersReader23getFreeForReuseDeadlineEi"]
                pub fn CountersReader_getFreeForReuseDeadline(
                    this: *const root::aeron::concurrent::CountersReader,
                    id: ::std::os::raw::c_int,
                ) -> ::std::os::raw::c_long;
            }
            extern "C" {
                #[link_name = "\u{1}_ZNK5aeron10concurrent14CountersReader15getCounterLabelB5cxx11Ei"]
                pub fn CountersReader_getCounterLabel(
                    this: *const root::aeron::concurrent::CountersReader,
                    id: ::std::os::raw::c_int,
                ) -> root::std::string;
            }
            extern "C" {
                #[link_name = "\u{1}_ZN5aeron10concurrent14CountersReader13counterOffsetEi"]
                pub fn CountersReader_counterOffset(
                    counterId: ::std::os::raw::c_int,
                ) -> root::aeron::util::index_t;
            }
            extern "C" {
                #[link_name = "\u{1}_ZN5aeron10concurrent14CountersReader14metadataOffsetEi"]
                pub fn CountersReader_metadataOffset(
                    counterId: ::std::os::raw::c_int,
                ) -> root::aeron::util::index_t;
            }
            extern "C" {
                #[link_name = "\u{1}_ZNK5aeron10concurrent14CountersReader12valuesBufferEv"]
                pub fn CountersReader_valuesBuffer(
                    this: *const root::aeron::concurrent::CountersReader,
                ) -> root::aeron::concurrent::AtomicBuffer;
            }
            extern "C" {
                #[link_name = "\u{1}_ZNK5aeron10concurrent14CountersReader14metaDataBufferEv"]
                pub fn CountersReader_metaDataBuffer(
                    this: *const root::aeron::concurrent::CountersReader,
                ) -> root::aeron::concurrent::AtomicBuffer;
            }
            extern "C" {
                #[link_name = "\u{1}_ZNK5aeron10concurrent14CountersReader17validateCounterIdEi"]
                pub fn CountersReader_validateCounterId(
                    this: *const root::aeron::concurrent::CountersReader,
                    counterId: ::std::os::raw::c_int,
                );
            }
            extern "C" {
                #[link_name = "\u{1}_ZN5aeron10concurrent14CountersReaderC1ERKNS0_12AtomicBufferES4_"]
                pub fn CountersReader_CountersReader(
                    this: *mut root::aeron::concurrent::CountersReader,
                    metadataBuffer: *const root::aeron::concurrent::AtomicBuffer,
                    valuesBuffer: *const root::aeron::concurrent::AtomicBuffer,
                );
            }
            impl CountersReader {
                #[inline]
                pub unsafe fn findByRegistrationId(
                    &self,
                    registrationId: ::std::os::raw::c_long,
                ) -> ::std::os::raw::c_int {
                    CountersReader_findByRegistrationId(self, registrationId)
                }
                #[inline]
                pub unsafe fn findByTypeIdAndRegistrationId(
                    &self,
                    typeId: ::std::os::raw::c_int,
                    registrationId: ::std::os::raw::c_long,
                ) -> ::std::os::raw::c_int {
                    CountersReader_findByTypeIdAndRegistrationId(self, typeId, registrationId)
                }
                #[inline]
                pub unsafe fn maxCounterId(&self) -> ::std::os::raw::c_int {
                    CountersReader_maxCounterId(self)
                }
                #[inline]
                pub unsafe fn getCounterValue(
                    &self,
                    id: ::std::os::raw::c_int,
                ) -> ::std::os::raw::c_long {
                    CountersReader_getCounterValue(self, id)
                }
                #[inline]
                pub unsafe fn getCounterRegistrationId(
                    &self,
                    id: ::std::os::raw::c_int,
                ) -> ::std::os::raw::c_long {
                    CountersReader_getCounterRegistrationId(self, id)
                }
                #[inline]
                pub unsafe fn getCounterOwnerId(
                    &self,
                    id: ::std::os::raw::c_int,
                ) -> ::std::os::raw::c_long {
                    CountersReader_getCounterOwnerId(self, id)
                }
                #[inline]
                pub unsafe fn getCounterState(
                    &self,
                    id: ::std::os::raw::c_int,
                ) -> ::std::os::raw::c_int {
                    CountersReader_getCounterState(self, id)
                }
                #[inline]
                pub unsafe fn getCounterTypeId(
                    &self,
                    id: ::std::os::raw::c_int,
                ) -> ::std::os::raw::c_int {
                    CountersReader_getCounterTypeId(self, id)
                }
                #[inline]
                pub unsafe fn getFreeForReuseDeadline(
                    &self,
                    id: ::std::os::raw::c_int,
                ) -> ::std::os::raw::c_long {
                    CountersReader_getFreeForReuseDeadline(self, id)
                }
                #[inline]
                pub unsafe fn getCounterLabel(
                    &self,
                    id: ::std::os::raw::c_int,
                ) -> root::std::string {
                    CountersReader_getCounterLabel(self, id)
                }
                #[inline]
                pub unsafe fn counterOffset(
                    counterId: ::std::os::raw::c_int,
                ) -> root::aeron::util::index_t {
                    CountersReader_counterOffset(counterId)
                }
                #[inline]
                pub unsafe fn metadataOffset(
                    counterId: ::std::os::raw::c_int,
                ) -> root::aeron::util::index_t {
                    CountersReader_metadataOffset(counterId)
                }
                #[inline]
                pub unsafe fn valuesBuffer(&self) -> root::aeron::concurrent::AtomicBuffer {
                    CountersReader_valuesBuffer(self)
                }
                #[inline]
                pub unsafe fn metaDataBuffer(&self) -> root::aeron::concurrent::AtomicBuffer {
                    CountersReader_metaDataBuffer(self)
                }
                #[inline]
                pub unsafe fn validateCounterId(&self, counterId: ::std::os::raw::c_int) {
                    CountersReader_validateCounterId(self, counterId)
                }
                #[inline]
                pub unsafe fn new(
                    metadataBuffer: *const root::aeron::concurrent::AtomicBuffer,
                    valuesBuffer: *const root::aeron::concurrent::AtomicBuffer,
                ) -> Self {
                    let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
                    CountersReader_CountersReader(
                        __bindgen_tmp.as_mut_ptr(),
                        metadataBuffer,
                        valuesBuffer,
                    );
                    __bindgen_tmp.assume_init()
                }
            }
            #[repr(C)]
            pub struct CountersManager {
                pub _base: root::aeron::concurrent::CountersReader,
                pub m_freeList: [u64; 10usize],
                pub m_clock: root::aeron::concurrent::CountersManager_clock_t,
                pub m_freeToReuseTimeoutMs: ::std::os::raw::c_long,
                pub m_highWaterMark: root::aeron::util::index_t,
            }
            pub type CountersManager_clock_t = [u64; 4usize];
            #[test]
            fn bindgen_test_layout_CountersManager() {
                const UNINIT: ::std::mem::MaybeUninit<CountersManager> =
                    ::std::mem::MaybeUninit::uninit();
                let ptr = UNINIT.as_ptr();
                assert_eq!(
                    ::std::mem::size_of::<CountersManager>(),
                    168usize,
                    concat!("Size of: ", stringify!(CountersManager))
                );
                assert_eq!(
                    ::std::mem::align_of::<CountersManager>(),
                    8usize,
                    concat!("Alignment of ", stringify!(CountersManager))
                );
                assert_eq!(
                    unsafe { ::std::ptr::addr_of!((*ptr).m_freeList) as usize - ptr as usize },
                    40usize,
                    concat!(
                        "Offset of field: ",
                        stringify!(CountersManager),
                        "::",
                        stringify!(m_freeList)
                    )
                );
                assert_eq!(
                    unsafe { ::std::ptr::addr_of!((*ptr).m_clock) as usize - ptr as usize },
                    120usize,
                    concat!(
                        "Offset of field: ",
                        stringify!(CountersManager),
                        "::",
                        stringify!(m_clock)
                    )
                );
                assert_eq!(
                    unsafe {
                        ::std::ptr::addr_of!((*ptr).m_freeToReuseTimeoutMs) as usize - ptr as usize
                    },
                    152usize,
                    concat!(
                        "Offset of field: ",
                        stringify!(CountersManager),
                        "::",
                        stringify!(m_freeToReuseTimeoutMs)
                    )
                );
                assert_eq!(
                    unsafe { ::std::ptr::addr_of!((*ptr).m_highWaterMark) as usize - ptr as usize },
                    160usize,
                    concat!(
                        "Offset of field: ",
                        stringify!(CountersManager),
                        "::",
                        stringify!(m_highWaterMark)
                    )
                );
            }
            extern "C" {
                #[link_name = "\u{1}_ZN5aeron10concurrent15CountersManager8allocateEiPKhmRKNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEE"]
                pub fn CountersManager_allocate(
                    this: *mut root::aeron::concurrent::CountersManager,
                    typeId: ::std::os::raw::c_int,
                    key: *mut ::std::os::raw::c_uchar,
                    keyLength: usize,
                    label: *const root::std::string,
                ) -> ::std::os::raw::c_int;
            }
            extern "C" {
                #[link_name = "\u{1}_ZN5aeron10concurrent15CountersManager8allocateERKNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEE"]
                pub fn CountersManager_allocate1(
                    this: *mut root::aeron::concurrent::CountersManager,
                    label: *const root::std::string,
                ) -> ::std::os::raw::c_int;
            }
            extern "C" {
                #[link_name = "\u{1}_ZN5aeron10concurrent15CountersManager4freeEi"]
                pub fn CountersManager_free(
                    this: *mut root::aeron::concurrent::CountersManager,
                    counterId: ::std::os::raw::c_int,
                );
            }
            extern "C" {
                #[link_name = "\u{1}_ZN5aeron10concurrent15CountersManager15setCounterValueEil"]
                pub fn CountersManager_setCounterValue(
                    this: *mut root::aeron::concurrent::CountersManager,
                    counterId: ::std::os::raw::c_int,
                    value: ::std::os::raw::c_long,
                );
            }
            extern "C" {
                #[link_name = "\u{1}_ZN5aeron10concurrent15CountersManager24setCounterRegistrationIdEil"]
                pub fn CountersManager_setCounterRegistrationId(
                    this: *mut root::aeron::concurrent::CountersManager,
                    counterId: ::std::os::raw::c_int,
                    registrationId: ::std::os::raw::c_long,
                );
            }
            extern "C" {
                #[link_name = "\u{1}_ZN5aeron10concurrent15CountersManager17setCounterOwnerIdEil"]
                pub fn CountersManager_setCounterOwnerId(
                    this: *mut root::aeron::concurrent::CountersManager,
                    counterId: ::std::os::raw::c_int,
                    ownerId: ::std::os::raw::c_long,
                );
            }
            extern "C" {
                #[link_name = "\u{1}_ZN5aeron10concurrent15CountersManagerC1ERKNS0_12AtomicBufferES4_"]
                pub fn CountersManager_CountersManager(
                    this: *mut root::aeron::concurrent::CountersManager,
                    metadataBuffer: *const root::aeron::concurrent::AtomicBuffer,
                    valuesBuffer: *const root::aeron::concurrent::AtomicBuffer,
                );
            }
            extern "C" {
                #[link_name = "\u{1}_ZN5aeron10concurrent15CountersManagerC1ERKNS0_12AtomicBufferES4_RKSt8functionIFxvEEl"]
                pub fn CountersManager_CountersManager1(
                    this: *mut root::aeron::concurrent::CountersManager,
                    metadataBuffer: *const root::aeron::concurrent::AtomicBuffer,
                    valuesBuffer: *const root::aeron::concurrent::AtomicBuffer,
                    clock: *const root::aeron::concurrent::CountersManager_clock_t,
                    freeToReuseTimeoutMs: ::std::os::raw::c_long,
                );
            }
            impl CountersManager {
                #[inline]
                pub unsafe fn allocate(
                    &mut self,
                    typeId: ::std::os::raw::c_int,
                    key: *mut ::std::os::raw::c_uchar,
                    keyLength: usize,
                    label: *const root::std::string,
                ) -> ::std::os::raw::c_int {
                    CountersManager_allocate(self, typeId, key, keyLength, label)
                }
                #[inline]
                pub unsafe fn allocate1(
                    &mut self,
                    label: *const root::std::string,
                ) -> ::std::os::raw::c_int {
                    CountersManager_allocate1(self, label)
                }
                #[inline]
                pub unsafe fn free(&mut self, counterId: ::std::os::raw::c_int) {
                    CountersManager_free(self, counterId)
                }
                #[inline]
                pub unsafe fn setCounterValue(
                    &mut self,
                    counterId: ::std::os::raw::c_int,
                    value: ::std::os::raw::c_long,
                ) {
                    CountersManager_setCounterValue(self, counterId, value)
                }
                #[inline]
                pub unsafe fn setCounterRegistrationId(
                    &mut self,
                    counterId: ::std::os::raw::c_int,
                    registrationId: ::std::os::raw::c_long,
                ) {
                    CountersManager_setCounterRegistrationId(self, counterId, registrationId)
                }
                #[inline]
                pub unsafe fn setCounterOwnerId(
                    &mut self,
                    counterId: ::std::os::raw::c_int,
                    ownerId: ::std::os::raw::c_long,
                ) {
                    CountersManager_setCounterOwnerId(self, counterId, ownerId)
                }
                #[inline]
                pub unsafe fn new(
                    metadataBuffer: *const root::aeron::concurrent::AtomicBuffer,
                    valuesBuffer: *const root::aeron::concurrent::AtomicBuffer,
                ) -> Self {
                    let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
                    CountersManager_CountersManager(
                        __bindgen_tmp.as_mut_ptr(),
                        metadataBuffer,
                        valuesBuffer,
                    );
                    __bindgen_tmp.assume_init()
                }
                #[inline]
                pub unsafe fn new1(
                    metadataBuffer: *const root::aeron::concurrent::AtomicBuffer,
                    valuesBuffer: *const root::aeron::concurrent::AtomicBuffer,
                    clock: *const root::aeron::concurrent::CountersManager_clock_t,
                    freeToReuseTimeoutMs: ::std::os::raw::c_long,
                ) -> Self {
                    let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
                    CountersManager_CountersManager1(
                        __bindgen_tmp.as_mut_ptr(),
                        metadataBuffer,
                        valuesBuffer,
                        clock,
                        freeToReuseTimeoutMs,
                    );
                    __bindgen_tmp.assume_init()
                }
            }
            pub mod status {
                #[allow(unused_imports)]
                use self::super::super::super::super::root;
                #[repr(C)]
                #[derive(Copy, Clone)]
                pub struct ReadablePosition<X> {
                    pub m_impl: X,
                    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<X>>,
                }
                #[repr(C)]
                #[derive(Copy, Clone)]
                pub struct Position<X> {
                    pub _base: root::aeron::concurrent::status::ReadablePosition<X>,
                    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<X>>,
                }
                #[repr(C)]
                #[derive(Copy, Clone)]
                pub struct UnsafeBufferPosition {
                    pub m_buffer: root::aeron::concurrent::AtomicBuffer,
                    pub m_id: ::std::os::raw::c_int,
                    pub m_offset: ::std::os::raw::c_int,
                }
                #[test]
                fn bindgen_test_layout_UnsafeBufferPosition() {
                    const UNINIT: ::std::mem::MaybeUninit<UnsafeBufferPosition> =
                        ::std::mem::MaybeUninit::uninit();
                    let ptr = UNINIT.as_ptr();
                    assert_eq!(
                        ::std::mem::size_of::<UnsafeBufferPosition>(),
                        24usize,
                        concat!("Size of: ", stringify!(UnsafeBufferPosition))
                    );
                    assert_eq!(
                        ::std::mem::align_of::<UnsafeBufferPosition>(),
                        8usize,
                        concat!("Alignment of ", stringify!(UnsafeBufferPosition))
                    );
                    assert_eq!(
                        unsafe { ::std::ptr::addr_of!((*ptr).m_buffer) as usize - ptr as usize },
                        0usize,
                        concat!(
                            "Offset of field: ",
                            stringify!(UnsafeBufferPosition),
                            "::",
                            stringify!(m_buffer)
                        )
                    );
                    assert_eq!(
                        unsafe { ::std::ptr::addr_of!((*ptr).m_id) as usize - ptr as usize },
                        16usize,
                        concat!(
                            "Offset of field: ",
                            stringify!(UnsafeBufferPosition),
                            "::",
                            stringify!(m_id)
                        )
                    );
                    assert_eq!(
                        unsafe { ::std::ptr::addr_of!((*ptr).m_offset) as usize - ptr as usize },
                        20usize,
                        concat!(
                            "Offset of field: ",
                            stringify!(UnsafeBufferPosition),
                            "::",
                            stringify!(m_offset)
                        )
                    );
                }
                extern "C" {
                    #[link_name = "\u{1}_ZN5aeron10concurrent6status20UnsafeBufferPosition4wrapERKS2_"]
                    pub fn UnsafeBufferPosition_wrap(
                        this: *mut root::aeron::concurrent::status::UnsafeBufferPosition,
                        position: *const root::aeron::concurrent::status::UnsafeBufferPosition,
                    );
                }
                extern "C" {
                    #[link_name = "\u{1}_ZNK5aeron10concurrent6status20UnsafeBufferPosition2idEv"]
                    pub fn UnsafeBufferPosition_id(
                        this: *const root::aeron::concurrent::status::UnsafeBufferPosition,
                    ) -> ::std::os::raw::c_int;
                }
                extern "C" {
                    #[link_name = "\u{1}_ZNK5aeron10concurrent6status20UnsafeBufferPosition3getEv"]
                    pub fn UnsafeBufferPosition_get(
                        this: *const root::aeron::concurrent::status::UnsafeBufferPosition,
                    ) -> ::std::os::raw::c_long;
                }
                extern "C" {
                    #[link_name = "\u{1}_ZNK5aeron10concurrent6status20UnsafeBufferPosition11getVolatileEv"]
                    pub fn UnsafeBufferPosition_getVolatile(
                        this: *const root::aeron::concurrent::status::UnsafeBufferPosition,
                    ) -> ::std::os::raw::c_long;
                }
                extern "C" {
                    #[link_name = "\u{1}_ZN5aeron10concurrent6status20UnsafeBufferPosition3setEl"]
                    pub fn UnsafeBufferPosition_set(
                        this: *mut root::aeron::concurrent::status::UnsafeBufferPosition,
                        value: ::std::os::raw::c_long,
                    );
                }
                extern "C" {
                    #[link_name = "\u{1}_ZN5aeron10concurrent6status20UnsafeBufferPosition10setOrderedEl"]
                    pub fn UnsafeBufferPosition_setOrdered(
                        this: *mut root::aeron::concurrent::status::UnsafeBufferPosition,
                        value: ::std::os::raw::c_long,
                    );
                }
                extern "C" {
                    #[link_name = "\u{1}_ZN5aeron10concurrent6status20UnsafeBufferPosition5closeEv"]
                    pub fn UnsafeBufferPosition_close(
                        this: *mut root::aeron::concurrent::status::UnsafeBufferPosition,
                    );
                }
                extern "C" {
                    #[link_name = "\u{1}_ZN5aeron10concurrent6status20UnsafeBufferPositionC1ERNS0_12AtomicBufferEi"]
                    pub fn UnsafeBufferPosition_UnsafeBufferPosition(
                        this: *mut root::aeron::concurrent::status::UnsafeBufferPosition,
                        buffer: *mut root::aeron::concurrent::AtomicBuffer,
                        id: ::std::os::raw::c_int,
                    );
                }
                extern "C" {
                    #[link_name = "\u{1}_ZN5aeron10concurrent6status20UnsafeBufferPositionC1Ev"]
                    pub fn UnsafeBufferPosition_UnsafeBufferPosition1(
                        this: *mut root::aeron::concurrent::status::UnsafeBufferPosition,
                    );
                }
                impl UnsafeBufferPosition {
                    #[inline]
                    pub unsafe fn wrap(
                        &mut self,
                        position: *const root::aeron::concurrent::status::UnsafeBufferPosition,
                    ) {
                        UnsafeBufferPosition_wrap(self, position)
                    }
                    #[inline]
                    pub unsafe fn id(&self) -> ::std::os::raw::c_int {
                        UnsafeBufferPosition_id(self)
                    }
                    #[inline]
                    pub unsafe fn get(&self) -> ::std::os::raw::c_long {
                        UnsafeBufferPosition_get(self)
                    }
                    #[inline]
                    pub unsafe fn getVolatile(&self) -> ::std::os::raw::c_long {
                        UnsafeBufferPosition_getVolatile(self)
                    }
                    #[inline]
                    pub unsafe fn set(&mut self, value: ::std::os::raw::c_long) {
                        UnsafeBufferPosition_set(self, value)
                    }
                    #[inline]
                    pub unsafe fn setOrdered(&mut self, value: ::std::os::raw::c_long) {
                        UnsafeBufferPosition_setOrdered(self, value)
                    }
                    #[inline]
                    pub unsafe fn close(&mut self) {
                        UnsafeBufferPosition_close(self)
                    }
                    #[inline]
                    pub unsafe fn new(
                        buffer: *mut root::aeron::concurrent::AtomicBuffer,
                        id: ::std::os::raw::c_int,
                    ) -> Self {
                        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
                        UnsafeBufferPosition_UnsafeBufferPosition(
                            __bindgen_tmp.as_mut_ptr(),
                            buffer,
                            id,
                        );
                        __bindgen_tmp.assume_init()
                    }
                    #[inline]
                    pub unsafe fn new1() -> Self {
                        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
                        UnsafeBufferPosition_UnsafeBufferPosition1(__bindgen_tmp.as_mut_ptr());
                        __bindgen_tmp.assume_init()
                    }
                }
                #[repr(C)]
                #[derive(Copy, Clone)]
                pub struct StatusIndicatorReader {
                    pub m_staticBuffer: [u8; 8usize],
                    pub m_buffer: root::aeron::concurrent::AtomicBuffer,
                    pub m_id: ::std::os::raw::c_int,
                    pub m_offset: ::std::os::raw::c_int,
                }
                #[test]
                fn bindgen_test_layout_StatusIndicatorReader() {
                    const UNINIT: ::std::mem::MaybeUninit<StatusIndicatorReader> =
                        ::std::mem::MaybeUninit::uninit();
                    let ptr = UNINIT.as_ptr();
                    assert_eq!(
                        ::std::mem::size_of::<StatusIndicatorReader>(),
                        32usize,
                        concat!("Size of: ", stringify!(StatusIndicatorReader))
                    );
                    assert_eq!(
                        ::std::mem::align_of::<StatusIndicatorReader>(),
                        8usize,
                        concat!("Alignment of ", stringify!(StatusIndicatorReader))
                    );
                    assert_eq!(
                        unsafe {
                            ::std::ptr::addr_of!((*ptr).m_staticBuffer) as usize - ptr as usize
                        },
                        0usize,
                        concat!(
                            "Offset of field: ",
                            stringify!(StatusIndicatorReader),
                            "::",
                            stringify!(m_staticBuffer)
                        )
                    );
                    assert_eq!(
                        unsafe { ::std::ptr::addr_of!((*ptr).m_buffer) as usize - ptr as usize },
                        8usize,
                        concat!(
                            "Offset of field: ",
                            stringify!(StatusIndicatorReader),
                            "::",
                            stringify!(m_buffer)
                        )
                    );
                    assert_eq!(
                        unsafe { ::std::ptr::addr_of!((*ptr).m_id) as usize - ptr as usize },
                        24usize,
                        concat!(
                            "Offset of field: ",
                            stringify!(StatusIndicatorReader),
                            "::",
                            stringify!(m_id)
                        )
                    );
                    assert_eq!(
                        unsafe { ::std::ptr::addr_of!((*ptr).m_offset) as usize - ptr as usize },
                        28usize,
                        concat!(
                            "Offset of field: ",
                            stringify!(StatusIndicatorReader),
                            "::",
                            stringify!(m_offset)
                        )
                    );
                }
                extern "C" {
                    #[link_name = "\u{1}_ZNK5aeron10concurrent6status21StatusIndicatorReader2idEv"]
                    pub fn StatusIndicatorReader_id(
                        this: *const root::aeron::concurrent::status::StatusIndicatorReader,
                    ) -> ::std::os::raw::c_int;
                }
                extern "C" {
                    #[link_name = "\u{1}_ZNK5aeron10concurrent6status21StatusIndicatorReader11getVolatileEv"]
                    pub fn StatusIndicatorReader_getVolatile(
                        this: *const root::aeron::concurrent::status::StatusIndicatorReader,
                    ) -> ::std::os::raw::c_long;
                }
                extern "C" {
                    #[link_name = "\u{1}_ZN5aeron10concurrent6status21StatusIndicatorReaderC1ERNS0_12AtomicBufferEi"]
                    pub fn StatusIndicatorReader_StatusIndicatorReader(
                        this: *mut root::aeron::concurrent::status::StatusIndicatorReader,
                        buffer: *mut root::aeron::concurrent::AtomicBuffer,
                        id: ::std::os::raw::c_int,
                    );
                }
                extern "C" {
                    #[link_name = "\u{1}_ZN5aeron10concurrent6status21StatusIndicatorReaderC1ERKS2_"]
                    pub fn StatusIndicatorReader_StatusIndicatorReader1(
                        this: *mut root::aeron::concurrent::status::StatusIndicatorReader,
                        indicatorReader : * const root :: aeron :: concurrent :: status :: StatusIndicatorReader,
                    );
                }
                impl StatusIndicatorReader {
                    #[inline]
                    pub unsafe fn id(&self) -> ::std::os::raw::c_int {
                        StatusIndicatorReader_id(self)
                    }
                    #[inline]
                    pub unsafe fn getVolatile(&self) -> ::std::os::raw::c_long {
                        StatusIndicatorReader_getVolatile(self)
                    }
                    #[inline]
                    pub unsafe fn new(
                        buffer: *mut root::aeron::concurrent::AtomicBuffer,
                        id: ::std::os::raw::c_int,
                    ) -> Self {
                        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
                        StatusIndicatorReader_StatusIndicatorReader(
                            __bindgen_tmp.as_mut_ptr(),
                            buffer,
                            id,
                        );
                        __bindgen_tmp.assume_init()
                    }
                    #[inline]
                    pub unsafe fn new1(
                        indicatorReader : * const root :: aeron :: concurrent :: status :: StatusIndicatorReader,
                    ) -> Self {
                        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
                        StatusIndicatorReader_StatusIndicatorReader1(
                            __bindgen_tmp.as_mut_ptr(),
                            indicatorReader,
                        );
                        __bindgen_tmp.assume_init()
                    }
                }
            }
            #[repr(C)]
            pub struct AtomicArrayUpdater<E> {
                pub m_beginChange: u64,
                pub m_array: *mut E,
                pub m_length: usize,
                pub m_endChange: u64,
                pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<E>>,
            }
            #[repr(C)]
            pub struct AtomicCounter {
                pub m_buffer: root::aeron::concurrent::AtomicBuffer,
                pub m_counterId: ::std::os::raw::c_int,
                pub m_countersManager: [u64; 2usize],
                pub m_offset: root::aeron::util::index_t,
            }
            #[test]
            fn bindgen_test_layout_AtomicCounter() {
                const UNINIT: ::std::mem::MaybeUninit<AtomicCounter> =
                    ::std::mem::MaybeUninit::uninit();
                let ptr = UNINIT.as_ptr();
                assert_eq!(
                    ::std::mem::size_of::<AtomicCounter>(),
                    48usize,
                    concat!("Size of: ", stringify!(AtomicCounter))
                );
                assert_eq!(
                    ::std::mem::align_of::<AtomicCounter>(),
                    8usize,
                    concat!("Alignment of ", stringify!(AtomicCounter))
                );
                assert_eq!(
                    unsafe { ::std::ptr::addr_of!((*ptr).m_buffer) as usize - ptr as usize },
                    0usize,
                    concat!(
                        "Offset of field: ",
                        stringify!(AtomicCounter),
                        "::",
                        stringify!(m_buffer)
                    )
                );
                assert_eq!(
                    unsafe { ::std::ptr::addr_of!((*ptr).m_counterId) as usize - ptr as usize },
                    16usize,
                    concat!(
                        "Offset of field: ",
                        stringify!(AtomicCounter),
                        "::",
                        stringify!(m_counterId)
                    )
                );
                assert_eq!(
                    unsafe {
                        ::std::ptr::addr_of!((*ptr).m_countersManager) as usize - ptr as usize
                    },
                    24usize,
                    concat!(
                        "Offset of field: ",
                        stringify!(AtomicCounter),
                        "::",
                        stringify!(m_countersManager)
                    )
                );
                assert_eq!(
                    unsafe { ::std::ptr::addr_of!((*ptr).m_offset) as usize - ptr as usize },
                    40usize,
                    concat!(
                        "Offset of field: ",
                        stringify!(AtomicCounter),
                        "::",
                        stringify!(m_offset)
                    )
                );
            }
            extern "C" {
                #[link_name = "\u{1}_ZNK5aeron10concurrent13AtomicCounter2idEv"]
                pub fn AtomicCounter_id(
                    this: *const root::aeron::concurrent::AtomicCounter,
                ) -> ::std::os::raw::c_int;
            }
            extern "C" {
                #[link_name = "\u{1}_ZN5aeron10concurrent13AtomicCounter9incrementEv"]
                pub fn AtomicCounter_increment(this: *mut root::aeron::concurrent::AtomicCounter);
            }
            extern "C" {
                #[link_name = "\u{1}_ZN5aeron10concurrent13AtomicCounter16incrementOrderedEv"]
                pub fn AtomicCounter_incrementOrdered(
                    this: *mut root::aeron::concurrent::AtomicCounter,
                );
            }
            extern "C" {
                #[link_name = "\u{1}_ZN5aeron10concurrent13AtomicCounter3setEl"]
                pub fn AtomicCounter_set(
                    this: *mut root::aeron::concurrent::AtomicCounter,
                    value: ::std::os::raw::c_long,
                );
            }
            extern "C" {
                #[link_name = "\u{1}_ZN5aeron10concurrent13AtomicCounter10setOrderedEl"]
                pub fn AtomicCounter_setOrdered(
                    this: *mut root::aeron::concurrent::AtomicCounter,
                    value: ::std::os::raw::c_long,
                );
            }
            extern "C" {
                #[link_name = "\u{1}_ZN5aeron10concurrent13AtomicCounter7setWeakEl"]
                pub fn AtomicCounter_setWeak(
                    this: *mut root::aeron::concurrent::AtomicCounter,
                    value: ::std::os::raw::c_long,
                );
            }
            extern "C" {
                #[link_name = "\u{1}_ZN5aeron10concurrent13AtomicCounter9getAndAddEl"]
                pub fn AtomicCounter_getAndAdd(
                    this: *mut root::aeron::concurrent::AtomicCounter,
                    value: ::std::os::raw::c_long,
                ) -> ::std::os::raw::c_long;
            }
            extern "C" {
                #[link_name = "\u{1}_ZN5aeron10concurrent13AtomicCounter16getAndAddOrderedEl"]
                pub fn AtomicCounter_getAndAddOrdered(
                    this: *mut root::aeron::concurrent::AtomicCounter,
                    increment: ::std::os::raw::c_long,
                ) -> ::std::os::raw::c_long;
            }
            extern "C" {
                #[link_name = "\u{1}_ZN5aeron10concurrent13AtomicCounter9getAndSetEl"]
                pub fn AtomicCounter_getAndSet(
                    this: *mut root::aeron::concurrent::AtomicCounter,
                    value: ::std::os::raw::c_long,
                ) -> ::std::os::raw::c_long;
            }
            extern "C" {
                #[link_name = "\u{1}_ZN5aeron10concurrent13AtomicCounter13compareAndSetEll"]
                pub fn AtomicCounter_compareAndSet(
                    this: *mut root::aeron::concurrent::AtomicCounter,
                    expectedValue: ::std::os::raw::c_long,
                    updateValue: ::std::os::raw::c_long,
                ) -> bool;
            }
            extern "C" {
                #[link_name = "\u{1}_ZNK5aeron10concurrent13AtomicCounter3getEv"]
                pub fn AtomicCounter_get(
                    this: *const root::aeron::concurrent::AtomicCounter,
                ) -> ::std::os::raw::c_long;
            }
            extern "C" {
                #[link_name = "\u{1}_ZNK5aeron10concurrent13AtomicCounter7getWeakEv"]
                pub fn AtomicCounter_getWeak(
                    this: *const root::aeron::concurrent::AtomicCounter,
                ) -> ::std::os::raw::c_long;
            }
            extern "C" {
                #[link_name = "\u{1}_ZN5aeron10concurrent13AtomicCounterC1ERKNS0_12AtomicBufferEiSt10shared_ptrINS0_15CountersManagerEE"]
                pub fn AtomicCounter_AtomicCounter(
                    this: *mut root::aeron::concurrent::AtomicCounter,
                    buffer: *const root::aeron::concurrent::AtomicBuffer,
                    counterId: ::std::os::raw::c_int,
                    countersManager: [u64; 2usize],
                );
            }
            extern "C" {
                #[link_name = "\u{1}_ZN5aeron10concurrent13AtomicCounterC1ERKNS0_12AtomicBufferEi"]
                pub fn AtomicCounter_AtomicCounter1(
                    this: *mut root::aeron::concurrent::AtomicCounter,
                    buffer: *const root::aeron::concurrent::AtomicBuffer,
                    counterId: ::std::os::raw::c_int,
                );
            }
            extern "C" {
                #[link_name = "\u{1}_ZN5aeron10concurrent13AtomicCounterD1Ev"]
                pub fn AtomicCounter_AtomicCounter_destructor(
                    this: *mut root::aeron::concurrent::AtomicCounter,
                );
            }
            impl AtomicCounter {
                #[inline]
                pub unsafe fn id(&self) -> ::std::os::raw::c_int {
                    AtomicCounter_id(self)
                }
                #[inline]
                pub unsafe fn increment(&mut self) {
                    AtomicCounter_increment(self)
                }
                #[inline]
                pub unsafe fn incrementOrdered(&mut self) {
                    AtomicCounter_incrementOrdered(self)
                }
                #[inline]
                pub unsafe fn set(&mut self, value: ::std::os::raw::c_long) {
                    AtomicCounter_set(self, value)
                }
                #[inline]
                pub unsafe fn setOrdered(&mut self, value: ::std::os::raw::c_long) {
                    AtomicCounter_setOrdered(self, value)
                }
                #[inline]
                pub unsafe fn setWeak(&mut self, value: ::std::os::raw::c_long) {
                    AtomicCounter_setWeak(self, value)
                }
                #[inline]
                pub unsafe fn getAndAdd(
                    &mut self,
                    value: ::std::os::raw::c_long,
                ) -> ::std::os::raw::c_long {
                    AtomicCounter_getAndAdd(self, value)
                }
                #[inline]
                pub unsafe fn getAndAddOrdered(
                    &mut self,
                    increment: ::std::os::raw::c_long,
                ) -> ::std::os::raw::c_long {
                    AtomicCounter_getAndAddOrdered(self, increment)
                }
                #[inline]
                pub unsafe fn getAndSet(
                    &mut self,
                    value: ::std::os::raw::c_long,
                ) -> ::std::os::raw::c_long {
                    AtomicCounter_getAndSet(self, value)
                }
                #[inline]
                pub unsafe fn compareAndSet(
                    &mut self,
                    expectedValue: ::std::os::raw::c_long,
                    updateValue: ::std::os::raw::c_long,
                ) -> bool {
                    AtomicCounter_compareAndSet(self, expectedValue, updateValue)
                }
                #[inline]
                pub unsafe fn get(&self) -> ::std::os::raw::c_long {
                    AtomicCounter_get(self)
                }
                #[inline]
                pub unsafe fn getWeak(&self) -> ::std::os::raw::c_long {
                    AtomicCounter_getWeak(self)
                }
                #[inline]
                pub unsafe fn new(
                    buffer: *const root::aeron::concurrent::AtomicBuffer,
                    counterId: ::std::os::raw::c_int,
                    countersManager: [u64; 2usize],
                ) -> Self {
                    let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
                    AtomicCounter_AtomicCounter(
                        __bindgen_tmp.as_mut_ptr(),
                        buffer,
                        counterId,
                        countersManager,
                    );
                    __bindgen_tmp.assume_init()
                }
                #[inline]
                pub unsafe fn new1(
                    buffer: *const root::aeron::concurrent::AtomicBuffer,
                    counterId: ::std::os::raw::c_int,
                ) -> Self {
                    let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
                    AtomicCounter_AtomicCounter1(__bindgen_tmp.as_mut_ptr(), buffer, counterId);
                    __bindgen_tmp.assume_init()
                }
                #[inline]
                pub unsafe fn destruct(&mut self) {
                    AtomicCounter_AtomicCounter_destructor(self)
                }
            }
            pub mod ringbuffer {
                #[allow(unused_imports)]
                use self::super::super::super::super::root;
                pub type handler_t = [u64; 4usize];
                pub mod RingBufferDescriptor {
                    #[allow(unused_imports)]
                    use self::super::super::super::super::super::root;
                }
                pub mod RecordDescriptor {
                    #[allow(unused_imports)]
                    use self::super::super::super::super::super::root;
                }
                #[repr(C)]
                #[derive(Copy, Clone)]
                pub struct ManyToOneRingBuffer {
                    pub m_buffer: *mut root::aeron::concurrent::AtomicBuffer,
                    pub m_capacity: root::aeron::util::index_t,
                    pub m_maxMsgLength: root::aeron::util::index_t,
                    pub m_headPositionIndex: root::aeron::util::index_t,
                    pub m_headCachePositionIndex: root::aeron::util::index_t,
                    pub m_tailPositionIndex: root::aeron::util::index_t,
                    pub m_correlationIdCounterIndex: root::aeron::util::index_t,
                    pub m_consumerHeartbeatIndex: root::aeron::util::index_t,
                }
                extern "C" {
                    #[link_name = "\u{1}_ZN5aeron10concurrent10ringbuffer19ManyToOneRingBuffer21INSUFFICIENT_CAPACITYE"]
                    pub static ManyToOneRingBuffer_INSUFFICIENT_CAPACITY:
                        root::aeron::util::index_t;
                }
                #[test]
                fn bindgen_test_layout_ManyToOneRingBuffer() {
                    const UNINIT: ::std::mem::MaybeUninit<ManyToOneRingBuffer> =
                        ::std::mem::MaybeUninit::uninit();
                    let ptr = UNINIT.as_ptr();
                    assert_eq!(
                        ::std::mem::size_of::<ManyToOneRingBuffer>(),
                        40usize,
                        concat!("Size of: ", stringify!(ManyToOneRingBuffer))
                    );
                    assert_eq!(
                        ::std::mem::align_of::<ManyToOneRingBuffer>(),
                        8usize,
                        concat!("Alignment of ", stringify!(ManyToOneRingBuffer))
                    );
                    assert_eq!(
                        unsafe { ::std::ptr::addr_of!((*ptr).m_buffer) as usize - ptr as usize },
                        0usize,
                        concat!(
                            "Offset of field: ",
                            stringify!(ManyToOneRingBuffer),
                            "::",
                            stringify!(m_buffer)
                        )
                    );
                    assert_eq!(
                        unsafe { ::std::ptr::addr_of!((*ptr).m_capacity) as usize - ptr as usize },
                        8usize,
                        concat!(
                            "Offset of field: ",
                            stringify!(ManyToOneRingBuffer),
                            "::",
                            stringify!(m_capacity)
                        )
                    );
                    assert_eq!(
                        unsafe {
                            ::std::ptr::addr_of!((*ptr).m_maxMsgLength) as usize - ptr as usize
                        },
                        12usize,
                        concat!(
                            "Offset of field: ",
                            stringify!(ManyToOneRingBuffer),
                            "::",
                            stringify!(m_maxMsgLength)
                        )
                    );
                    assert_eq!(
                        unsafe {
                            ::std::ptr::addr_of!((*ptr).m_headPositionIndex) as usize - ptr as usize
                        },
                        16usize,
                        concat!(
                            "Offset of field: ",
                            stringify!(ManyToOneRingBuffer),
                            "::",
                            stringify!(m_headPositionIndex)
                        )
                    );
                    assert_eq!(
                        unsafe {
                            ::std::ptr::addr_of!((*ptr).m_headCachePositionIndex) as usize
                                - ptr as usize
                        },
                        20usize,
                        concat!(
                            "Offset of field: ",
                            stringify!(ManyToOneRingBuffer),
                            "::",
                            stringify!(m_headCachePositionIndex)
                        )
                    );
                    assert_eq!(
                        unsafe {
                            ::std::ptr::addr_of!((*ptr).m_tailPositionIndex) as usize - ptr as usize
                        },
                        24usize,
                        concat!(
                            "Offset of field: ",
                            stringify!(ManyToOneRingBuffer),
                            "::",
                            stringify!(m_tailPositionIndex)
                        )
                    );
                    assert_eq!(
                        unsafe {
                            ::std::ptr::addr_of!((*ptr).m_correlationIdCounterIndex) as usize
                                - ptr as usize
                        },
                        28usize,
                        concat!(
                            "Offset of field: ",
                            stringify!(ManyToOneRingBuffer),
                            "::",
                            stringify!(m_correlationIdCounterIndex)
                        )
                    );
                    assert_eq!(
                        unsafe {
                            ::std::ptr::addr_of!((*ptr).m_consumerHeartbeatIndex) as usize
                                - ptr as usize
                        },
                        32usize,
                        concat!(
                            "Offset of field: ",
                            stringify!(ManyToOneRingBuffer),
                            "::",
                            stringify!(m_consumerHeartbeatIndex)
                        )
                    );
                }
                extern "C" {
                    #[link_name = "\u{1}_ZNK5aeron10concurrent10ringbuffer19ManyToOneRingBuffer8capacityEv"]
                    pub fn ManyToOneRingBuffer_capacity(
                        this: *const root::aeron::concurrent::ringbuffer::ManyToOneRingBuffer,
                    ) -> root::aeron::util::index_t;
                }
                extern "C" {
                    #[link_name = "\u{1}_ZN5aeron10concurrent10ringbuffer19ManyToOneRingBuffer5writeEiRNS0_12AtomicBufferEii"]
                    pub fn ManyToOneRingBuffer_write(
                        this: *mut root::aeron::concurrent::ringbuffer::ManyToOneRingBuffer,
                        msgTypeId: ::std::os::raw::c_int,
                        srcBuffer: *mut root::aeron::concurrent::AtomicBuffer,
                        srcIndex: root::aeron::util::index_t,
                        length: root::aeron::util::index_t,
                    ) -> bool;
                }
                extern "C" {
                    #[link_name = "\u{1}_ZN5aeron10concurrent10ringbuffer19ManyToOneRingBuffer4readERKSt8functionIFviRNS0_12AtomicBufferEiiEEi"]
                    pub fn ManyToOneRingBuffer_read(
                        this: *mut root::aeron::concurrent::ringbuffer::ManyToOneRingBuffer,
                        handler: *const root::aeron::concurrent::ringbuffer::handler_t,
                        messageCountLimit: ::std::os::raw::c_int,
                    ) -> ::std::os::raw::c_int;
                }
                extern "C" {
                    #[link_name = "\u{1}_ZN5aeron10concurrent10ringbuffer19ManyToOneRingBuffer4readERKSt8functionIFviRNS0_12AtomicBufferEiiEE"]
                    pub fn ManyToOneRingBuffer_read1(
                        this: *mut root::aeron::concurrent::ringbuffer::ManyToOneRingBuffer,
                        handler: *const root::aeron::concurrent::ringbuffer::handler_t,
                    ) -> ::std::os::raw::c_int;
                }
                extern "C" {
                    #[link_name = "\u{1}_ZNK5aeron10concurrent10ringbuffer19ManyToOneRingBuffer12maxMsgLengthEv"]
                    pub fn ManyToOneRingBuffer_maxMsgLength(
                        this: *const root::aeron::concurrent::ringbuffer::ManyToOneRingBuffer,
                    ) -> root::aeron::util::index_t;
                }
                extern "C" {
                    #[link_name = "\u{1}_ZN5aeron10concurrent10ringbuffer19ManyToOneRingBuffer17nextCorrelationIdEv"]
                    pub fn ManyToOneRingBuffer_nextCorrelationId(
                        this: *mut root::aeron::concurrent::ringbuffer::ManyToOneRingBuffer,
                    ) -> ::std::os::raw::c_long;
                }
                extern "C" {
                    #[link_name = "\u{1}_ZN5aeron10concurrent10ringbuffer19ManyToOneRingBuffer21consumerHeartbeatTimeEl"]
                    pub fn ManyToOneRingBuffer_consumerHeartbeatTime(
                        this: *mut root::aeron::concurrent::ringbuffer::ManyToOneRingBuffer,
                        time: ::std::os::raw::c_long,
                    );
                }
                extern "C" {
                    #[link_name = "\u{1}_ZNK5aeron10concurrent10ringbuffer19ManyToOneRingBuffer21consumerHeartbeatTimeEv"]
                    pub fn ManyToOneRingBuffer_consumerHeartbeatTime1(
                        this: *const root::aeron::concurrent::ringbuffer::ManyToOneRingBuffer,
                    ) -> ::std::os::raw::c_long;
                }
                extern "C" {
                    #[link_name = "\u{1}_ZNK5aeron10concurrent10ringbuffer19ManyToOneRingBuffer16producerPositionEv"]
                    pub fn ManyToOneRingBuffer_producerPosition(
                        this: *const root::aeron::concurrent::ringbuffer::ManyToOneRingBuffer,
                    ) -> ::std::os::raw::c_long;
                }
                extern "C" {
                    #[link_name = "\u{1}_ZNK5aeron10concurrent10ringbuffer19ManyToOneRingBuffer16consumerPositionEv"]
                    pub fn ManyToOneRingBuffer_consumerPosition(
                        this: *const root::aeron::concurrent::ringbuffer::ManyToOneRingBuffer,
                    ) -> ::std::os::raw::c_long;
                }
                extern "C" {
                    #[link_name = "\u{1}_ZNK5aeron10concurrent10ringbuffer19ManyToOneRingBuffer4sizeEv"]
                    pub fn ManyToOneRingBuffer_size(
                        this: *const root::aeron::concurrent::ringbuffer::ManyToOneRingBuffer,
                    ) -> ::std::os::raw::c_int;
                }
                extern "C" {
                    #[link_name = "\u{1}_ZN5aeron10concurrent10ringbuffer19ManyToOneRingBuffer7unblockEv"]
                    pub fn ManyToOneRingBuffer_unblock(
                        this: *mut root::aeron::concurrent::ringbuffer::ManyToOneRingBuffer,
                    ) -> bool;
                }
                extern "C" {
                    #[link_name = "\u{1}_ZN5aeron10concurrent10ringbuffer19ManyToOneRingBufferC1ERNS0_12AtomicBufferE"]
                    pub fn ManyToOneRingBuffer_ManyToOneRingBuffer(
                        this: *mut root::aeron::concurrent::ringbuffer::ManyToOneRingBuffer,
                        buffer: *mut root::aeron::concurrent::AtomicBuffer,
                    );
                }
                impl ManyToOneRingBuffer {
                    #[inline]
                    pub unsafe fn capacity(&self) -> root::aeron::util::index_t {
                        ManyToOneRingBuffer_capacity(self)
                    }
                    #[inline]
                    pub unsafe fn write(
                        &mut self,
                        msgTypeId: ::std::os::raw::c_int,
                        srcBuffer: *mut root::aeron::concurrent::AtomicBuffer,
                        srcIndex: root::aeron::util::index_t,
                        length: root::aeron::util::index_t,
                    ) -> bool {
                        ManyToOneRingBuffer_write(self, msgTypeId, srcBuffer, srcIndex, length)
                    }
                    #[inline]
                    pub unsafe fn read(
                        &mut self,
                        handler: *const root::aeron::concurrent::ringbuffer::handler_t,
                        messageCountLimit: ::std::os::raw::c_int,
                    ) -> ::std::os::raw::c_int {
                        ManyToOneRingBuffer_read(self, handler, messageCountLimit)
                    }
                    #[inline]
                    pub unsafe fn read1(
                        &mut self,
                        handler: *const root::aeron::concurrent::ringbuffer::handler_t,
                    ) -> ::std::os::raw::c_int {
                        ManyToOneRingBuffer_read1(self, handler)
                    }
                    #[inline]
                    pub unsafe fn maxMsgLength(&self) -> root::aeron::util::index_t {
                        ManyToOneRingBuffer_maxMsgLength(self)
                    }
                    #[inline]
                    pub unsafe fn nextCorrelationId(&mut self) -> ::std::os::raw::c_long {
                        ManyToOneRingBuffer_nextCorrelationId(self)
                    }
                    #[inline]
                    pub unsafe fn consumerHeartbeatTime(&mut self, time: ::std::os::raw::c_long) {
                        ManyToOneRingBuffer_consumerHeartbeatTime(self, time)
                    }
                    #[inline]
                    pub unsafe fn consumerHeartbeatTime1(&self) -> ::std::os::raw::c_long {
                        ManyToOneRingBuffer_consumerHeartbeatTime1(self)
                    }
                    #[inline]
                    pub unsafe fn producerPosition(&self) -> ::std::os::raw::c_long {
                        ManyToOneRingBuffer_producerPosition(self)
                    }
                    #[inline]
                    pub unsafe fn consumerPosition(&self) -> ::std::os::raw::c_long {
                        ManyToOneRingBuffer_consumerPosition(self)
                    }
                    #[inline]
                    pub unsafe fn size(&self) -> ::std::os::raw::c_int {
                        ManyToOneRingBuffer_size(self)
                    }
                    #[inline]
                    pub unsafe fn unblock(&mut self) -> bool {
                        ManyToOneRingBuffer_unblock(self)
                    }
                    #[inline]
                    pub unsafe fn new(buffer: *mut root::aeron::concurrent::AtomicBuffer) -> Self {
                        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
                        ManyToOneRingBuffer_ManyToOneRingBuffer(__bindgen_tmp.as_mut_ptr(), buffer);
                        __bindgen_tmp.assume_init()
                    }
                }
            }
            #[repr(C)]
            pub struct AgentRunner<Agent, IdleStrategy> {
                pub m_agent: *mut Agent,
                pub m_idleStrategy: *mut IdleStrategy,
                pub m_exceptionHandler: *mut root::aeron::util::exception_handler_t,
                pub m_isStarted: u8,
                pub m_isRunning: u8,
                pub m_isClosed: u8,
                pub m_thread: root::std::thread,
                pub m_name: root::std::string,
                pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<Agent>>,
                pub _phantom_1: ::std::marker::PhantomData<::std::cell::UnsafeCell<IdleStrategy>>,
            }
            pub mod broadcast {
                #[allow(unused_imports)]
                use self::super::super::super::super::root;
                pub mod BroadcastBufferDescriptor {
                    #[allow(unused_imports)]
                    use self::super::super::super::super::super::root;
                }
                pub mod RecordDescriptor {
                    #[allow(unused_imports)]
                    use self::super::super::super::super::super::root;
                }
                #[repr(C)]
                pub struct BroadcastReceiver {
                    pub m_buffer: *mut root::aeron::concurrent::AtomicBuffer,
                    pub m_capacity: root::aeron::util::index_t,
                    pub m_mask: root::aeron::util::index_t,
                    pub m_tailIntentCounterIndex: root::aeron::util::index_t,
                    pub m_tailCounterIndex: root::aeron::util::index_t,
                    pub m_latestCounterIndex: root::aeron::util::index_t,
                    pub m_recordOffset: root::aeron::util::index_t,
                    pub m_cursor: ::std::os::raw::c_long,
                    pub m_nextRecord: ::std::os::raw::c_long,
                    pub m_lappedCount: u64,
                }
                #[test]
                fn bindgen_test_layout_BroadcastReceiver() {
                    const UNINIT: ::std::mem::MaybeUninit<BroadcastReceiver> =
                        ::std::mem::MaybeUninit::uninit();
                    let ptr = UNINIT.as_ptr();
                    assert_eq!(
                        ::std::mem::size_of::<BroadcastReceiver>(),
                        56usize,
                        concat!("Size of: ", stringify!(BroadcastReceiver))
                    );
                    assert_eq!(
                        ::std::mem::align_of::<BroadcastReceiver>(),
                        8usize,
                        concat!("Alignment of ", stringify!(BroadcastReceiver))
                    );
                    assert_eq!(
                        unsafe { ::std::ptr::addr_of!((*ptr).m_buffer) as usize - ptr as usize },
                        0usize,
                        concat!(
                            "Offset of field: ",
                            stringify!(BroadcastReceiver),
                            "::",
                            stringify!(m_buffer)
                        )
                    );
                    assert_eq!(
                        unsafe { ::std::ptr::addr_of!((*ptr).m_capacity) as usize - ptr as usize },
                        8usize,
                        concat!(
                            "Offset of field: ",
                            stringify!(BroadcastReceiver),
                            "::",
                            stringify!(m_capacity)
                        )
                    );
                    assert_eq!(
                        unsafe { ::std::ptr::addr_of!((*ptr).m_mask) as usize - ptr as usize },
                        12usize,
                        concat!(
                            "Offset of field: ",
                            stringify!(BroadcastReceiver),
                            "::",
                            stringify!(m_mask)
                        )
                    );
                    assert_eq!(
                        unsafe {
                            ::std::ptr::addr_of!((*ptr).m_tailIntentCounterIndex) as usize
                                - ptr as usize
                        },
                        16usize,
                        concat!(
                            "Offset of field: ",
                            stringify!(BroadcastReceiver),
                            "::",
                            stringify!(m_tailIntentCounterIndex)
                        )
                    );
                    assert_eq!(
                        unsafe {
                            ::std::ptr::addr_of!((*ptr).m_tailCounterIndex) as usize - ptr as usize
                        },
                        20usize,
                        concat!(
                            "Offset of field: ",
                            stringify!(BroadcastReceiver),
                            "::",
                            stringify!(m_tailCounterIndex)
                        )
                    );
                    assert_eq!(
                        unsafe {
                            ::std::ptr::addr_of!((*ptr).m_latestCounterIndex) as usize
                                - ptr as usize
                        },
                        24usize,
                        concat!(
                            "Offset of field: ",
                            stringify!(BroadcastReceiver),
                            "::",
                            stringify!(m_latestCounterIndex)
                        )
                    );
                    assert_eq!(
                        unsafe {
                            ::std::ptr::addr_of!((*ptr).m_recordOffset) as usize - ptr as usize
                        },
                        28usize,
                        concat!(
                            "Offset of field: ",
                            stringify!(BroadcastReceiver),
                            "::",
                            stringify!(m_recordOffset)
                        )
                    );
                    assert_eq!(
                        unsafe { ::std::ptr::addr_of!((*ptr).m_cursor) as usize - ptr as usize },
                        32usize,
                        concat!(
                            "Offset of field: ",
                            stringify!(BroadcastReceiver),
                            "::",
                            stringify!(m_cursor)
                        )
                    );
                    assert_eq!(
                        unsafe {
                            ::std::ptr::addr_of!((*ptr).m_nextRecord) as usize - ptr as usize
                        },
                        40usize,
                        concat!(
                            "Offset of field: ",
                            stringify!(BroadcastReceiver),
                            "::",
                            stringify!(m_nextRecord)
                        )
                    );
                    assert_eq!(
                        unsafe {
                            ::std::ptr::addr_of!((*ptr).m_lappedCount) as usize - ptr as usize
                        },
                        48usize,
                        concat!(
                            "Offset of field: ",
                            stringify!(BroadcastReceiver),
                            "::",
                            stringify!(m_lappedCount)
                        )
                    );
                }
                extern "C" {
                    #[link_name = "\u{1}_ZNK5aeron10concurrent9broadcast17BroadcastReceiver8capacityEv"]
                    pub fn BroadcastReceiver_capacity(
                        this: *const root::aeron::concurrent::broadcast::BroadcastReceiver,
                    ) -> root::aeron::util::index_t;
                }
                extern "C" {
                    #[link_name = "\u{1}_ZNK5aeron10concurrent9broadcast17BroadcastReceiver11lappedCountEv"]
                    pub fn BroadcastReceiver_lappedCount(
                        this: *const root::aeron::concurrent::broadcast::BroadcastReceiver,
                    ) -> ::std::os::raw::c_long;
                }
                extern "C" {
                    #[link_name = "\u{1}_ZNK5aeron10concurrent9broadcast17BroadcastReceiver6typeIdEv"]
                    pub fn BroadcastReceiver_typeId(
                        this: *const root::aeron::concurrent::broadcast::BroadcastReceiver,
                    ) -> ::std::os::raw::c_int;
                }
                extern "C" {
                    #[link_name = "\u{1}_ZNK5aeron10concurrent9broadcast17BroadcastReceiver6offsetEv"]
                    pub fn BroadcastReceiver_offset(
                        this: *const root::aeron::concurrent::broadcast::BroadcastReceiver,
                    ) -> root::aeron::util::index_t;
                }
                extern "C" {
                    #[link_name = "\u{1}_ZNK5aeron10concurrent9broadcast17BroadcastReceiver6lengthEv"]
                    pub fn BroadcastReceiver_length(
                        this: *const root::aeron::concurrent::broadcast::BroadcastReceiver,
                    ) -> ::std::os::raw::c_int;
                }
                extern "C" {
                    #[link_name = "\u{1}_ZN5aeron10concurrent9broadcast17BroadcastReceiver6bufferEv"]
                    pub fn BroadcastReceiver_buffer(
                        this: *mut root::aeron::concurrent::broadcast::BroadcastReceiver,
                    ) -> *mut root::aeron::concurrent::AtomicBuffer;
                }
                extern "C" {
                    #[link_name = "\u{1}_ZN5aeron10concurrent9broadcast17BroadcastReceiver11receiveNextEv"]
                    pub fn BroadcastReceiver_receiveNext(
                        this: *mut root::aeron::concurrent::broadcast::BroadcastReceiver,
                    ) -> bool;
                }
                extern "C" {
                    #[link_name = "\u{1}_ZNK5aeron10concurrent9broadcast17BroadcastReceiver8validateEv"]
                    pub fn BroadcastReceiver_validate(
                        this: *const root::aeron::concurrent::broadcast::BroadcastReceiver,
                    ) -> bool;
                }
                extern "C" {
                    #[link_name = "\u{1}_ZN5aeron10concurrent9broadcast17BroadcastReceiverC1ERNS0_12AtomicBufferE"]
                    pub fn BroadcastReceiver_BroadcastReceiver(
                        this: *mut root::aeron::concurrent::broadcast::BroadcastReceiver,
                        buffer: *mut root::aeron::concurrent::AtomicBuffer,
                    );
                }
                impl BroadcastReceiver {
                    #[inline]
                    pub unsafe fn capacity(&self) -> root::aeron::util::index_t {
                        BroadcastReceiver_capacity(self)
                    }
                    #[inline]
                    pub unsafe fn lappedCount(&self) -> ::std::os::raw::c_long {
                        BroadcastReceiver_lappedCount(self)
                    }
                    #[inline]
                    pub unsafe fn typeId(&self) -> ::std::os::raw::c_int {
                        BroadcastReceiver_typeId(self)
                    }
                    #[inline]
                    pub unsafe fn offset(&self) -> root::aeron::util::index_t {
                        BroadcastReceiver_offset(self)
                    }
                    #[inline]
                    pub unsafe fn length(&self) -> ::std::os::raw::c_int {
                        BroadcastReceiver_length(self)
                    }
                    #[inline]
                    pub unsafe fn buffer(&mut self) -> *mut root::aeron::concurrent::AtomicBuffer {
                        BroadcastReceiver_buffer(self)
                    }
                    #[inline]
                    pub unsafe fn receiveNext(&mut self) -> bool {
                        BroadcastReceiver_receiveNext(self)
                    }
                    #[inline]
                    pub unsafe fn validate(&self) -> bool {
                        BroadcastReceiver_validate(self)
                    }
                    #[inline]
                    pub unsafe fn new(buffer: *mut root::aeron::concurrent::AtomicBuffer) -> Self {
                        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
                        BroadcastReceiver_BroadcastReceiver(__bindgen_tmp.as_mut_ptr(), buffer);
                        __bindgen_tmp.assume_init()
                    }
                }
                pub type scratch_buffer_t = [u8; 4096usize];
                pub type handler_t = [u64; 4usize];
                #[repr(C)]
                #[repr(align(16))]
                pub struct CopyBroadcastReceiver {
                    pub m_scratch: root::aeron::concurrent::broadcast::scratch_buffer_t,
                    pub m_receiver: *mut root::aeron::concurrent::broadcast::BroadcastReceiver,
                    pub m_scratchBuffer: root::aeron::concurrent::AtomicBuffer,
                }
                #[test]
                fn bindgen_test_layout_CopyBroadcastReceiver() {
                    const UNINIT: ::std::mem::MaybeUninit<CopyBroadcastReceiver> =
                        ::std::mem::MaybeUninit::uninit();
                    let ptr = UNINIT.as_ptr();
                    assert_eq!(
                        ::std::mem::size_of::<CopyBroadcastReceiver>(),
                        4128usize,
                        concat!("Size of: ", stringify!(CopyBroadcastReceiver))
                    );
                    assert_eq!(
                        ::std::mem::align_of::<CopyBroadcastReceiver>(),
                        16usize,
                        concat!("Alignment of ", stringify!(CopyBroadcastReceiver))
                    );
                    assert_eq!(
                        unsafe { ::std::ptr::addr_of!((*ptr).m_scratch) as usize - ptr as usize },
                        0usize,
                        concat!(
                            "Offset of field: ",
                            stringify!(CopyBroadcastReceiver),
                            "::",
                            stringify!(m_scratch)
                        )
                    );
                    assert_eq!(
                        unsafe { ::std::ptr::addr_of!((*ptr).m_receiver) as usize - ptr as usize },
                        4096usize,
                        concat!(
                            "Offset of field: ",
                            stringify!(CopyBroadcastReceiver),
                            "::",
                            stringify!(m_receiver)
                        )
                    );
                    assert_eq!(
                        unsafe {
                            ::std::ptr::addr_of!((*ptr).m_scratchBuffer) as usize - ptr as usize
                        },
                        4104usize,
                        concat!(
                            "Offset of field: ",
                            stringify!(CopyBroadcastReceiver),
                            "::",
                            stringify!(m_scratchBuffer)
                        )
                    );
                }
                extern "C" {
                    #[link_name = "\u{1}_ZN5aeron10concurrent9broadcast21CopyBroadcastReceiver7receiveERKSt8functionIFviRNS0_12AtomicBufferEiiEE"]
                    pub fn CopyBroadcastReceiver_receive(
                        this: *mut root::aeron::concurrent::broadcast::CopyBroadcastReceiver,
                        handler: *const root::aeron::concurrent::broadcast::handler_t,
                    ) -> ::std::os::raw::c_int;
                }
                extern "C" {
                    #[link_name = "\u{1}_ZN5aeron10concurrent9broadcast21CopyBroadcastReceiverC1ERNS1_17BroadcastReceiverE"]
                    pub fn CopyBroadcastReceiver_CopyBroadcastReceiver(
                        this: *mut root::aeron::concurrent::broadcast::CopyBroadcastReceiver,
                        receiver: *mut root::aeron::concurrent::broadcast::BroadcastReceiver,
                    );
                }
                impl CopyBroadcastReceiver {
                    #[inline]
                    pub unsafe fn receive(
                        &mut self,
                        handler: *const root::aeron::concurrent::broadcast::handler_t,
                    ) -> ::std::os::raw::c_int {
                        CopyBroadcastReceiver_receive(self, handler)
                    }
                    #[inline]
                    pub unsafe fn new(
                        receiver: *mut root::aeron::concurrent::broadcast::BroadcastReceiver,
                    ) -> Self {
                        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
                        CopyBroadcastReceiver_CopyBroadcastReceiver(
                            __bindgen_tmp.as_mut_ptr(),
                            receiver,
                        );
                        __bindgen_tmp.assume_init()
                    }
                }
            }
            #[repr(C)]
            pub struct SleepingIdleStrategy {
                pub m_duration: u64,
            }
            #[test]
            fn bindgen_test_layout_SleepingIdleStrategy() {
                const UNINIT: ::std::mem::MaybeUninit<SleepingIdleStrategy> =
                    ::std::mem::MaybeUninit::uninit();
                let ptr = UNINIT.as_ptr();
                assert_eq!(
                    ::std::mem::size_of::<SleepingIdleStrategy>(),
                    8usize,
                    concat!("Size of: ", stringify!(SleepingIdleStrategy))
                );
                assert_eq!(
                    ::std::mem::align_of::<SleepingIdleStrategy>(),
                    8usize,
                    concat!("Alignment of ", stringify!(SleepingIdleStrategy))
                );
                assert_eq!(
                    unsafe { ::std::ptr::addr_of!((*ptr).m_duration) as usize - ptr as usize },
                    0usize,
                    concat!(
                        "Offset of field: ",
                        stringify!(SleepingIdleStrategy),
                        "::",
                        stringify!(m_duration)
                    )
                );
            }
            extern "C" {
                #[link_name = "\u{1}_ZN5aeron10concurrent20SleepingIdleStrategy4idleEi"]
                pub fn SleepingIdleStrategy_idle(
                    this: *mut root::aeron::concurrent::SleepingIdleStrategy,
                    workCount: ::std::os::raw::c_int,
                );
            }
            extern "C" {
                #[link_name = "\u{1}_ZN5aeron10concurrent20SleepingIdleStrategy5resetEv"]
                pub fn SleepingIdleStrategy_reset(
                    this: *mut root::aeron::concurrent::SleepingIdleStrategy,
                );
            }
            extern "C" {
                #[link_name = "\u{1}_ZN5aeron10concurrent20SleepingIdleStrategy4idleEv"]
                pub fn SleepingIdleStrategy_idle1(
                    this: *mut root::aeron::concurrent::SleepingIdleStrategy,
                );
            }
            extern "C" {
                #[link_name = "\u{1}_ZN5aeron10concurrent20SleepingIdleStrategyC1ENSt6chrono8durationIlSt5ratioILl1ELl1000EEEE"]
                pub fn SleepingIdleStrategy_SleepingIdleStrategy(
                    this: *mut root::aeron::concurrent::SleepingIdleStrategy,
                    duration: u64,
                );
            }
            impl SleepingIdleStrategy {
                #[inline]
                pub unsafe fn idle(&mut self, workCount: ::std::os::raw::c_int) {
                    SleepingIdleStrategy_idle(self, workCount)
                }
                #[inline]
                pub unsafe fn reset(&mut self) {
                    SleepingIdleStrategy_reset(self)
                }
                #[inline]
                pub unsafe fn idle1(&mut self) {
                    SleepingIdleStrategy_idle1(self)
                }
                #[inline]
                pub unsafe fn new(duration: u64) -> Self {
                    let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
                    SleepingIdleStrategy_SleepingIdleStrategy(__bindgen_tmp.as_mut_ptr(), duration);
                    __bindgen_tmp.assume_init()
                }
            }
            #[repr(C)]
            #[derive(Copy, Clone)]
            pub struct AgentInvoker<Agent> {
                pub m_agent: *mut Agent,
                pub m_exceptionHandler: *mut root::aeron::util::exception_handler_t,
                pub m_isStarted: bool,
                pub m_isRunning: bool,
                pub m_isClosed: bool,
                pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<Agent>>,
            }
            #[repr(C)]
            pub struct BackoffIdleStrategy {
                pub m_prePad: [::std::os::raw::c_uchar; 64usize],
                pub m_maxSpins: ::std::os::raw::c_long,
                pub m_maxYields: ::std::os::raw::c_long,
                pub m_minParkPeriodNs: u64,
                pub m_maxParkPeriodNs: u64,
                pub m_spins: ::std::os::raw::c_long,
                pub m_yields: ::std::os::raw::c_long,
                pub m_parkPeriodNs: u64,
                pub m_state: ::std::os::raw::c_uchar,
                pub m_postPad: [::std::os::raw::c_uchar; 64usize],
            }
            #[test]
            fn bindgen_test_layout_BackoffIdleStrategy() {
                const UNINIT: ::std::mem::MaybeUninit<BackoffIdleStrategy> =
                    ::std::mem::MaybeUninit::uninit();
                let ptr = UNINIT.as_ptr();
                assert_eq!(
                    ::std::mem::size_of::<BackoffIdleStrategy>(),
                    192usize,
                    concat!("Size of: ", stringify!(BackoffIdleStrategy))
                );
                assert_eq!(
                    ::std::mem::align_of::<BackoffIdleStrategy>(),
                    8usize,
                    concat!("Alignment of ", stringify!(BackoffIdleStrategy))
                );
                assert_eq!(
                    unsafe { ::std::ptr::addr_of!((*ptr).m_prePad) as usize - ptr as usize },
                    0usize,
                    concat!(
                        "Offset of field: ",
                        stringify!(BackoffIdleStrategy),
                        "::",
                        stringify!(m_prePad)
                    )
                );
                assert_eq!(
                    unsafe { ::std::ptr::addr_of!((*ptr).m_maxSpins) as usize - ptr as usize },
                    64usize,
                    concat!(
                        "Offset of field: ",
                        stringify!(BackoffIdleStrategy),
                        "::",
                        stringify!(m_maxSpins)
                    )
                );
                assert_eq!(
                    unsafe { ::std::ptr::addr_of!((*ptr).m_maxYields) as usize - ptr as usize },
                    72usize,
                    concat!(
                        "Offset of field: ",
                        stringify!(BackoffIdleStrategy),
                        "::",
                        stringify!(m_maxYields)
                    )
                );
                assert_eq!(
                    unsafe {
                        ::std::ptr::addr_of!((*ptr).m_minParkPeriodNs) as usize - ptr as usize
                    },
                    80usize,
                    concat!(
                        "Offset of field: ",
                        stringify!(BackoffIdleStrategy),
                        "::",
                        stringify!(m_minParkPeriodNs)
                    )
                );
                assert_eq!(
                    unsafe {
                        ::std::ptr::addr_of!((*ptr).m_maxParkPeriodNs) as usize - ptr as usize
                    },
                    88usize,
                    concat!(
                        "Offset of field: ",
                        stringify!(BackoffIdleStrategy),
                        "::",
                        stringify!(m_maxParkPeriodNs)
                    )
                );
                assert_eq!(
                    unsafe { ::std::ptr::addr_of!((*ptr).m_spins) as usize - ptr as usize },
                    96usize,
                    concat!(
                        "Offset of field: ",
                        stringify!(BackoffIdleStrategy),
                        "::",
                        stringify!(m_spins)
                    )
                );
                assert_eq!(
                    unsafe { ::std::ptr::addr_of!((*ptr).m_yields) as usize - ptr as usize },
                    104usize,
                    concat!(
                        "Offset of field: ",
                        stringify!(BackoffIdleStrategy),
                        "::",
                        stringify!(m_yields)
                    )
                );
                assert_eq!(
                    unsafe { ::std::ptr::addr_of!((*ptr).m_parkPeriodNs) as usize - ptr as usize },
                    112usize,
                    concat!(
                        "Offset of field: ",
                        stringify!(BackoffIdleStrategy),
                        "::",
                        stringify!(m_parkPeriodNs)
                    )
                );
                assert_eq!(
                    unsafe { ::std::ptr::addr_of!((*ptr).m_state) as usize - ptr as usize },
                    120usize,
                    concat!(
                        "Offset of field: ",
                        stringify!(BackoffIdleStrategy),
                        "::",
                        stringify!(m_state)
                    )
                );
                assert_eq!(
                    unsafe { ::std::ptr::addr_of!((*ptr).m_postPad) as usize - ptr as usize },
                    121usize,
                    concat!(
                        "Offset of field: ",
                        stringify!(BackoffIdleStrategy),
                        "::",
                        stringify!(m_postPad)
                    )
                );
            }
            extern "C" {
                #[link_name = "\u{1}_ZN5aeron10concurrent19BackoffIdleStrategy4idleEi"]
                pub fn BackoffIdleStrategy_idle(
                    this: *mut root::aeron::concurrent::BackoffIdleStrategy,
                    workCount: ::std::os::raw::c_int,
                );
            }
            extern "C" {
                #[link_name = "\u{1}_ZN5aeron10concurrent19BackoffIdleStrategy5resetEv"]
                pub fn BackoffIdleStrategy_reset(
                    this: *mut root::aeron::concurrent::BackoffIdleStrategy,
                );
            }
            extern "C" {
                #[link_name = "\u{1}_ZN5aeron10concurrent19BackoffIdleStrategy4idleEv"]
                pub fn BackoffIdleStrategy_idle1(
                    this: *mut root::aeron::concurrent::BackoffIdleStrategy,
                );
            }
            extern "C" {
                #[link_name = "\u{1}_ZN5aeron10concurrent19BackoffIdleStrategyC1EllNSt6chrono8durationIlSt5ratioILl1ELl1000000000EEEES6_"]
                pub fn BackoffIdleStrategy_BackoffIdleStrategy(
                    this: *mut root::aeron::concurrent::BackoffIdleStrategy,
                    maxSpins: ::std::os::raw::c_long,
                    maxYields: ::std::os::raw::c_long,
                    minParkPeriodNs: u64,
                    maxParkPeriodNs: u64,
                );
            }
            impl BackoffIdleStrategy {
                #[inline]
                pub unsafe fn idle(&mut self, workCount: ::std::os::raw::c_int) {
                    BackoffIdleStrategy_idle(self, workCount)
                }
                #[inline]
                pub unsafe fn reset(&mut self) {
                    BackoffIdleStrategy_reset(self)
                }
                #[inline]
                pub unsafe fn idle1(&mut self) {
                    BackoffIdleStrategy_idle1(self)
                }
                #[inline]
                pub unsafe fn new(
                    maxSpins: ::std::os::raw::c_long,
                    maxYields: ::std::os::raw::c_long,
                    minParkPeriodNs: u64,
                    maxParkPeriodNs: u64,
                ) -> Self {
                    let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
                    BackoffIdleStrategy_BackoffIdleStrategy(
                        __bindgen_tmp.as_mut_ptr(),
                        maxSpins,
                        maxYields,
                        minParkPeriodNs,
                        maxParkPeriodNs,
                    );
                    __bindgen_tmp.assume_init()
                }
            }
            #[repr(C)]
            #[derive(Copy, Clone)]
            pub struct YieldingIdleStrategy {
                pub _address: u8,
            }
            #[test]
            fn bindgen_test_layout_YieldingIdleStrategy() {
                assert_eq!(
                    ::std::mem::size_of::<YieldingIdleStrategy>(),
                    1usize,
                    concat!("Size of: ", stringify!(YieldingIdleStrategy))
                );
                assert_eq!(
                    ::std::mem::align_of::<YieldingIdleStrategy>(),
                    1usize,
                    concat!("Alignment of ", stringify!(YieldingIdleStrategy))
                );
            }
            extern "C" {
                #[link_name = "\u{1}_ZN5aeron10concurrent20YieldingIdleStrategy4idleEi"]
                pub fn YieldingIdleStrategy_idle(
                    this: *mut root::aeron::concurrent::YieldingIdleStrategy,
                    workCount: ::std::os::raw::c_int,
                );
            }
            extern "C" {
                #[link_name = "\u{1}_ZN5aeron10concurrent20YieldingIdleStrategy5resetEv"]
                pub fn YieldingIdleStrategy_reset(
                    this: *mut root::aeron::concurrent::YieldingIdleStrategy,
                );
            }
            extern "C" {
                #[link_name = "\u{1}_ZN5aeron10concurrent20YieldingIdleStrategy4idleEv"]
                pub fn YieldingIdleStrategy_idle1(
                    this: *mut root::aeron::concurrent::YieldingIdleStrategy,
                );
            }
            extern "C" {
                #[link_name = "\u{1}_ZN5aeron10concurrent20YieldingIdleStrategyC1Ev"]
                pub fn YieldingIdleStrategy_YieldingIdleStrategy(
                    this: *mut root::aeron::concurrent::YieldingIdleStrategy,
                );
            }
            impl YieldingIdleStrategy {
                #[inline]
                pub unsafe fn idle(&mut self, workCount: ::std::os::raw::c_int) {
                    YieldingIdleStrategy_idle(self, workCount)
                }
                #[inline]
                pub unsafe fn reset(&mut self) {
                    YieldingIdleStrategy_reset(self)
                }
                #[inline]
                pub unsafe fn idle1(&mut self) {
                    YieldingIdleStrategy_idle1(self)
                }
                #[inline]
                pub unsafe fn new() -> Self {
                    let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
                    YieldingIdleStrategy_YieldingIdleStrategy(__bindgen_tmp.as_mut_ptr());
                    __bindgen_tmp.assume_init()
                }
            }
        }
        #[repr(C)]
        pub struct LogBuffers {
            pub m_memoryMappedFiles: root::aeron::util::MemoryMappedFile_ptr_t,
            pub m_buffers: [root::aeron::concurrent::AtomicBuffer; 4usize],
        }
        #[test]
        fn bindgen_test_layout_LogBuffers() {
            const UNINIT: ::std::mem::MaybeUninit<LogBuffers> = ::std::mem::MaybeUninit::uninit();
            let ptr = UNINIT.as_ptr();
            assert_eq!(
                ::std::mem::size_of::<LogBuffers>(),
                80usize,
                concat!("Size of: ", stringify!(LogBuffers))
            );
            assert_eq!(
                ::std::mem::align_of::<LogBuffers>(),
                8usize,
                concat!("Alignment of ", stringify!(LogBuffers))
            );
            assert_eq!(
                unsafe { ::std::ptr::addr_of!((*ptr).m_memoryMappedFiles) as usize - ptr as usize },
                0usize,
                concat!(
                    "Offset of field: ",
                    stringify!(LogBuffers),
                    "::",
                    stringify!(m_memoryMappedFiles)
                )
            );
            assert_eq!(
                unsafe { ::std::ptr::addr_of!((*ptr).m_buffers) as usize - ptr as usize },
                16usize,
                concat!(
                    "Offset of field: ",
                    stringify!(LogBuffers),
                    "::",
                    stringify!(m_buffers)
                )
            );
        }
        extern "C" {
            #[link_name = "\u{1}_ZN5aeron10LogBuffers12atomicBufferEi"]
            pub fn LogBuffers_atomicBuffer(
                this: *mut root::aeron::LogBuffers,
                index: ::std::os::raw::c_int,
            ) -> *mut root::aeron::concurrent::AtomicBuffer;
        }
        extern "C" {
            #[link_name = "\u{1}_ZN5aeron10LogBuffersC1EPKcb"]
            pub fn LogBuffers_LogBuffers(
                this: *mut root::aeron::LogBuffers,
                filename: *const ::std::os::raw::c_char,
                preTouch: bool,
            );
        }
        extern "C" {
            #[link_name = "\u{1}_ZN5aeron10LogBuffersC1EPhli"]
            pub fn LogBuffers_LogBuffers1(
                this: *mut root::aeron::LogBuffers,
                address: *mut ::std::os::raw::c_uchar,
                logLength: ::std::os::raw::c_long,
                termLength: ::std::os::raw::c_int,
            );
        }
        extern "C" {
            #[link_name = "\u{1}_ZN5aeron10LogBuffersD1Ev"]
            pub fn LogBuffers_LogBuffers_destructor(this: *mut root::aeron::LogBuffers);
        }
        impl LogBuffers {
            #[inline]
            pub unsafe fn atomicBuffer(
                &mut self,
                index: ::std::os::raw::c_int,
            ) -> *mut root::aeron::concurrent::AtomicBuffer {
                LogBuffers_atomicBuffer(self, index)
            }
            #[inline]
            pub unsafe fn new(filename: *const ::std::os::raw::c_char, preTouch: bool) -> Self {
                let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
                LogBuffers_LogBuffers(__bindgen_tmp.as_mut_ptr(), filename, preTouch);
                __bindgen_tmp.assume_init()
            }
            #[inline]
            pub unsafe fn new1(
                address: *mut ::std::os::raw::c_uchar,
                logLength: ::std::os::raw::c_long,
                termLength: ::std::os::raw::c_int,
            ) -> Self {
                let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
                LogBuffers_LogBuffers1(__bindgen_tmp.as_mut_ptr(), address, logLength, termLength);
                __bindgen_tmp.assume_init()
            }
            #[inline]
            pub unsafe fn destruct(&mut self) {
                LogBuffers_LogBuffers_destructor(self)
            }
        }
        pub type on_reserved_value_supplier_t = [u64; 4usize];
        #[repr(C)]
        pub struct Publication {
            pub m_conductor: *mut root::aeron::ClientConductor,
            pub m_logMetaDataBuffer: *mut root::aeron::concurrent::AtomicBuffer,
            pub m_channel: root::std::string,
            pub m_registrationId: ::std::os::raw::c_long,
            pub m_originalRegistrationId: ::std::os::raw::c_long,
            pub m_maxPossiblePosition: ::std::os::raw::c_long,
            pub m_streamId: ::std::os::raw::c_int,
            pub m_sessionId: ::std::os::raw::c_int,
            pub m_initialTermId: ::std::os::raw::c_int,
            pub m_maxPayloadLength: ::std::os::raw::c_int,
            pub m_maxMessageLength: ::std::os::raw::c_int,
            pub m_positionBitsToShift: ::std::os::raw::c_int,
            pub m_publicationLimit: root::aeron::concurrent::status::ReadablePosition<
                root::aeron::concurrent::status::UnsafeBufferPosition,
            >,
            pub m_channelStatusId: ::std::os::raw::c_int,
            pub m_isClosed: u8,
            pub m_logBuffers: [u64; 2usize],
            pub m_headerWriter: root::aeron::concurrent::logbuffer::HeaderWriter,
        }
        #[test]
        fn bindgen_test_layout_Publication() {
            const UNINIT: ::std::mem::MaybeUninit<Publication> = ::std::mem::MaybeUninit::uninit();
            let ptr = UNINIT.as_ptr();
            assert_eq!(
                ::std::mem::size_of::<Publication>(),
                152usize,
                concat!("Size of: ", stringify!(Publication))
            );
            assert_eq!(
                ::std::mem::align_of::<Publication>(),
                8usize,
                concat!("Alignment of ", stringify!(Publication))
            );
            assert_eq!(
                unsafe { ::std::ptr::addr_of!((*ptr).m_conductor) as usize - ptr as usize },
                0usize,
                concat!(
                    "Offset of field: ",
                    stringify!(Publication),
                    "::",
                    stringify!(m_conductor)
                )
            );
            assert_eq!(
                unsafe { ::std::ptr::addr_of!((*ptr).m_logMetaDataBuffer) as usize - ptr as usize },
                8usize,
                concat!(
                    "Offset of field: ",
                    stringify!(Publication),
                    "::",
                    stringify!(m_logMetaDataBuffer)
                )
            );
            assert_eq!(
                unsafe { ::std::ptr::addr_of!((*ptr).m_channel) as usize - ptr as usize },
                16usize,
                concat!(
                    "Offset of field: ",
                    stringify!(Publication),
                    "::",
                    stringify!(m_channel)
                )
            );
            assert_eq!(
                unsafe { ::std::ptr::addr_of!((*ptr).m_registrationId) as usize - ptr as usize },
                48usize,
                concat!(
                    "Offset of field: ",
                    stringify!(Publication),
                    "::",
                    stringify!(m_registrationId)
                )
            );
            assert_eq!(
                unsafe {
                    ::std::ptr::addr_of!((*ptr).m_originalRegistrationId) as usize - ptr as usize
                },
                56usize,
                concat!(
                    "Offset of field: ",
                    stringify!(Publication),
                    "::",
                    stringify!(m_originalRegistrationId)
                )
            );
            assert_eq!(
                unsafe {
                    ::std::ptr::addr_of!((*ptr).m_maxPossiblePosition) as usize - ptr as usize
                },
                64usize,
                concat!(
                    "Offset of field: ",
                    stringify!(Publication),
                    "::",
                    stringify!(m_maxPossiblePosition)
                )
            );
            assert_eq!(
                unsafe { ::std::ptr::addr_of!((*ptr).m_streamId) as usize - ptr as usize },
                72usize,
                concat!(
                    "Offset of field: ",
                    stringify!(Publication),
                    "::",
                    stringify!(m_streamId)
                )
            );
            assert_eq!(
                unsafe { ::std::ptr::addr_of!((*ptr).m_sessionId) as usize - ptr as usize },
                76usize,
                concat!(
                    "Offset of field: ",
                    stringify!(Publication),
                    "::",
                    stringify!(m_sessionId)
                )
            );
            assert_eq!(
                unsafe { ::std::ptr::addr_of!((*ptr).m_initialTermId) as usize - ptr as usize },
                80usize,
                concat!(
                    "Offset of field: ",
                    stringify!(Publication),
                    "::",
                    stringify!(m_initialTermId)
                )
            );
            assert_eq!(
                unsafe { ::std::ptr::addr_of!((*ptr).m_maxPayloadLength) as usize - ptr as usize },
                84usize,
                concat!(
                    "Offset of field: ",
                    stringify!(Publication),
                    "::",
                    stringify!(m_maxPayloadLength)
                )
            );
            assert_eq!(
                unsafe { ::std::ptr::addr_of!((*ptr).m_maxMessageLength) as usize - ptr as usize },
                88usize,
                concat!(
                    "Offset of field: ",
                    stringify!(Publication),
                    "::",
                    stringify!(m_maxMessageLength)
                )
            );
            assert_eq!(
                unsafe {
                    ::std::ptr::addr_of!((*ptr).m_positionBitsToShift) as usize - ptr as usize
                },
                92usize,
                concat!(
                    "Offset of field: ",
                    stringify!(Publication),
                    "::",
                    stringify!(m_positionBitsToShift)
                )
            );
            assert_eq!(
                unsafe { ::std::ptr::addr_of!((*ptr).m_publicationLimit) as usize - ptr as usize },
                96usize,
                concat!(
                    "Offset of field: ",
                    stringify!(Publication),
                    "::",
                    stringify!(m_publicationLimit)
                )
            );
            assert_eq!(
                unsafe { ::std::ptr::addr_of!((*ptr).m_channelStatusId) as usize - ptr as usize },
                120usize,
                concat!(
                    "Offset of field: ",
                    stringify!(Publication),
                    "::",
                    stringify!(m_channelStatusId)
                )
            );
            assert_eq!(
                unsafe { ::std::ptr::addr_of!((*ptr).m_isClosed) as usize - ptr as usize },
                124usize,
                concat!(
                    "Offset of field: ",
                    stringify!(Publication),
                    "::",
                    stringify!(m_isClosed)
                )
            );
            assert_eq!(
                unsafe { ::std::ptr::addr_of!((*ptr).m_logBuffers) as usize - ptr as usize },
                128usize,
                concat!(
                    "Offset of field: ",
                    stringify!(Publication),
                    "::",
                    stringify!(m_logBuffers)
                )
            );
            assert_eq!(
                unsafe { ::std::ptr::addr_of!((*ptr).m_headerWriter) as usize - ptr as usize },
                144usize,
                concat!(
                    "Offset of field: ",
                    stringify!(Publication),
                    "::",
                    stringify!(m_headerWriter)
                )
            );
        }
        extern "C" {
            #[link_name = "\u{1}_ZNK5aeron11Publication7channelB5cxx11Ev"]
            pub fn Publication_channel(
                this: *const root::aeron::Publication,
            ) -> *const root::std::string;
        }
        extern "C" {
            #[link_name = "\u{1}_ZNK5aeron11Publication8streamIdEv"]
            pub fn Publication_streamId(
                this: *const root::aeron::Publication,
            ) -> ::std::os::raw::c_int;
        }
        extern "C" {
            #[link_name = "\u{1}_ZNK5aeron11Publication9sessionIdEv"]
            pub fn Publication_sessionId(
                this: *const root::aeron::Publication,
            ) -> ::std::os::raw::c_int;
        }
        extern "C" {
            #[link_name = "\u{1}_ZNK5aeron11Publication13initialTermIdEv"]
            pub fn Publication_initialTermId(
                this: *const root::aeron::Publication,
            ) -> ::std::os::raw::c_int;
        }
        extern "C" {
            #[link_name = "\u{1}_ZNK5aeron11Publication22originalRegistrationIdEv"]
            pub fn Publication_originalRegistrationId(
                this: *const root::aeron::Publication,
            ) -> ::std::os::raw::c_long;
        }
        extern "C" {
            #[link_name = "\u{1}_ZNK5aeron11Publication14registrationIdEv"]
            pub fn Publication_registrationId(
                this: *const root::aeron::Publication,
            ) -> ::std::os::raw::c_long;
        }
        extern "C" {
            #[link_name = "\u{1}_ZNK5aeron11Publication10isOriginalEv"]
            pub fn Publication_isOriginal(this: *const root::aeron::Publication) -> bool;
        }
        extern "C" {
            #[link_name = "\u{1}_ZNK5aeron11Publication16maxMessageLengthEv"]
            pub fn Publication_maxMessageLength(
                this: *const root::aeron::Publication,
            ) -> root::aeron::util::index_t;
        }
        extern "C" {
            #[link_name = "\u{1}_ZNK5aeron11Publication16maxPayloadLengthEv"]
            pub fn Publication_maxPayloadLength(
                this: *const root::aeron::Publication,
            ) -> root::aeron::util::index_t;
        }
        extern "C" {
            #[link_name = "\u{1}_ZNK5aeron11Publication16termBufferLengthEv"]
            pub fn Publication_termBufferLength(
                this: *const root::aeron::Publication,
            ) -> ::std::os::raw::c_int;
        }
        extern "C" {
            #[link_name = "\u{1}_ZNK5aeron11Publication19positionBitsToShiftEv"]
            pub fn Publication_positionBitsToShift(
                this: *const root::aeron::Publication,
            ) -> ::std::os::raw::c_int;
        }
        extern "C" {
            #[link_name = "\u{1}_ZNK5aeron11Publication11isConnectedEv"]
            pub fn Publication_isConnected(this: *const root::aeron::Publication) -> bool;
        }
        extern "C" {
            #[link_name = "\u{1}_ZNK5aeron11Publication8isClosedEv"]
            pub fn Publication_isClosed(this: *const root::aeron::Publication) -> bool;
        }
        extern "C" {
            #[link_name = "\u{1}_ZNK5aeron11Publication19maxPossiblePositionEv"]
            pub fn Publication_maxPossiblePosition(
                this: *const root::aeron::Publication,
            ) -> ::std::os::raw::c_long;
        }
        extern "C" {
            #[link_name = "\u{1}_ZNK5aeron11Publication8positionEv"]
            pub fn Publication_position(
                this: *const root::aeron::Publication,
            ) -> ::std::os::raw::c_long;
        }
        extern "C" {
            #[link_name = "\u{1}_ZNK5aeron11Publication16publicationLimitEv"]
            pub fn Publication_publicationLimit(
                this: *const root::aeron::Publication,
            ) -> ::std::os::raw::c_long;
        }
        extern "C" {
            #[link_name = "\u{1}_ZNK5aeron11Publication18publicationLimitIdEv"]
            pub fn Publication_publicationLimitId(
                this: *const root::aeron::Publication,
            ) -> ::std::os::raw::c_int;
        }
        extern "C" {
            #[link_name = "\u{1}_ZNK5aeron11Publication15availableWindowEv"]
            pub fn Publication_availableWindow(
                this: *const root::aeron::Publication,
            ) -> ::std::os::raw::c_long;
        }
        extern "C" {
            #[link_name = "\u{1}_ZNK5aeron11Publication15channelStatusIdEv"]
            pub fn Publication_channelStatusId(
                this: *const root::aeron::Publication,
            ) -> ::std::os::raw::c_int;
        }
        extern "C" {
            #[link_name = "\u{1}_ZNK5aeron11Publication13channelStatusEv"]
            pub fn Publication_channelStatus(
                this: *const root::aeron::Publication,
            ) -> ::std::os::raw::c_long;
        }
        extern "C" {
