/* automatically generated by rust-bindgen 0.66.1 */

pub const AERON_NULL_VALUE: i32 = -1;
pub const AERON_CLIENT_ERROR_DRIVER_TIMEOUT: i32 = -1000;
pub const AERON_CLIENT_ERROR_CLIENT_TIMEOUT: i32 = -1001;
pub const AERON_CLIENT_ERROR_CONDUCTOR_SERVICE_TIMEOUT: i32 = -1002;
pub const AERON_CLIENT_ERROR_BUFFER_FULL: i32 = -1003;
pub const AERON_CLIENT_MAX_LOCAL_ADDRESS_STR_LEN: u32 = 64;
pub const AERON_DIR_ENV_VAR: &[u8; 10] = b"AERON_DIR\0";
pub const AERON_DRIVER_TIMEOUT_ENV_VAR: &[u8; 21] = b"AERON_DRIVER_TIMEOUT\0";
pub const AERON_CLIENT_RESOURCE_LINGER_DURATION_ENV_VAR: &[u8; 38] =
    b"AERON_CLIENT_RESOURCE_LINGER_DURATION\0";
pub const AERON_CLIENT_PRE_TOUCH_MAPPED_MEMORY_ENV_VAR: &[u8; 37] =
    b"AERON_CLIENT_PRE_TOUCH_MAPPED_MEMORY\0";
pub const AERON_AGENT_ON_START_FUNCTION_ENV_VAR: &[u8; 30] = b"AERON_AGENT_ON_START_FUNCTION\0";
pub const AERON_COUNTER_CACHE_LINE_LENGTH: u32 = 64;
pub const AERON_COUNTER_RECORD_UNUSED: u32 = 0;
pub const AERON_COUNTER_RECORD_ALLOCATED: u32 = 1;
pub const AERON_COUNTER_RECORD_RECLAIMED: i32 = -1;
pub const AERON_NULL_COUNTER_ID: i32 = -1;
pub const AERON_PUBLICATION_NOT_CONNECTED: i32 = -1;
pub const AERON_PUBLICATION_BACK_PRESSURED: i32 = -2;
pub const AERON_PUBLICATION_ADMIN_ACTION: i32 = -3;
pub const AERON_PUBLICATION_CLOSED: i32 = -4;
pub const AERON_PUBLICATION_MAX_POSITION_EXCEEDED: i32 = -5;
pub const AERON_PUBLICATION_ERROR: i32 = -6;
pub const AERON_COMPILER_GCC: u32 = 1;
pub const AERON_COMPILER_LLVM: u32 = 1;

pub const AERON_NAME_RESOLVER_CSV_TABLE_ARGS_ENV_VAR: &[u8; 42] =
    b"AERON_NAME_RESOLVER_CSV_LOOKUP_TABLE_ARGS\0";
pub const AERON_UDP_CHANNEL_RESERVED_VALUE_OFFSET: i32 = -8;
pub const AERON_UDP_CHANNEL_TRANSPORT_MEDIA_RCV_TIMESTAMP_NONE: u32 = 0;
pub const AERON_UDP_CHANNEL_TRANSPORT_MEDIA_RCV_TIMESTAMP_HW: u32 = 1;
pub const AERON_UDP_CHANNEL_TRANSPORT_MEDIA_RCV_TIMESTAMP_SW: u32 = 2;
pub const AERON_UDP_CHANNEL_TRANSPORT_MEDIA_RCV_TIMESTAMP: u32 = 3;
pub const AERON_UDP_CHANNEL_TRANSPORT_CHANNEL_RCV_TIMESTAMP: u32 = 4;
pub const AERON_UDP_CHANNEL_TRANSPORT_CHANNEL_SND_TIMESTAMP: u32 = 8;
pub const AERON_UDP_DESTINATION_TRACKER_DESTINATION_TIMEOUT_NS: u64 = 5000000000;
pub const AERON_SEND_CHANNEL_ENDPOINT_DESTINATION_TIMEOUT_NS: u64 = 5000000000;
pub const AERON_RECEIVE_DESTINATION_TIMEOUT_NS: u64 = 5000000000;
pub const AERON_LOSS_DETECTOR_TIMER_INACTIVE: i32 = -1;
pub const AERON_LOSS_DETECTOR_NAK_UNICAST_DELAY_NS: u32 = 60000000;
pub const AERON_LOSS_DETECTOR_NAK_MULTICAST_GROUP_SIZE: f64 = 10.0;
pub const AERON_LOSS_DETECTOR_NAK_MULTICAST_MAX_BACKOFF_NS: f64 = 60000000.0;
pub const AERON_LOSS_REPORT_FILE: &[u8; 16] = b"loss-report.dat\0";
pub const AERON_LOSS_REPORTER_ENTRY_ALIGNMENT: u32 = 64;
pub const AERON_IMAGE_SM_EOS_MULTIPLE: u32 = 5;
pub const AERON_DRIVER_CONDUCTOR_LINGER_RESOURCE_TIMEOUT_NS: u64 = 5000000000;
pub const AERON_DRIVER_CONDUCTOR_CLOCK_UPDATE_INTERNAL_NS: u32 = 1000000;
pub const AERON_UDP_TRANSPORT_POLLER_ITERATION_THRESHOLD: u32 = 5;
pub const AERON_DRIVER_RECEIVER_PENDING_SETUP_TIMEOUT_NS: u32 = 1000000000;
pub const AERON_AGENT_RUNNER_CONDUCTOR: u32 = 0;
pub const AERON_AGENT_RUNNER_SENDER: u32 = 1;
pub const AERON_AGENT_RUNNER_RECEIVER: u32 = 2;
pub const AERON_AGENT_RUNNER_SHARED_NETWORK: u32 = 1;
pub const AERON_AGENT_RUNNER_SHARED: u32 = 0;
pub const AERON_AGENT_RUNNER_MAX: u32 = 3;
extern "C" {
    pub fn aeron_alloc_no_err(
        ptr: *mut *mut ::std::os::raw::c_void,
        size: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn aeron_alloc(ptr: *mut *mut ::std::os::raw::c_void, size: usize)
        -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn aeron_alloc_aligned(
        ptr: *mut *mut ::std::os::raw::c_void,
        offset: *mut usize,
        size: usize,
        alignment: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn aeron_reallocf(
        ptr: *mut *mut ::std::os::raw::c_void,
        size: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn aeron_free(ptr: *mut ::std::os::raw::c_void);
}
pub type __time_t = ::std::os::raw::c_long;
pub type __syscall_slong_t = ::std::os::raw::c_long;
pub type __socklen_t = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct timespec {
    pub tv_sec: __time_t,
    pub tv_nsec: __syscall_slong_t,
}
#[test]
fn bindgen_test_layout_timespec() {
    const UNINIT: ::std::mem::MaybeUninit<timespec> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<timespec>(),
        16usize,
        concat!("Size of: ", stringify!(timespec))
    );
    assert_eq!(
        ::std::mem::align_of::<timespec>(),
        8usize,
        concat!("Alignment of ", stringify!(timespec))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tv_sec) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(timespec),
            "::",
            stringify!(tv_sec)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tv_nsec) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(timespec),
            "::",
            stringify!(tv_nsec)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct __pthread_internal_list {
    pub __prev: *mut __pthread_internal_list,
    pub __next: *mut __pthread_internal_list,
}
#[test]
fn bindgen_test_layout___pthread_internal_list() {
    const UNINIT: ::std::mem::MaybeUninit<__pthread_internal_list> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__pthread_internal_list>(),
        16usize,
        concat!("Size of: ", stringify!(__pthread_internal_list))
    );
    assert_eq!(
        ::std::mem::align_of::<__pthread_internal_list>(),
        8usize,
        concat!("Alignment of ", stringify!(__pthread_internal_list))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__prev) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_internal_list),
            "::",
            stringify!(__prev)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__next) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_internal_list),
            "::",
            stringify!(__next)
        )
    );
}
pub type __pthread_list_t = __pthread_internal_list;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct __pthread_mutex_s {
    pub __lock: ::std::os::raw::c_int,
    pub __count: ::std::os::raw::c_uint,
    pub __owner: ::std::os::raw::c_int,
    pub __nusers: ::std::os::raw::c_uint,
    pub __kind: ::std::os::raw::c_int,
    pub __spins: ::std::os::raw::c_short,
    pub __elision: ::std::os::raw::c_short,
    pub __list: __pthread_list_t,
}
#[test]
fn bindgen_test_layout___pthread_mutex_s() {
    const UNINIT: ::std::mem::MaybeUninit<__pthread_mutex_s> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__pthread_mutex_s>(),
        40usize,
        concat!("Size of: ", stringify!(__pthread_mutex_s))
    );
    assert_eq!(
        ::std::mem::align_of::<__pthread_mutex_s>(),
        8usize,
        concat!("Alignment of ", stringify!(__pthread_mutex_s))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__lock) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__lock)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__count) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__count)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__owner) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__owner)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__nusers) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__nusers)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__kind) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__kind)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__spins) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__spins)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__elision) as usize - ptr as usize },
        22usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__elision)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__list) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__list)
        )
    );
}
pub type pthread_t = ::std::os::raw::c_ulong;
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_mutex_t {
    pub __data: __pthread_mutex_s,
    pub __size: [::std::os::raw::c_char; 40usize],
    pub __align: ::std::os::raw::c_long,
}
#[test]
fn bindgen_test_layout_pthread_mutex_t() {
    const UNINIT: ::std::mem::MaybeUninit<pthread_mutex_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<pthread_mutex_t>(),
        40usize,
        concat!("Size of: ", stringify!(pthread_mutex_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_mutex_t>(),
        8usize,
        concat!("Alignment of ", stringify!(pthread_mutex_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__data) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_mutex_t),
            "::",
            stringify!(__data)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__size) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_mutex_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__align) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_mutex_t),
            "::",
            stringify!(__align)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct aeron_context_stct {
    _unused: [u8; 0],
}
pub type aeron_context_t = aeron_context_stct;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct aeron_stct {
    _unused: [u8; 0],
}
pub type aeron_t = aeron_stct;
#[doc = " Structure used to hold information for a try_claim function call."]
pub type aeron_buffer_claim_t = aeron_buffer_claim_stct;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct aeron_publication_stct {
    _unused: [u8; 0],
}
pub type aeron_publication_t = aeron_publication_stct;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct aeron_exclusive_publication_stct {
    _unused: [u8; 0],
}
pub type aeron_exclusive_publication_t = aeron_exclusive_publication_stct;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct aeron_header_stct {
    _unused: [u8; 0],
}
pub type aeron_header_t = aeron_header_stct;
#[repr(C, packed(4))]
#[derive(Copy, Clone)]
pub struct aeron_header_values_frame_stct {
    pub frame_length: i32,
    pub version: i8,
    pub flags: u8,
    pub type_: i16,
    pub term_offset: i32,
    pub session_id: i32,
    pub stream_id: i32,
    pub term_id: i32,
    pub reserved_value: i64,
}
#[test]
fn bindgen_test_layout_aeron_header_values_frame_stct() {
    const UNINIT: ::std::mem::MaybeUninit<aeron_header_values_frame_stct> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<aeron_header_values_frame_stct>(),
        32usize,
        concat!("Size of: ", stringify!(aeron_header_values_frame_stct))
    );
    assert_eq!(
        ::std::mem::align_of::<aeron_header_values_frame_stct>(),
        4usize,
        concat!("Alignment of ", stringify!(aeron_header_values_frame_stct))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).frame_length) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(aeron_header_values_frame_stct),
            "::",
            stringify!(frame_length)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).version) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(aeron_header_values_frame_stct),
            "::",
            stringify!(version)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).flags) as usize - ptr as usize },
        5usize,
        concat!(
            "Offset of field: ",
            stringify!(aeron_header_values_frame_stct),
            "::",
            stringify!(flags)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(aeron_header_values_frame_stct),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).term_offset) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(aeron_header_values_frame_stct),
            "::",
            stringify!(term_offset)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).session_id) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(aeron_header_values_frame_stct),
            "::",
            stringify!(session_id)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).stream_id) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(aeron_header_values_frame_stct),
            "::",
            stringify!(stream_id)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).term_id) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(aeron_header_values_frame_stct),
            "::",
            stringify!(term_id)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).reserved_value) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(aeron_header_values_frame_stct),
            "::",
            stringify!(reserved_value)
        )
    );
}
pub type aeron_header_values_frame_t = aeron_header_values_frame_stct;
#[repr(C, packed(4))]
#[derive(Copy, Clone)]
pub struct aeron_header_values_stct {
    pub frame: aeron_header_values_frame_t,
    pub initial_term_id: i32,
    pub position_bits_to_shift: usize,
}
#[test]
fn bindgen_test_layout_aeron_header_values_stct() {
    const UNINIT: ::std::mem::MaybeUninit<aeron_header_values_stct> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<aeron_header_values_stct>(),
        44usize,
        concat!("Size of: ", stringify!(aeron_header_values_stct))
    );
    assert_eq!(
        ::std::mem::align_of::<aeron_header_values_stct>(),
        4usize,
        concat!("Alignment of ", stringify!(aeron_header_values_stct))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).frame) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(aeron_header_values_stct),
            "::",
            stringify!(frame)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).initial_term_id) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(aeron_header_values_stct),
            "::",
            stringify!(initial_term_id)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).position_bits_to_shift) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(aeron_header_values_stct),
            "::",
            stringify!(position_bits_to_shift)
        )
    );
}
pub type aeron_header_values_t = aeron_header_values_stct;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct aeron_subscription_stct {
    _unused: [u8; 0],
}
pub type aeron_subscription_t = aeron_subscription_stct;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct aeron_image_stct {
    _unused: [u8; 0],
}
pub type aeron_image_t = aeron_image_stct;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct aeron_counter_stct {
    _unused: [u8; 0],
}
pub type aeron_counter_t = aeron_counter_stct;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct aeron_log_buffer_stct {
    _unused: [u8; 0],
}
pub type aeron_log_buffer_t = aeron_log_buffer_stct;
pub type aeron_counters_reader_t = aeron_counters_reader_stct;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct aeron_client_registering_resource_stct {
    _unused: [u8; 0],
}
pub type aeron_async_add_publication_t = aeron_client_registering_resource_stct;
pub type aeron_async_add_exclusive_publication_t = aeron_client_registering_resource_stct;
pub type aeron_async_add_subscription_t = aeron_client_registering_resource_stct;
pub type aeron_async_add_counter_t = aeron_client_registering_resource_stct;
pub type aeron_async_destination_t = aeron_client_registering_resource_stct;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct aeron_image_fragment_assembler_stct {
    _unused: [u8; 0],
}
pub type aeron_image_fragment_assembler_t = aeron_image_fragment_assembler_stct;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct aeron_image_controlled_fragment_assembler_stct {
    _unused: [u8; 0],
}
pub type aeron_image_controlled_fragment_assembler_t =
    aeron_image_controlled_fragment_assembler_stct;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct aeron_fragment_assembler_stct {
    _unused: [u8; 0],
}
pub type aeron_fragment_assembler_t = aeron_fragment_assembler_stct;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct aeron_controlled_fragment_assembler_stct {
    _unused: [u8; 0],
}
pub type aeron_controlled_fragment_assembler_t = aeron_controlled_fragment_assembler_stct;
extern "C" {
    pub fn aeron_context_set_dir(
        context: *mut aeron_context_t,
        value: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn aeron_context_get_dir(context: *mut aeron_context_t) -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn aeron_context_set_driver_timeout_ms(
        context: *mut aeron_context_t,
        value: u64,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn aeron_context_get_driver_timeout_ms(context: *mut aeron_context_t) -> u64;
}
extern "C" {
    pub fn aeron_context_set_keepalive_interval_ns(
        context: *mut aeron_context_t,
        value: u64,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn aeron_context_get_keepalive_interval_ns(context: *mut aeron_context_t) -> u64;
}
extern "C" {
    pub fn aeron_context_set_resource_linger_duration_ns(
        context: *mut aeron_context_t,
        value: u64,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn aeron_context_get_resource_linger_duration_ns(context: *mut aeron_context_t) -> u64;
}
extern "C" {
    pub fn aeron_context_set_pre_touch_mapped_memory(
        context: *mut aeron_context_t,
        value: bool,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn aeron_context_get_pre_touch_mapped_memory(context: *mut aeron_context_t) -> bool;
}
#[doc = " The error handler to be called when an error occurs."]
pub type aeron_error_handler_t = ::std::option::Option<
    unsafe extern "C" fn(
        clientd: *mut ::std::os::raw::c_void,
        errcode: ::std::os::raw::c_int,
        message: *const ::std::os::raw::c_char,
    ),
>;
#[doc = " Generalised notification callback."]
pub type aeron_notification_t =
    ::std::option::Option<unsafe extern "C" fn(clientd: *mut ::std::os::raw::c_void)>;
extern "C" {
    pub fn aeron_context_set_error_handler(
        context: *mut aeron_context_t,
        handler: aeron_error_handler_t,
        clientd: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn aeron_context_get_error_handler(context: *mut aeron_context_t) -> aeron_error_handler_t;
}
extern "C" {
    pub fn aeron_context_get_error_handler_clientd(
        context: *mut aeron_context_t,
    ) -> *mut ::std::os::raw::c_void;
}
#[doc = " Function called by aeron_client_t to deliver notification that the media driver has added an aeron_publication_t\n or aeron_exclusive_publication_t successfully.\n\n Implementations should do the minimum work for passing off state to another thread for later processing.\n\n @param clientd to be returned in the call\n @param async associated with the original add publication call\n @param channel of the publication\n @param stream_id within the channel of the publication\n @param session_id of the publication\n @param correlation_id used by the publication"]
pub type aeron_on_new_publication_t = ::std::option::Option<
    unsafe extern "C" fn(
        clientd: *mut ::std::os::raw::c_void,
        async_: *mut aeron_async_add_publication_t,
        channel: *const ::std::os::raw::c_char,
        stream_id: i32,
        session_id: i32,
        correlation_id: i64,
    ),
>;
extern "C" {
    pub fn aeron_context_set_on_new_publication(
        context: *mut aeron_context_t,
        handler: aeron_on_new_publication_t,
        clientd: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn aeron_context_get_on_new_publication(
        context: *mut aeron_context_t,
    ) -> aeron_on_new_publication_t;
}
extern "C" {
    pub fn aeron_context_get_on_new_publication_clientd(
        context: *mut aeron_context_t,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn aeron_context_set_on_new_exclusive_publication(
        context: *mut aeron_context_t,
        handler: aeron_on_new_publication_t,
        clientd: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn aeron_context_get_on_new_exclusive_publication(
        context: *mut aeron_context_t,
    ) -> aeron_on_new_publication_t;
}
extern "C" {
    pub fn aeron_context_get_on_new_exclusive_publication_clientd(
        context: *mut aeron_context_t,
    ) -> *mut ::std::os::raw::c_void;
}
#[doc = " Function called by aeron_client_t to deliver notification that the media driver has added an aeron_subscription_t\n successfully.\n\n Implementations should do the minimum work for handing off state to another thread for later processing.\n\n @param clientd to be returned in the call\n @param async associated with the original aeron_add_async_subscription call\n @param channel of the subscription\n @param stream_id within the channel of the subscription\n @param session_id of the subscription\n @param correlation_id used by the subscription"]
pub type aeron_on_new_subscription_t = ::std::option::Option<
    unsafe extern "C" fn(
        clientd: *mut ::std::os::raw::c_void,
        async_: *mut aeron_async_add_subscription_t,
        channel: *const ::std::os::raw::c_char,
        stream_id: i32,
        correlation_id: i64,
    ),
>;
extern "C" {
    pub fn aeron_context_set_on_new_subscription(
        context: *mut aeron_context_t,
        handler: aeron_on_new_subscription_t,
        clientd: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn aeron_context_get_on_new_subscription(
        context: *mut aeron_context_t,
    ) -> aeron_on_new_subscription_t;
}
extern "C" {
    pub fn aeron_context_get_on_new_subscription_clientd(
        context: *mut aeron_context_t,
    ) -> *mut ::std::os::raw::c_void;
}
#[doc = " Function called by aeron_client_t to deliver notifications that an aeron_image_t was added.\n\n @param clientd to be returned in the call.\n @param subscription that image is part of.\n @param image that has become available."]
pub type aeron_on_available_image_t = ::std::option::Option<
    unsafe extern "C" fn(
        clientd: *mut ::std::os::raw::c_void,
        subscription: *mut aeron_subscription_t,
        image: *mut aeron_image_t,
    ),
>;
#[doc = " Function called by aeron_client_t to deliver notifications that an aeron_image_t has been removed from use and\n should not be used any longer.\n\n @param clientd to be returned in the call.\n @param subscription that image is part of.\n @param image that has become unavailable."]
pub type aeron_on_unavailable_image_t = ::std::option::Option<
    unsafe extern "C" fn(
        clientd: *mut ::std::os::raw::c_void,
        subscription: *mut aeron_subscription_t,
        image: *mut aeron_image_t,
    ),
>;
#[doc = " Function called by aeron_client_t to deliver notifications that a counter has been added to the driver.\n\n @param clientd to be returned in the call.\n @param counters_reader that holds the counter.\n @param registration_id of the counter.\n @param counter_id of the counter."]
pub type aeron_on_available_counter_t = ::std::option::Option<
    unsafe extern "C" fn(
        clientd: *mut ::std::os::raw::c_void,
        counters_reader: *mut aeron_counters_reader_t,
        registration_id: i64,
        counter_id: i32,
    ),
>;
extern "C" {
    pub fn aeron_context_set_on_available_counter(
        context: *mut aeron_context_t,
        handler: aeron_on_available_counter_t,
        clientd: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn aeron_context_get_on_available_counter(
        context: *mut aeron_context_t,
    ) -> aeron_on_available_counter_t;
}
extern "C" {
    pub fn aeron_context_get_on_available_counter_clientd(
        context: *mut aeron_context_t,
    ) -> *mut ::std::os::raw::c_void;
}
#[doc = " Function called by aeron_client_t to deliver notifications that a counter has been removed from the driver.\n\n @param clientd to be returned in the call.\n @param counters_reader that holds the counter.\n @param registration_id of the counter.\n @param counter_id of the counter."]
pub type aeron_on_unavailable_counter_t = ::std::option::Option<
    unsafe extern "C" fn(
        clientd: *mut ::std::os::raw::c_void,
        counters_reader: *mut aeron_counters_reader_t,
        registration_id: i64,
        counter_id: i32,
    ),
>;
extern "C" {
    pub fn aeron_context_set_on_unavailable_counter(
        context: *mut aeron_context_t,
        handler: aeron_on_unavailable_counter_t,
        clientd: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn aeron_context_get_on_unavailable_counter(
        context: *mut aeron_context_t,
    ) -> aeron_on_unavailable_counter_t;
}
extern "C" {
    pub fn aeron_context_get_on_unavailable_counter_clientd(
        context: *mut aeron_context_t,
    ) -> *mut ::std::os::raw::c_void;
}
#[doc = " Function called by aeron_client_t to deliver notifications that the client is closing.\n\n @param clientd to be returned in the call."]
pub type aeron_on_close_client_t =
    ::std::option::Option<unsafe extern "C" fn(clientd: *mut ::std::os::raw::c_void)>;
extern "C" {
    pub fn aeron_context_set_on_close_client(
        context: *mut aeron_context_t,
        handler: aeron_on_close_client_t,
        clientd: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn aeron_context_get_on_close_client(
        context: *mut aeron_context_t,
    ) -> aeron_on_close_client_t;
}
extern "C" {
    pub fn aeron_context_get_on_close_client_clientd(
        context: *mut aeron_context_t,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    #[doc = " Whether to use an invoker to control the conductor agent or spawn a thread."]
    pub fn aeron_context_set_use_conductor_agent_invoker(
        context: *mut aeron_context_t,
        value: bool,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn aeron_context_get_use_conductor_agent_invoker(context: *mut aeron_context_t) -> bool;
}
pub type aeron_agent_on_start_func_t = ::std::option::Option<
    unsafe extern "C" fn(
        state: *mut ::std::os::raw::c_void,
        role_name: *const ::std::os::raw::c_char,
    ),
>;
extern "C" {
    pub fn aeron_context_set_agent_on_start_function(
        context: *mut aeron_context_t,
        value: aeron_agent_on_start_func_t,
        state: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn aeron_context_get_agent_on_start_function(
        context: *mut aeron_context_t,
    ) -> aeron_agent_on_start_func_t;
}
extern "C" {
    pub fn aeron_context_get_agent_on_start_state(
        context: *mut aeron_context_t,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    #[doc = " Create a aeron_context_t struct and initialize with default values.\n\n @param context to create and initialize\n @return 0 for success and -1 for error."]
    pub fn aeron_context_init(context: *mut *mut aeron_context_t) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Close and delete aeron_context_t struct.\n\n @param context to close and delete\n @return 0 for success and -1 for error."]
    pub fn aeron_context_close(context: *mut aeron_context_t) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Create a aeron_t client struct and initialize from the aeron_context_t struct.\n\n The given aeron_context_t struct will be used exclusively by the client. Do not reuse between clients.\n\n @param aeron  client to create and initialize.\n @param context to use for initialization.\n @return 0 for success and -1 for error."]
    pub fn aeron_init(
        client: *mut *mut aeron_t,
        context: *mut aeron_context_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Start an aeron_t. This may spawn a thread for the Client Conductor.\n\n @param client to start.\n @return 0 for success and -1 for error."]
    pub fn aeron_start(client: *mut aeron_t) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Call the Conductor main do_work duty cycle once.\n\n Client must have been created with use conductor invoker set to true.\n\n @param client to call do_work duty cycle on.\n @return 0 for success and -1 for error."]
    pub fn aeron_main_do_work(client: *mut aeron_t) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Call the Conductor Idle Strategy.\n\n @param client to idle.\n @param work_count to pass to idle strategy."]
    pub fn aeron_main_idle_strategy(client: *mut aeron_t, work_count: ::std::os::raw::c_int);
}
extern "C" {
    #[doc = " Close and delete aeron_t struct.\n\n @param client to close and delete\n @return 0 for success and -1 for error."]
    pub fn aeron_close(client: *mut aeron_t) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Determines if the client has been closed, e.g. via a driver timeout. Don't call this method after calling\n aeron_close as that will have already freed the associated memory.\n\n @param client to check if closed.\n @return true if it has been closed, false otherwise."]
    pub fn aeron_is_closed(client: *mut aeron_t) -> bool;
}
extern "C" {
    #[doc = " Call stream_out to print the counter labels and values.\n\n @param client to get the counters from.\n @param stream_out to call for each label and value."]
    pub fn aeron_print_counters(
        client: *mut aeron_t,
        stream_out: ::std::option::Option<
            unsafe extern "C" fn(arg1: *const ::std::os::raw::c_char),
        >,
    );
}
extern "C" {
    #[doc = " Return the aeron_context_t that is in use by the given client.\n\n @param client to return the aeron_context_t for.\n @return the aeron_context_t for the given client or NULL for an error."]
    pub fn aeron_context(client: *mut aeron_t) -> *mut aeron_context_t;
}
extern "C" {
    #[doc = " Return the client id in use by the client.\n\n @param client to return the client id for.\n @return id value or -1 for an error."]
    pub fn aeron_client_id(client: *mut aeron_t) -> i64;
}
extern "C" {
    #[doc = " Return a unique correlation id from the driver.\n\n @param client to use to get the id.\n @return unique correlation id or -1 for an error."]
    pub fn aeron_next_correlation_id(client: *mut aeron_t) -> i64;
}
extern "C" {
    #[doc = " Asynchronously add a publication using the given client and return an object to use to determine when the\n publication is available.\n\n @param async object to use for polling completion.\n @param client to add the publication to.\n @param uri for the channel of the publication.\n @param stream_id for the publication.\n @return 0 for success or -1 for an error."]
    pub fn aeron_async_add_publication(
        async_: *mut *mut aeron_async_add_publication_t,
        client: *mut aeron_t,
        uri: *const ::std::os::raw::c_char,
        stream_id: i32,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Poll the completion of the aeron_async_add_publication call.\n\n @param publication to set if completed successfully.\n @param async to check for completion.\n @return 0 for not complete (try again), 1 for completed successfully, or -1 for an error."]
    pub fn aeron_async_add_publication_poll(
        publication: *mut *mut aeron_publication_t,
        async_: *mut aeron_async_add_publication_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Asynchronously add an exclusive publication using the given client and return an object to use to determine when the\n publication is available.\n\n @param async object to use for polling completion.\n @param client to add the publication to.\n @param uri for the channel of the publication.\n @param stream_id for the publication.\n @return 0 for success or -1 for an error."]
    pub fn aeron_async_add_exclusive_publication(
        async_: *mut *mut aeron_async_add_exclusive_publication_t,
        client: *mut aeron_t,
        uri: *const ::std::os::raw::c_char,
        stream_id: i32,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Poll the completion of the aeron_async_add_exclusive_publication call.\n\n @param publication to set if completed successfully.\n @param async to check for completion.\n @return 0 for not complete (try again), 1 for completed successfully, or -1 for an error."]
    pub fn aeron_async_add_exclusive_publication_poll(
        publication: *mut *mut aeron_exclusive_publication_t,
        async_: *mut aeron_async_add_exclusive_publication_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Asynchronously add a subscription using the given client and return an object to use to determine when the\n subscription is available.\n\n @param async object to use for polling completion.\n @param client to add the subscription to.\n @param uri for the channel of the subscription.\n @param stream_id for the subscription.\n @param on_available_image_handler to be called when images become available on the subscription.\n @param on_available_image_clientd to be passed when images become available on the subscription.\n @param on_unavailable_image_handler to be called when images go unavailable on the subscription.\n @param on_available_image_clientd to be called when images go unavailable on the subscription.\n @return 0 for success or -1 for an error."]
    pub fn aeron_async_add_subscription(
        async_: *mut *mut aeron_async_add_subscription_t,
        client: *mut aeron_t,
        uri: *const ::std::os::raw::c_char,
        stream_id: i32,
        on_available_image_handler: aeron_on_available_image_t,
        on_available_image_clientd: *mut ::std::os::raw::c_void,
        on_unavailable_image_handler: aeron_on_unavailable_image_t,
        on_unavailable_image_clientd: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Poll the completion of the aeron_async_add_subscription call.\n\n @param subscription to set if completed successfully.\n @param async to check for completion.\n @return 0 for not complete (try again), 1 for completed successfully, or -1 for an error."]
    pub fn aeron_async_add_subscription_poll(
        subscription: *mut *mut aeron_subscription_t,
        async_: *mut aeron_async_add_subscription_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Return a reference to the counters reader of the given client.\n\n The aeron_counters_reader_t is maintained by the client. And should not be freed.\n\n @param client that contains the counters reader.\n @return aeron_counters_reader_t or NULL for error."]
    pub fn aeron_counters_reader(client: *mut aeron_t) -> *mut aeron_counters_reader_t;
}
extern "C" {
    #[doc = " Asynchronously add a counter using the given client and return an object to use to determine when the\n counter is available.\n\n @param async object to use for polling completion.\n @param client to add the counter to.\n @param type_id for the counter.\n @param key_buffer for the counter.\n @param key_buffer_length for the counter.\n @param label_buffer for the counter.\n @param label_buffer_length for the counter.\n @return 0 for success or -1 for an error."]
    pub fn aeron_async_add_counter(
        async_: *mut *mut aeron_async_add_counter_t,
        client: *mut aeron_t,
        type_id: i32,
        key_buffer: *const u8,
        key_buffer_length: usize,
        label_buffer: *const ::std::os::raw::c_char,
        label_buffer_length: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Poll the completion of the aeron_async_add_counter call.\n\n @param counter to set if completed successfully.\n @param async to check for completion.\n @return 0 for not complete (try again), 1 for completed successfully, or -1 for an error."]
    pub fn aeron_async_add_counter_poll(
        counter: *mut *mut aeron_counter_t,
        async_: *mut aeron_async_add_counter_t,
    ) -> ::std::os::raw::c_int;
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct aeron_on_available_counter_pair_stct {
    pub handler: aeron_on_available_counter_t,
    pub clientd: *mut ::std::os::raw::c_void,
}
#[test]
fn bindgen_test_layout_aeron_on_available_counter_pair_stct() {
    const UNINIT: ::std::mem::MaybeUninit<aeron_on_available_counter_pair_stct> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<aeron_on_available_counter_pair_stct>(),
        16usize,
        concat!(
            "Size of: ",
            stringify!(aeron_on_available_counter_pair_stct)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<aeron_on_available_counter_pair_stct>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(aeron_on_available_counter_pair_stct)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).handler) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(aeron_on_available_counter_pair_stct),
            "::",
            stringify!(handler)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).clientd) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(aeron_on_available_counter_pair_stct),
            "::",
            stringify!(clientd)
        )
    );
}
pub type aeron_on_available_counter_pair_t = aeron_on_available_counter_pair_stct;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct aeron_on_unavailable_counter_pair_stct {
    pub handler: aeron_on_unavailable_counter_t,
    pub clientd: *mut ::std::os::raw::c_void,
}
#[test]
fn bindgen_test_layout_aeron_on_unavailable_counter_pair_stct() {
    const UNINIT: ::std::mem::MaybeUninit<aeron_on_unavailable_counter_pair_stct> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<aeron_on_unavailable_counter_pair_stct>(),
        16usize,
        concat!(
            "Size of: ",
            stringify!(aeron_on_unavailable_counter_pair_stct)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<aeron_on_unavailable_counter_pair_stct>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(aeron_on_unavailable_counter_pair_stct)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).handler) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(aeron_on_unavailable_counter_pair_stct),
            "::",
            stringify!(handler)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).clientd) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(aeron_on_unavailable_counter_pair_stct),
            "::",
            stringify!(clientd)
        )
    );
}
pub type aeron_on_unavailable_counter_pair_t = aeron_on_unavailable_counter_pair_stct;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct aeron_on_close_client_pair_stct {
    pub handler: aeron_on_close_client_t,
    pub clientd: *mut ::std::os::raw::c_void,
}
#[test]
fn bindgen_test_layout_aeron_on_close_client_pair_stct() {
    const UNINIT: ::std::mem::MaybeUninit<aeron_on_close_client_pair_stct> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<aeron_on_close_client_pair_stct>(),
        16usize,
        concat!("Size of: ", stringify!(aeron_on_close_client_pair_stct))
    );
    assert_eq!(
        ::std::mem::align_of::<aeron_on_close_client_pair_stct>(),
        8usize,
        concat!("Alignment of ", stringify!(aeron_on_close_client_pair_stct))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).handler) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(aeron_on_close_client_pair_stct),
            "::",
            stringify!(handler)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).clientd) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(aeron_on_close_client_pair_stct),
            "::",
            stringify!(clientd)
        )
    );
}
pub type aeron_on_close_client_pair_t = aeron_on_close_client_pair_stct;
extern "C" {
    #[doc = " Add a handler to be called when a new counter becomes available.\n\n NOTE: This function blocks until the handler is added by the client conductor thread.\n\n @param client for the counter\n @param pair holding the handler to call and a clientd to pass when called.\n @return 0 for success and -1 for error"]
    pub fn aeron_add_available_counter_handler(
        client: *mut aeron_t,
        pair: *mut aeron_on_available_counter_pair_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Remove a previously added handler to be called when a new counter becomes available.\n\n NOTE: This function blocks until the handler is removed by the client conductor thread.\n\n @param client for the counter\n @param pair holding the handler to call and a clientd to pass when called.\n @return 0 for success and -1 for error"]
    pub fn aeron_remove_available_counter_handler(
        client: *mut aeron_t,
        pair: *mut aeron_on_available_counter_pair_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Add a handler to be called when a new counter becomes unavailable or goes away.\n\n NOTE: This function blocks until the handler is added by the client conductor thread.\n\n @param client for the counter\n @param pair holding the handler to call and a clientd to pass when called.\n @return 0 for success and -1 for error"]
    pub fn aeron_add_unavailable_counter_handler(
        client: *mut aeron_t,
        pair: *mut aeron_on_unavailable_counter_pair_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Remove a previously added handler to be called when a new counter becomes unavailable or goes away.\n\n NOTE: This function blocks until the handler is removed by the client conductor thread.\n\n @param client for the counter\n @param pair holding the handler to call and a clientd to pass when called.\n @return 0 for success and -1 for error"]
    pub fn aeron_remove_unavailable_counter_handler(
        client: *mut aeron_t,
        pair: *mut aeron_on_unavailable_counter_pair_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Add a handler to be called when client is closed.\n\n NOTE: This function blocks until the handler is added by the client conductor thread.\n\n @param client for the counter\n @param pair holding the handler to call and a clientd to pass when called.\n @return 0 for success and -1 for error"]
    pub fn aeron_add_close_handler(
        client: *mut aeron_t,
        pair: *mut aeron_on_close_client_pair_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Remove a previously added handler to be called when client is closed.\n\n NOTE: This function blocks until the handler is removed by the client conductor thread.\n\n @param client for the counter\n @param pair holding the handler to call and a clientd to pass when called.\n @return 0 for success and -1 for error"]
    pub fn aeron_remove_close_handler(
        client: *mut aeron_t,
        pair: *mut aeron_on_close_client_pair_t,
    ) -> ::std::os::raw::c_int;
}
#[repr(C, packed(4))]
#[derive(Copy, Clone)]
pub struct aeron_counter_value_descriptor_stct {
    pub counter_value: i64,
    pub registration_id: i64,
    pub owner_id: i64,
    pub pad1: [u8; 104usize],
}
#[test]
fn bindgen_test_layout_aeron_counter_value_descriptor_stct() {
    const UNINIT: ::std::mem::MaybeUninit<aeron_counter_value_descriptor_stct> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<aeron_counter_value_descriptor_stct>(),
        128usize,
        concat!("Size of: ", stringify!(aeron_counter_value_descriptor_stct))
    );
    assert_eq!(
        ::std::mem::align_of::<aeron_counter_value_descriptor_stct>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(aeron_counter_value_descriptor_stct)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).counter_value) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(aeron_counter_value_descriptor_stct),
            "::",
            stringify!(counter_value)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).registration_id) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(aeron_counter_value_descriptor_stct),
            "::",
            stringify!(registration_id)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).owner_id) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(aeron_counter_value_descriptor_stct),
            "::",
            stringify!(owner_id)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pad1) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(aeron_counter_value_descriptor_stct),
            "::",
            stringify!(pad1)
        )
    );
}
pub type aeron_counter_value_descriptor_t = aeron_counter_value_descriptor_stct;
#[repr(C, packed(4))]
#[derive(Copy, Clone)]
pub struct aeron_counter_metadata_descriptor_stct {
    pub state: i32,
    pub type_id: i32,
    pub free_for_reuse_deadline_ms: i64,
    pub key: [u8; 112usize],
    pub label_length: i32,
    pub label: [u8; 380usize],
}
#[test]
fn bindgen_test_layout_aeron_counter_metadata_descriptor_stct() {
    const UNINIT: ::std::mem::MaybeUninit<aeron_counter_metadata_descriptor_stct> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<aeron_counter_metadata_descriptor_stct>(),
        512usize,
        concat!(
            "Size of: ",
            stringify!(aeron_counter_metadata_descriptor_stct)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<aeron_counter_metadata_descriptor_stct>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(aeron_counter_metadata_descriptor_stct)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).state) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(aeron_counter_metadata_descriptor_stct),
            "::",
            stringify!(state)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_id) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(aeron_counter_metadata_descriptor_stct),
            "::",
            stringify!(type_id)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).free_for_reuse_deadline_ms) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(aeron_counter_metadata_descriptor_stct),
            "::",
            stringify!(free_for_reuse_deadline_ms)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).key) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(aeron_counter_metadata_descriptor_stct),
            "::",
            stringify!(key)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).label_length) as usize - ptr as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(aeron_counter_metadata_descriptor_stct),
            "::",
            stringify!(label_length)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).label) as usize - ptr as usize },
        132usize,
        concat!(
            "Offset of field: ",
            stringify!(aeron_counter_metadata_descriptor_stct),
            "::",
            stringify!(label)
        )
    );
}
pub type aeron_counter_metadata_descriptor_t = aeron_counter_metadata_descriptor_stct;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct aeron_counters_reader_buffers_stct {
    pub values: *mut u8,
    pub metadata: *mut u8,
    pub values_length: usize,
    pub metadata_length: usize,
}
#[test]
fn bindgen_test_layout_aeron_counters_reader_buffers_stct() {
    const UNINIT: ::std::mem::MaybeUninit<aeron_counters_reader_buffers_stct> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<aeron_counters_reader_buffers_stct>(),
        32usize,
        concat!("Size of: ", stringify!(aeron_counters_reader_buffers_stct))
    );
    assert_eq!(
        ::std::mem::align_of::<aeron_counters_reader_buffers_stct>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(aeron_counters_reader_buffers_stct)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).values) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(aeron_counters_reader_buffers_stct),
            "::",
            stringify!(values)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).metadata) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(aeron_counters_reader_buffers_stct),
            "::",
            stringify!(metadata)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).values_length) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(aeron_counters_reader_buffers_stct),
            "::",
            stringify!(values_length)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).metadata_length) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(aeron_counters_reader_buffers_stct),
            "::",
            stringify!(metadata_length)
        )
    );
}
pub type aeron_counters_reader_buffers_t = aeron_counters_reader_buffers_stct;
extern "C" {
    #[doc = " Get buffer pointers and lengths for the counters reader.\n\n @param reader reader containing the buffers.\n @param buffers output structure to return the buffers.\n @return -1 on failure, 0 on success."]
    pub fn aeron_counters_reader_get_buffers(
        reader: *mut aeron_counters_reader_t,
        buffers: *mut aeron_counters_reader_buffers_t,
    ) -> ::std::os::raw::c_int;
}
#[doc = " Function called by aeron_counters_reader_foreach_counter for each counter in the aeron_counters_reader_t.\n\n @param value of the counter.\n @param id of the counter.\n @param label for the counter.\n @param label_length for the counter.\n @param clientd to be returned in the call"]
pub type aeron_counters_reader_foreach_counter_func_t = ::std::option::Option<
    unsafe extern "C" fn(
        value: i64,
        id: i32,
        type_id: i32,
        key: *const u8,
        key_length: usize,
        label: *const ::std::os::raw::c_char,
        label_length: usize,
        clientd: *mut ::std::os::raw::c_void,
    ),
>;
extern "C" {
    #[doc = " Iterate over the counters in the counters_reader and call the given function for each counter.\n\n @param counters_reader to iterate over.\n @param func to call for each counter.\n @param clientd to pass for each call to func."]
    pub fn aeron_counters_reader_foreach_counter(
        counters_reader: *mut aeron_counters_reader_t,
        func: aeron_counters_reader_foreach_counter_func_t,
        clientd: *mut ::std::os::raw::c_void,
    );
}
extern "C" {
    #[doc = " Get the current max counter id.\n\n @param reader to query\n @return -1 on failure, max counter id on success."]
    pub fn aeron_counters_reader_max_counter_id(reader: *mut aeron_counters_reader_t) -> i32;
}
extern "C" {
    #[doc = " Get the address for a counter.\n\n @param counters_reader that contains the counter\n @param counter_id to find\n @return address of the counter value"]
    pub fn aeron_counters_reader_addr(
        counters_reader: *mut aeron_counters_reader_t,
        counter_id: i32,
    ) -> *mut i64;
}
extern "C" {
    #[doc = " Get the registration id assigned to a counter.\n\n @param counters_reader representing the this pointer.\n @param counter_id      for which the registration id requested.\n @param registration_id pointer for value to be set on success.\n @return -1 on failure, 0 on success."]
    pub fn aeron_counters_reader_counter_registration_id(
        counters_reader: *mut aeron_counters_reader_t,
        counter_id: i32,
        registration_id: *mut i64,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Get the owner id assigned to a counter which will typically be the client id.\n\n @param counters_reader representing the this pointer.\n @param counter_id      for which the registration id requested.\n @param owner_id        pointer for value to be set on success.\n @return -1 on failure, 0 on success."]
    pub fn aeron_counters_reader_counter_owner_id(
        counters_reader: *mut aeron_counters_reader_t,
        counter_id: i32,
        owner_id: *mut i64,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Get the state for a counter.\n\n @param counters_reader that contains the counter\n @param counter_id to find\n @param state out pointer for the current state to be stored in.\n @return -1 on failure, 0 on success."]
    pub fn aeron_counters_reader_counter_state(
        counters_reader: *mut aeron_counters_reader_t,
        counter_id: i32,
        state: *mut i32,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Get the type id for a counter.\n\n @param counters_reader that contains the counter\n @param counter_id to find\n @param type id out pointer for the current state to be stored in.\n @return -1 on failure, 0 on success."]
    pub fn aeron_counters_reader_counter_type_id(
        counters_reader: *mut aeron_counters_reader_t,
        counter_id: i32,
        type_id: *mut i32,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Get the label for a counter.\n\n @param counters_reader that contains the counter\n @param counter_id to find\n @param buffer to store the counter in.\n @param buffer_length length of the output buffer\n @return -1 on failure, number of characters copied to buffer on success."]
    pub fn aeron_counters_reader_counter_label(
        counters_reader: *mut aeron_counters_reader_t,
        counter_id: i32,
        buffer: *mut ::std::os::raw::c_char,
        buffer_length: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Get the free for reuse deadline (ms) for a counter.\n\n @param counters_reader that contains the counter.\n @param counter_id to find.\n @param deadline_ms output value to store the deadline.\n @return -1 on failure, 0 on success."]
    pub fn aeron_counters_reader_free_for_reuse_deadline_ms(
        counters_reader: *mut aeron_counters_reader_t,
        counter_id: i32,
        deadline_ms: *mut i64,
    ) -> ::std::os::raw::c_int;
}
#[doc = " Function called when filling in the reserved value field of a message.\n\n @param clientd passed to the offer function.\n @param buffer of the entire frame, including Aeron data header.\n @param frame_length of the entire frame."]
pub type aeron_reserved_value_supplier_t = ::std::option::Option<
    unsafe extern "C" fn(
        clientd: *mut ::std::os::raw::c_void,
        buffer: *mut u8,
        frame_length: usize,
    ) -> i64,
>;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct aeron_iovec_stct {
    pub iov_base: *mut u8,
    pub iov_len: usize,
}
#[test]
fn bindgen_test_layout_aeron_iovec_stct() {
    const UNINIT: ::std::mem::MaybeUninit<aeron_iovec_stct> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<aeron_iovec_stct>(),
        16usize,
        concat!("Size of: ", stringify!(aeron_iovec_stct))
    );
    assert_eq!(
        ::std::mem::align_of::<aeron_iovec_stct>(),
        8usize,
        concat!("Alignment of ", stringify!(aeron_iovec_stct))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).iov_base) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(aeron_iovec_stct),
            "::",
            stringify!(iov_base)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).iov_len) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(aeron_iovec_stct),
            "::",
            stringify!(iov_len)
        )
    );
}
pub type aeron_iovec_t = aeron_iovec_stct;
#[doc = " Structure used to hold information for a try_claim function call."]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct aeron_buffer_claim_stct {
    pub frame_header: *mut u8,
    pub data: *mut u8,
    pub length: usize,
}
#[test]
fn bindgen_test_layout_aeron_buffer_claim_stct() {
    const UNINIT: ::std::mem::MaybeUninit<aeron_buffer_claim_stct> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<aeron_buffer_claim_stct>(),
        24usize,
        concat!("Size of: ", stringify!(aeron_buffer_claim_stct))
    );
    assert_eq!(
        ::std::mem::align_of::<aeron_buffer_claim_stct>(),
        8usize,
        concat!("Alignment of ", stringify!(aeron_buffer_claim_stct))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).frame_header) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(aeron_buffer_claim_stct),
            "::",
            stringify!(frame_header)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(aeron_buffer_claim_stct),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).length) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(aeron_buffer_claim_stct),
            "::",
            stringify!(length)
        )
    );
}
extern "C" {
    #[doc = " Commit the given buffer_claim as a complete message available for consumption.\n\n @param buffer_claim to commit.\n @return 0 for success or -1 for error."]
    pub fn aeron_buffer_claim_commit(
        buffer_claim: *mut aeron_buffer_claim_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Abort the given buffer_claim and assign its position as padding.\n\n @param buffer_claim to abort.\n @return 0 for success or -1 for error."]
    pub fn aeron_buffer_claim_abort(
        buffer_claim: *mut aeron_buffer_claim_t,
    ) -> ::std::os::raw::c_int;
}
#[doc = " Configuration for a publication that does not change during it's lifetime."]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct aeron_publication_constants_stct {
    #[doc = " Media address for delivery to the channel.\n\n This returns a pointer only valid for the lifetime of the publication."]
    pub channel: *const ::std::os::raw::c_char,
    #[doc = " The registration used to register this Publication with the media driver by the first publisher."]
    pub original_registration_id: i64,
    #[doc = " Get the registration id used to register this Publication with the media driver.\n\n If this value is different from the original_registration_id then a previous active registration exists."]
    pub registration_id: i64,
    #[doc = " The maximum possible position this stream can reach due to its term buffer length.\n\n Maximum possible position is term-length times 2^31 in bytes."]
    pub max_possible_position: i64,
    #[doc = " Number of bits to right shift a position to get a term count for how far the stream has progressed."]
    pub position_bits_to_shift: usize,
    #[doc = " Get the length in bytes for each term partition in the log buffer."]
    pub term_buffer_length: usize,
    #[doc = " Maximum message length supported in bytes. Messages may be made of multiple fragments if greater than\n MTU length."]
    pub max_message_length: usize,
    #[doc = " Maximum length of a message payload that fits within a message fragment.\n\n This is he MTU length minus the message fragment header length."]
    pub max_payload_length: usize,
    #[doc = " Stream id of the publication."]
    pub stream_id: i32,
    #[doc = " Session id of the publication."]
    pub session_id: i32,
    #[doc = " The initial term id assigned when this publication was created. This can be used to determine how many\n terms have passed since creation."]
    pub initial_term_id: i32,
    #[doc = " Counter id for the publication limit."]
    pub publication_limit_counter_id: i32,
    #[doc = " Counter id for the channel status indicator"]
    pub channel_status_indicator_id: i32,
}
#[test]
fn bindgen_test_layout_aeron_publication_constants_stct() {
    const UNINIT: ::std::mem::MaybeUninit<aeron_publication_constants_stct> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<aeron_publication_constants_stct>(),
        88usize,
        concat!("Size of: ", stringify!(aeron_publication_constants_stct))
    );
    assert_eq!(
        ::std::mem::align_of::<aeron_publication_constants_stct>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(aeron_publication_constants_stct)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).channel) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(aeron_publication_constants_stct),
            "::",
            stringify!(channel)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).original_registration_id) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(aeron_publication_constants_stct),
            "::",
            stringify!(original_registration_id)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).registration_id) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(aeron_publication_constants_stct),
            "::",
            stringify!(registration_id)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).max_possible_position) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(aeron_publication_constants_stct),
            "::",
            stringify!(max_possible_position)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).position_bits_to_shift) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(aeron_publication_constants_stct),
            "::",
            stringify!(position_bits_to_shift)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).term_buffer_length) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(aeron_publication_constants_stct),
            "::",
            stringify!(term_buffer_length)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).max_message_length) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(aeron_publication_constants_stct),
            "::",
            stringify!(max_message_length)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).max_payload_length) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(aeron_publication_constants_stct),
            "::",
            stringify!(max_payload_length)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).stream_id) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(aeron_publication_constants_stct),
            "::",
            stringify!(stream_id)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).session_id) as usize - ptr as usize },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(aeron_publication_constants_stct),
            "::",
            stringify!(session_id)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).initial_term_id) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(aeron_publication_constants_stct),
            "::",
            stringify!(initial_term_id)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).publication_limit_counter_id) as usize - ptr as usize
        },
        76usize,
        concat!(
            "Offset of field: ",
            stringify!(aeron_publication_constants_stct),
            "::",
            stringify!(publication_limit_counter_id)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).channel_status_indicator_id) as usize - ptr as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(aeron_publication_constants_stct),
            "::",
            stringify!(channel_status_indicator_id)
        )
    );
}
#[doc = " Configuration for a publication that does not change during it's lifetime."]
pub type aeron_publication_constants_t = aeron_publication_constants_stct;
extern "C" {
    #[doc = " Non-blocking publish of a buffer containing a message.\n\n @param publication to publish on.\n @param buffer to publish.\n @param length of the buffer.\n @param reserved_value_supplier to use for setting the reserved value field or NULL.\n @param clientd to pass to the reserved_value_supplier.\n @return the new stream position otherwise a negative error value."]
    pub fn aeron_publication_offer(
        publication: *mut aeron_publication_t,
        buffer: *const u8,
        length: usize,
        reserved_value_supplier: aeron_reserved_value_supplier_t,
        clientd: *mut ::std::os::raw::c_void,
    ) -> i64;
}
extern "C" {
    #[doc = " Non-blocking publish by gathering buffer vectors into a message.\n\n @param publication to publish on.\n @param iov array for the vectors\n @param iovcnt of the number of vectors\n @param reserved_value_supplier to use for setting the reserved value field or NULL.\n @param clientd to pass to the reserved_value_supplier.\n @return the new stream position otherwise a negative error value."]
    pub fn aeron_publication_offerv(
        publication: *mut aeron_publication_t,
        iov: *mut aeron_iovec_t,
        iovcnt: usize,
        reserved_value_supplier: aeron_reserved_value_supplier_t,
        clientd: *mut ::std::os::raw::c_void,
    ) -> i64;
}
extern "C" {
    #[doc = " Try to claim a range in the publication log into which a message can be written with zero copy semantics.\n Once the message has been written then aeron_buffer_claim_commit should be called thus making it available.\n A claim length cannot be greater than max payload length.\n <p>\n <b>Note:</b> This method can only be used for message lengths less than MTU length minus header.\n If the claim is held for more than the aeron.publication.unblock.timeout system property then the driver will\n assume the publication thread is dead and will unblock the claim thus allowing other threads to make progress\n and other claims to be sent to reach end-of-stream (EOS).\n\n @code\n aeron_buffer_claim_t buffer_claim;\n\n if (aeron_publication_try_claim(publication, length, &buffer_claim) > 0L)\n {\n     // work with buffer_claim->data directly.\n     aeron_buffer_claim_commit(&buffer_claim);\n }\n @endcode\n\n @param publication to publish to.\n @param length of the message.\n @param buffer_claim to be populated if the claim succeeds.\n @return the new stream position otherwise a negative error value."]
    pub fn aeron_publication_try_claim(
        publication: *mut aeron_publication_t,
        length: usize,
        buffer_claim: *mut aeron_buffer_claim_t,
    ) -> i64;
}
extern "C" {
    #[doc = " Get the status of the media channel for this publication.\n <p>\n The status will be ERRORED (-1) if a socket exception occurs on setup and ACTIVE (1) if all is well.\n\n @param publication to check status of.\n @return 1 for ACTIVE, -1 for ERRORED"]
    pub fn aeron_publication_channel_status(publication: *mut aeron_publication_t) -> i64;
}
extern "C" {
    #[doc = " Has the publication closed?\n\n @param publication to check\n @return true if this publication is closed."]
    pub fn aeron_publication_is_closed(publication: *mut aeron_publication_t) -> bool;
}
extern "C" {
    #[doc = " Has the publication seen an active Subscriber recently?\n\n @param publication to check.\n @return true if this publication has recently seen an active subscriber otherwise false."]
    pub fn aeron_publication_is_connected(publication: *mut aeron_publication_t) -> bool;
}
extern "C" {
    #[doc = " Fill in a structure with the constants in use by a publication.\n\n @param publication to get the constants for.\n @param constants structure to fill in with the constants\n @return 0 for success and -1 for error."]
    pub fn aeron_publication_constants(
        publication: *mut aeron_publication_t,
        constants: *mut aeron_publication_constants_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Get the current position to which the publication has advanced for this stream.\n\n @param publication to query.\n @return the current position to which the publication has advanced for this stream or a negative error value."]
    pub fn aeron_publication_position(publication: *mut aeron_publication_t) -> i64;
}
extern "C" {
    #[doc = " Get the position limit beyond which this publication will be back pressured.\n\n This should only be used as a guide to determine when back pressure is likely to be applied.\n\n @param publication to query.\n @return the position limit beyond which this publication will be back pressured or a negative error value."]
    pub fn aeron_publication_position_limit(publication: *mut aeron_publication_t) -> i64;
}
extern "C" {
    #[doc = " Add a destination manually to a multi-destination-cast publication.\n\n @param async object to use for polling completion.\n @param publication to add destination to.\n @param uri for the destination to add.\n @return 0 for success and -1 for error."]
    pub fn aeron_publication_async_add_destination(
        async_: *mut *mut aeron_async_destination_t,
        client: *mut aeron_t,
        publication: *mut aeron_publication_t,
        uri: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Remove a destination manually from a multi-destination-cast publication.\n\n @param async object to use for polling completion.\n @param publication to remove destination from.\n @param uri for the destination to remove.\n @return 0 for success and -1 for error."]
    pub fn aeron_publication_async_remove_destination(
        async_: *mut *mut aeron_async_destination_t,
        client: *mut aeron_t,
        publication: *mut aeron_publication_t,
        uri: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Poll the completion of the add/remove of a destination to/from a publication.\n\n @param async to check for completion.\n @return 0 for not complete (try again), 1 for completed successfully, or -1 for an error."]
    pub fn aeron_publication_async_destination_poll(
        async_: *mut aeron_async_destination_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Add a destination manually to a multi-destination-cast exclusive publication.\n\n @param async object to use for polling completion.\n @param publication to add destination to.\n @param uri for the destination to add.\n @return 0 for success and -1 for error."]
    pub fn aeron_exclusive_publication_async_add_destination(
        async_: *mut *mut aeron_async_destination_t,
        client: *mut aeron_t,
        publication: *mut aeron_exclusive_publication_t,
        uri: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Remove a destination manually from a multi-destination-cast exclusive publication.\n\n @param async object to use for polling completion.\n @param publication to remove destination from.\n @param uri for the destination to remove.\n @return 0 for success and -1 for error."]
    pub fn aeron_exclusive_publication_async_remove_destination(
        async_: *mut *mut aeron_async_destination_t,
        client: *mut aeron_t,
        publication: *mut aeron_exclusive_publication_t,
        uri: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Poll the completion of the add/remove of a destination to/from an exclusive publication.\n\n @param async to check for completion.\n @return 0 for not complete (try again), 1 for completed successfully, or -1 for an error."]
    pub fn aeron_exclusive_publication_async_destination_poll(
        async_: *mut aeron_async_destination_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Asynchronously close the publication. Will callback on the on_complete notification when the subscription is closed.\n The callback is optional, use NULL for the on_complete callback if not required.\n\n @param publication to close\n @param on_close_complete optional callback to execute once the subscription has been closed and freed. This may\n happen on a separate thread, so the caller should ensure that clientd has the appropriate lifetime.\n @param on_close_complete_clientd parameter to pass to the on_complete callback.\n @return 0 for success or -1 for error."]
    pub fn aeron_publication_close(
        publication: *mut aeron_publication_t,
        on_close_complete: aeron_notification_t,
        on_close_complete_clientd: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Get the publication's channel\n\n @param publication this\n @return channel uri string"]
    pub fn aeron_publication_channel(
        publication: *mut aeron_publication_t,
    ) -> *const ::std::os::raw::c_char;
}
extern "C" {
    #[doc = " Get the publication's stream id\n\n @param publication this\n @return stream id"]
    pub fn aeron_publication_stream_id(publication: *mut aeron_publication_t) -> i32;
}
extern "C" {
    #[doc = " Get the publication's session id\n @param publication this\n @return session id"]
    pub fn aeron_publication_session_id(publication: *mut aeron_publication_t) -> i32;
}
extern "C" {
    #[doc = " Get all of the local socket addresses for this publication. Typically only one representing the control address.\n\n @param subscription to query\n @param address_vec to hold the received addresses\n @param address_vec_len available length of the vector to hold the addresses\n @return number of addresses found or -1 if there is an error.\n @see aeron_subscription_local_sockaddrs"]
    pub fn aeron_publication_local_sockaddrs(
        publication: *mut aeron_publication_t,
        address_vec: *mut aeron_iovec_t,
        address_vec_len: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Non-blocking publish of a buffer containing a message.\n\n @param publication to publish on.\n @param buffer to publish.\n @param length of the buffer.\n @param reserved_value_supplier to use for setting the reserved value field or NULL.\n @param clientd to pass to the reserved_value_supplier.\n @return the new stream position otherwise a negative error value."]
    pub fn aeron_exclusive_publication_offer(
        publication: *mut aeron_exclusive_publication_t,
        buffer: *const u8,
        length: usize,
        reserved_value_supplier: aeron_reserved_value_supplier_t,
        clientd: *mut ::std::os::raw::c_void,
    ) -> i64;
}
extern "C" {
    #[doc = " Non-blocking publish by gathering buffer vectors into a message.\n\n @param publication to publish on.\n @param iov array for the vectors\n @param iovcnt of the number of vectors\n @param reserved_value_supplier to use for setting the reserved value field or NULL.\n @param clientd to pass to the reserved_value_supplier.\n @return the new stream position otherwise a negative error value."]
    pub fn aeron_exclusive_publication_offerv(
        publication: *mut aeron_exclusive_publication_t,
        iov: *mut aeron_iovec_t,
        iovcnt: usize,
        reserved_value_supplier: aeron_reserved_value_supplier_t,
        clientd: *mut ::std::os::raw::c_void,
    ) -> i64;
}
extern "C" {
    #[doc = " Try to claim a range in the publication log into which a message can be written with zero copy semantics.\n Once the message has been written then aeron_buffer_claim_commit should be called thus making it available.\n A claim length cannot be greater than max payload length.\n <p>\n <b>Note:</b> This method can only be used for message lengths less than MTU length minus header.\n\n @code\n aeron_buffer_claim_t buffer_claim;\n\n if (aeron_exclusive_publication_try_claim(publication, length, &buffer_claim) > 0L)\n {\n     // work with buffer_claim->data directly.\n     aeron_buffer_claim_commit(&buffer_claim);\n }\n @endcode\n\n @param publication to publish to.\n @param length of the message.\n @param buffer_claim to be populated if the claim succeeds.\n @return the new stream position otherwise a negative error value."]
    pub fn aeron_exclusive_publication_try_claim(
        publication: *mut aeron_exclusive_publication_t,
        length: usize,
        buffer_claim: *mut aeron_buffer_claim_t,
    ) -> i64;
}
extern "C" {
    #[doc = " Append a padding record log of a given length to make up the log to a position.\n\n @param length of the range to claim, in bytes.\n @return the new stream position otherwise a negative error value."]
    pub fn aeron_exclusive_publication_append_padding(
        publication: *mut aeron_exclusive_publication_t,
        length: usize,
    ) -> i64;
}
extern "C" {
    #[doc = " Offer a block of pre-formatted message fragments directly into the current term.\n\n @param buffer containing the pre-formatted block of message fragments.\n @param offset offset in the buffer at which the first fragment begins.\n @param length in bytes of the encoded block.\n @return the new stream position otherwise a negative error value."]
    pub fn aeron_exclusive_publication_offer_block(
        publication: *mut aeron_exclusive_publication_t,
        buffer: *const u8,
        length: usize,
    ) -> i64;
}
extern "C" {
    #[doc = " Get the status of the media channel for this publication.\n <p>\n The status will be ERRORED (-1) if a socket exception occurs on setup and ACTIVE (1) if all is well.\n\n @param publication to check status of.\n @return 1 for ACTIVE, -1 for ERRORED"]
    pub fn aeron_exclusive_publication_channel_status(
        publication: *mut aeron_exclusive_publication_t,
    ) -> i64;
}
extern "C" {
    #[doc = " Fill in a structure with the constants in use by a publication.\n\n @param publication to get the constants for.\n @param constants structure to fill in with the constants\n @return 0 for success and -1 for error."]
    pub fn aeron_exclusive_publication_constants(
        publication: *mut aeron_exclusive_publication_t,
        constants: *mut aeron_publication_constants_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Get the current position to which the publication has advanced for this stream.\n\n @param publication to query.\n @return the current position to which the publication has advanced for this stream or a negative error value."]
    pub fn aeron_exclusive_publication_position(
        publication: *mut aeron_exclusive_publication_t,
    ) -> i64;
}
extern "C" {
    #[doc = " Get the position limit beyond which this publication will be back pressured.\n\n This should only be used as a guide to determine when back pressure is likely to be applied.\n\n @param publication to query.\n @return the position limit beyond which this publication will be back pressured or a negative error value."]
    pub fn aeron_exclusive_publication_position_limit(
        publication: *mut aeron_exclusive_publication_t,
    ) -> i64;
}
extern "C" {
    #[doc = " Asynchronously close the publication.\n\n @param publication to close\n @return 0 for success or -1 for error."]
    pub fn aeron_exclusive_publication_close(
        publication: *mut aeron_exclusive_publication_t,
        on_close_complete: aeron_notification_t,
        on_close_complete_clientd: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Has the exclusive publication closed?\n\n @param publication to check\n @return true if this publication is closed."]
    pub fn aeron_exclusive_publication_is_closed(
        publication: *mut aeron_exclusive_publication_t,
    ) -> bool;
}
extern "C" {
    #[doc = " Has the exclusive publication seen an active Subscriber recently?\n\n @param publication to check.\n @return true if this publication has recently seen an active subscriber otherwise false."]
    pub fn aeron_exclusive_publication_is_connected(
        publication: *mut aeron_exclusive_publication_t,
    ) -> bool;
}
extern "C" {
    #[doc = " Get all of the local socket addresses for this exclusive publication. Typically only one representing the control\n address.\n\n @see aeron_subscription_local_sockaddrs\n @param subscription to query\n @param address_vec to hold the received addresses\n @param address_vec_len available length of the vector to hold the addresses\n @return number of addresses found or -1 if there is an error."]
    pub fn aeron_exclusive_publication_local_sockaddrs(
        publication: *mut aeron_exclusive_publication_t,
        address_vec: *mut aeron_iovec_t,
        address_vec_len: usize,
    ) -> ::std::os::raw::c_int;
}
#[doc = " Callback for handling fragments of data being read from a log.\n\n The frame will either contain a whole message or a fragment of a message to be reassembled. Messages are fragmented\n if greater than the frame for MTU in length.\n\n @param clientd passed to the poll function.\n @param buffer containing the data.\n @param length of the data in bytes.\n @param header representing the meta data for the data."]
pub type aeron_fragment_handler_t = ::std::option::Option<
    unsafe extern "C" fn(
        clientd: *mut ::std::os::raw::c_void,
        buffer: *const u8,
        length: usize,
        header: *mut aeron_header_t,
    ),
>;
#[doc = " Abort the current polling operation and do not advance the position for this fragment."]
pub const aeron_controlled_fragment_handler_action_en_AERON_ACTION_ABORT:
    aeron_controlled_fragment_handler_action_en = 1;
#[doc = " Break from the current polling operation and commit the position as of the end of the current fragment\n being handled."]
pub const aeron_controlled_fragment_handler_action_en_AERON_ACTION_BREAK:
    aeron_controlled_fragment_handler_action_en = 2;
#[doc = " Continue processing but commit the position as of the end of the current fragment so that\n flow control is applied to this point."]
pub const aeron_controlled_fragment_handler_action_en_AERON_ACTION_COMMIT:
    aeron_controlled_fragment_handler_action_en = 3;
#[doc = " Continue processing until fragment limit or no fragments with position commit at end of poll as in\n aeron_fragment_handler_t."]
pub const aeron_controlled_fragment_handler_action_en_AERON_ACTION_CONTINUE:
    aeron_controlled_fragment_handler_action_en = 4;
pub type aeron_controlled_fragment_handler_action_en = ::std::os::raw::c_uint;
pub use self::aeron_controlled_fragment_handler_action_en as aeron_controlled_fragment_handler_action_t;
#[doc = " Callback for handling fragments of data being read from a log.\n\n Handler for reading data that is coming from a log buffer. The frame will either contain a whole message\n or a fragment of a message to be reassembled. Messages are fragmented if greater than the frame for MTU in length.\n\n @param clientd passed to the controlled poll function.\n @param buffer containing the data.\n @param length of the data in bytes.\n @param header representing the meta data for the data.\n @return The action to be taken with regard to the stream position after the callback."]
pub type aeron_controlled_fragment_handler_t = ::std::option::Option<
    unsafe extern "C" fn(
        clientd: *mut ::std::os::raw::c_void,
        buffer: *const u8,
        length: usize,
        header: *mut aeron_header_t,
    ) -> aeron_controlled_fragment_handler_action_t,
>;
#[doc = " Callback for handling a block of messages being read from a log.\n\n @param clientd passed to the block poll function.\n @param buffer containing the block of message fragments.\n @param offset at which the block begins, including any frame headers.\n @param length of the block in bytes, including any frame headers that is aligned.\n @param session_id of the stream containing this block of message fragments.\n @param term_id of the stream containing this block of message fragments."]
pub type aeron_block_handler_t = ::std::option::Option<
    unsafe extern "C" fn(
        clientd: *mut ::std::os::raw::c_void,
        buffer: *const u8,
        length: usize,
        session_id: i32,
        term_id: i32,
    ),
>;
extern "C" {
    #[doc = " Get all of the field values from the header. This will do a memcpy into the supplied header_values_t pointer.\n\n @param header to read values from.\n @param values to copy values to, must not be null.\n @return 0 on success, -1 on failure."]
    pub fn aeron_header_values(
        header: *mut aeron_header_t,
        values: *mut aeron_header_values_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Get the current position to which the Image has advanced on reading this message.\n\n @param header the current header message\n @return the current position to which the Image has advanced on reading this message."]
    pub fn aeron_header_position(header: *mut aeron_header_t) -> i64;
}
extern "C" {
    #[doc = " Get the number of times to left shift the term count to multiply by term length.\n\n @return number of times to left shift the term count to multiply by term length."]
    pub fn aeron_header_position_bits_to_shift(header: *mut aeron_header_t) -> usize;
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct aeron_subscription_constants_stct {
    #[doc = " Media address for delivery to the channel.\n\n This returns a pointer only valid for the lifetime of the subscription."]
    pub channel: *const ::std::os::raw::c_char,
    #[doc = " Callback used to indicate when an Image becomes available under this Subscription."]
    pub on_available_image: aeron_on_available_image_t,
    #[doc = " Callback used to indicate when an Image goes unavailable under this Subscription."]
    pub on_unavailable_image: aeron_on_unavailable_image_t,
    #[doc = " Return the registration id used to register this Subscription with the media driver."]
    pub registration_id: i64,
    #[doc = " Stream identity for scoping within the channel media address."]
    pub stream_id: i32,
    #[doc = " Counter id for the channel status indicator"]
    pub channel_status_indicator_id: i32,
}
#[test]
fn bindgen_test_layout_aeron_subscription_constants_stct() {
    const UNINIT: ::std::mem::MaybeUninit<aeron_subscription_constants_stct> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<aeron_subscription_constants_stct>(),
        40usize,
        concat!("Size of: ", stringify!(aeron_subscription_constants_stct))
    );
    assert_eq!(
        ::std::mem::align_of::<aeron_subscription_constants_stct>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(aeron_subscription_constants_stct)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).channel) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(aeron_subscription_constants_stct),
            "::",
            stringify!(channel)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).on_available_image) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(aeron_subscription_constants_stct),
            "::",
            stringify!(on_available_image)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).on_unavailable_image) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(aeron_subscription_constants_stct),
            "::",
            stringify!(on_unavailable_image)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).registration_id) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(aeron_subscription_constants_stct),
            "::",
            stringify!(registration_id)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).stream_id) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(aeron_subscription_constants_stct),
            "::",
            stringify!(stream_id)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).channel_status_indicator_id) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(aeron_subscription_constants_stct),
            "::",
            stringify!(channel_status_indicator_id)
        )
    );
}
pub type aeron_subscription_constants_t = aeron_subscription_constants_stct;
extern "C" {
    #[doc = " Poll the images under the subscription for available message fragments.\n <p>\n Each fragment read will be a whole message if it is under MTU length. If larger than MTU then it will come\n as a series of fragments ordered within a session.\n <p>\n To assemble messages that span multiple fragments then use aeron_fragment_assembler_t.\n\n @param subscription to poll.\n @param handler for handling each message fragment as it is read.\n @param fragment_limit number of message fragments to limit when polling across multiple images.\n @return the number of fragments received or -1 for error."]
    pub fn aeron_subscription_poll(
        subscription: *mut aeron_subscription_t,
        handler: aeron_fragment_handler_t,
        clientd: *mut ::std::os::raw::c_void,
        fragment_limit: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Poll in a controlled manner the images under the subscription for available message fragments.\n Control is applied to fragments in the stream. If more fragments can be read on another stream\n they will even if BREAK or ABORT is returned from the fragment handler.\n <p>\n Each fragment read will be a whole message if it is under MTU length. If larger than MTU then it will come\n as a series of fragments ordered within a session.\n <p>\n To assemble messages that span multiple fragments then use aeron_controlled_fragment_assembler_t.\n\n @param subscription to poll.\n @param handler for handling each message fragment as it is read.\n @param fragment_limit number of message fragments to limit when polling across multiple images.\n @return the number of fragments received or -1 for error."]
    pub fn aeron_subscription_controlled_poll(
        subscription: *mut aeron_subscription_t,
        handler: aeron_controlled_fragment_handler_t,
        clientd: *mut ::std::os::raw::c_void,
        fragment_limit: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Poll the images under the subscription for available message fragments in blocks.\n <p>\n This method is useful for operations like bulk archiving and messaging indexing.\n\n @param subscription to poll.\n @param handler to receive a block of fragments from each image.\n @param block_length_limit for each image polled.\n @return the number of bytes consumed or -1 for error."]
    pub fn aeron_subscription_block_poll(
        subscription: *mut aeron_subscription_t,
        handler: aeron_block_handler_t,
        clientd: *mut ::std::os::raw::c_void,
        block_length_limit: usize,
    ) -> ::std::os::raw::c_long;
}
extern "C" {
    #[doc = " Is this subscription connected by having at least one open publication image.\n\n @param subscription to check.\n @return true if this subscription connected by having at least one open publication image."]
    pub fn aeron_subscription_is_connected(subscription: *mut aeron_subscription_t) -> bool;
}
extern "C" {
    #[doc = " Fill in a structure with the constants in use by a subscription.\n\n @param subscription to get the constants for.\n @param constants structure to fill in with the constants\n @return 0 for success and -1 for error."]
    pub fn aeron_subscription_constants(
        subscription: *mut aeron_subscription_t,
        constants: *mut aeron_subscription_constants_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Count of images associated to this subscription.\n\n @param subscription to count images for.\n @return count of count associated to this subscription or -1 for error."]
    pub fn aeron_subscription_image_count(
        subscription: *mut aeron_subscription_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Return the image associated with the given session_id under the given subscription.\n\n Note: the returned image is considered retained by the application and thus must be released via\n aeron_image_release when finished or if the image becomes unavailable.\n\n @param subscription to search.\n @param session_id associated with the image.\n @return image associated with the given session_id or NULL if no image exists."]
    pub fn aeron_subscription_image_by_session_id(
        subscription: *mut aeron_subscription_t,
        session_id: i32,
    ) -> *mut aeron_image_t;
}
extern "C" {
    #[doc = " Return the image at the given index.\n\n Note: the returned image is considered retained by the application and thus must be released via\n aeron_image_release when finished or if the image becomes unavailable.\n\n @param subscription to search.\n @param index for the image.\n @return image at the given index or NULL if no image exists."]
    pub fn aeron_subscription_image_at_index(
        subscription: *mut aeron_subscription_t,
        index: usize,
    ) -> *mut aeron_image_t;
}
extern "C" {
    #[doc = " Iterate over the images for this subscription calling the given function.\n\n @param subscription to iterate over.\n @param handler to be called for each image."]
    pub fn aeron_subscription_for_each_image(
        subscription: *mut aeron_subscription_t,
        handler: ::std::option::Option<
            unsafe extern "C" fn(image: *mut aeron_image_t, clientd: *mut ::std::os::raw::c_void),
        >,
        clientd: *mut ::std::os::raw::c_void,
    );
}
extern "C" {
    #[doc = " Retain the given image for access in the application.\n\n Note: A retain call must have a corresponding release call.\n Note: Subscriptions are not threadsafe and should not be shared between subscribers.\n\n @param subscription that image is part of.\n @param image to retain\n @return 0 for success and -1 for error."]
    pub fn aeron_subscription_image_retain(
        subscription: *mut aeron_subscription_t,
        image: *mut aeron_image_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Release the given image and relinquish desire to use the image directly.\n\n Note: Subscriptions are not threadsafe and should not be shared between subscribers.\n\n @param subscription that image is part of.\n @param image to release\n @return 0 for success and -1 for error."]
    pub fn aeron_subscription_image_release(
        subscription: *mut aeron_subscription_t,
        image: *mut aeron_image_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Is the subscription closed.\n\n @param subscription to be checked.\n @return true if it has been closed otherwise false."]
    pub fn aeron_subscription_is_closed(subscription: *mut aeron_subscription_t) -> bool;
}
extern "C" {
    #[doc = " Get the status of the media channel for this subscription.\n <p>\n The status will be ERRORED (-1) if a socket exception occurs on setup and ACTIVE (1) if all is well.\n\n @param subscription to check status of.\n @return 1 for ACTIVE, -1 for ERRORED"]
    pub fn aeron_subscription_channel_status(subscription: *mut aeron_subscription_t) -> i64;
}
extern "C" {
    #[doc = " Add a destination manually to a multi-destination-subscription.\n\n @param async object to use for polling completion.\n @param subscription to add destination to.\n @param uri for the destination to add.\n @return 0 for success and -1 for error."]
    pub fn aeron_subscription_async_add_destination(
        async_: *mut *mut aeron_async_destination_t,
        client: *mut aeron_t,
        subscription: *mut aeron_subscription_t,
        uri: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Remove a destination manually from a multi-destination-subscription.\n\n @param async object to use for polling completion.\n @param subscription to remove destination from.\n @param uri for the destination to remove.\n @return 0 for success and -1 for error."]
    pub fn aeron_subscription_async_remove_destination(
        async_: *mut *mut aeron_async_destination_t,
        client: *mut aeron_t,
        subscription: *mut aeron_subscription_t,
        uri: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Poll the completion of add/remove of a destination to/from a subscription.\n\n @param async to check for completion.\n @return 0 for not complete (try again), 1 for completed successfully, or -1 for an error."]
    pub fn aeron_subscription_async_destination_poll(
        async_: *mut aeron_async_destination_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Asynchronously close the subscription. Will callback on the on_complete notification when the subscription is\n closed. The callback is optional, use NULL for the on_complete callback if not required.\n\n @param subscription to close\n @param on_close_complete optional callback to execute once the subscription has been closed and freed. This may\n happen on a separate thread, so the caller should ensure that clientd has the appropriate lifetime.\n @param on_close_complete_clientd parameter to pass to the on_complete callback.\n @return 0 for success or -1 for error."]
    pub fn aeron_subscription_close(
        subscription: *mut aeron_subscription_t,
        on_close_complete: aeron_notification_t,
        on_close_complete_clientd: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Get all of the local socket addresses for this subscription. Multiple addresses can occur if this is a\n multi-destination subscription. Addresses will a string representation in numeric form. IPv6 addresses will be\n surrounded by '[' and ']' so that the ':' that separate the parts are distinguishable from the port delimiter.\n E.g. [fe80::7552:c06e:6bf4:4160]:12345. As of writing the maximum length for a formatted address is 54 bytes\n including the NULL terminator. AERON_CLIENT_MAX_LOCAL_ADDRESS_STR_LEN is defined to provide enough space to fit the\n returned string. Returned strings will be NULL terminated. If the buffer to hold the address can not hold enough\n of the message it will be truncated and the last character will be null.\n\n If the address_vec_len is less the total number of addresses available then the first addresses found up to that\n length will be placed into the address_vec. However the function will return the total number of addresses available\n so if if that is larger than the input array then the client code may wish to re-query with a larger array to get\n them all.\n\n @param subscription to query\n @param address_vec to hold the received addresses\n @param address_vec_len available length of the vector to hold the addresses\n @return number of addresses found or -1 if there is an error."]
    pub fn aeron_subscription_local_sockaddrs(
        subscription: *mut aeron_subscription_t,
        address_vec: *mut aeron_iovec_t,
        address_vec_len: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Retrieves the first local socket address for this subscription. If this is not MDS then it will be the one\n representing endpoint for this subscription.\n\n @see aeron_subscription_local_sockaddrs\n @param subscription to query\n @param address for the received address\n @param address_len available length for the copied address.\n @return -1 on error, 0 if address not found, 1 if address is found."]
    pub fn aeron_subscription_resolved_endpoint(
        subscription: *mut aeron_subscription_t,
        address: *const ::std::os::raw::c_char,
        address_len: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Retrieves the channel URI for this subscription with any wildcard ports filled in. If the channel is not UDP or\n does not have a wildcard port (`0`), then it will return the original URI.\n\n @param subscription to query\n @param uri buffer to hold the resolved uri\n @param uri_len length of the buffer\n @return -1 on failure or the number of bytes written to the buffer (excluding the NULL terminator). Writing is done\n on a per key basis, so if the buffer was truncated before writing completed, it will only include the byte count up\n to the key that overflowed. However, the invariant that if the number returned >= uri_len, then output will have been\n truncated."]
    pub fn aeron_subscription_try_resolve_channel_endpoint_port(
        subscription: *mut aeron_subscription_t,
        uri: *mut ::std::os::raw::c_char,
        uri_len: usize,
    ) -> ::std::os::raw::c_int;
}
#[doc = " Configuration for an image that does not change during it's lifetime."]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct aeron_image_constants_stct {
    #[doc = " The subscription to which this image belongs."]
    pub subscription: *mut aeron_subscription_t,
    #[doc = " The source identity of the sending publisher as an abstract concept appropriate for the media."]
    pub source_identity: *const ::std::os::raw::c_char,
    #[doc = " The correlationId for identification of the image with the media driver."]
    pub correlation_id: i64,
    #[doc = " Get the position the subscriber joined this stream at."]
    pub join_position: i64,
    #[doc = " Number of bits to right shift a position to get a term count for how far the stream has progressed."]
    pub position_bits_to_shift: usize,
    #[doc = " Get the length in bytes for each term partition in the log buffer."]
    pub term_buffer_length: usize,
    #[doc = " The length in bytes of the MTU (Maximum Transmission Unit) the Sender used for the datagram."]
    pub mtu_length: usize,
    #[doc = " The sessionId for the steam of messages. Sessions are unique within a subscription and unique across\n all publications from a source identity."]
    pub session_id: i32,
    #[doc = " The initial term at which the stream started for this session."]
    pub initial_term_id: i32,
    #[doc = " Counter id that refers to the subscriber position for this image."]
    pub subscriber_position_id: i32,
}
#[test]
fn bindgen_test_layout_aeron_image_constants_stct() {
    const UNINIT: ::std::mem::MaybeUninit<aeron_image_constants_stct> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<aeron_image_constants_stct>(),
        72usize,
        concat!("Size of: ", stringify!(aeron_image_constants_stct))
    );
    assert_eq!(
        ::std::mem::align_of::<aeron_image_constants_stct>(),
        8usize,
        concat!("Alignment of ", stringify!(aeron_image_constants_stct))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).subscription) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(aeron_image_constants_stct),
            "::",
            stringify!(subscription)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).source_identity) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(aeron_image_constants_stct),
            "::",
            stringify!(source_identity)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).correlation_id) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(aeron_image_constants_stct),
            "::",
            stringify!(correlation_id)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).join_position) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(aeron_image_constants_stct),
            "::",
            stringify!(join_position)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).position_bits_to_shift) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(aeron_image_constants_stct),
            "::",
            stringify!(position_bits_to_shift)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).term_buffer_length) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(aeron_image_constants_stct),
            "::",
            stringify!(term_buffer_length)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mtu_length) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(aeron_image_constants_stct),
            "::",
            stringify!(mtu_length)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).session_id) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(aeron_image_constants_stct),
            "::",
            stringify!(session_id)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).initial_term_id) as usize - ptr as usize },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(aeron_image_constants_stct),
            "::",
            stringify!(initial_term_id)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).subscriber_position_id) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(aeron_image_constants_stct),
            "::",
            stringify!(subscriber_position_id)
        )
    );
}
#[doc = " Configuration for an image that does not change during it's lifetime."]
pub type aeron_image_constants_t = aeron_image_constants_stct;
extern "C" {
    #[doc = " Fill in a structure with the constants in use by a image.\n\n @param image to get the constants for.\n @param constants structure to fill in with the constants\n @return 0 for success and -1 for error."]
    pub fn aeron_image_constants(
        image: *mut aeron_image_t,
        constants: *mut aeron_image_constants_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " The position this image has been consumed to by the subscriber.\n\n @param image to query position of.\n @return the position this image has been consumed to by the subscriber."]
    pub fn aeron_image_position(image: *mut aeron_image_t) -> i64;
}
extern "C" {
    #[doc = " Set the subscriber position for this image to indicate where it has been consumed to.\n\n @param image to set the position of.\n @param new_position for the consumption point."]
    pub fn aeron_image_set_position(
        image: *mut aeron_image_t,
        position: i64,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Is the current consumed position at the end of the stream?\n\n @param image to check.\n @return true if at the end of the stream or false if not."]
    pub fn aeron_image_is_end_of_stream(image: *mut aeron_image_t) -> bool;
}
extern "C" {
    #[doc = " Count of observed active transports within the image liveness timeout.\n\n If the image is closed, then this is 0. This may also be 0 if no actual datagrams have arrived. IPC\n Images also will be 0.\n\n @param image to check.\n @return count of active transports - 0 if Image is closed, no datagrams yet, or IPC. Or -1 for error."]
    pub fn aeron_image_active_transport_count(image: *mut aeron_image_t) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Poll for new messages in a stream. If new messages are found beyond the last consumed position then they\n will be delivered to the handler up to a limited number of fragments as specified.\n <p>\n Use a fragment assembler to assemble messages which span multiple fragments.\n\n @param image to poll.\n @param handler to which message fragments are delivered.\n @param clientd to pass to the handler.\n @param fragment_limit for the number of fragments to be consumed during one polling operation.\n @return the number of fragments that have been consumed or -1 for error."]
    pub fn aeron_image_poll(
        image: *mut aeron_image_t,
        handler: aeron_fragment_handler_t,
        clientd: *mut ::std::os::raw::c_void,
        fragment_limit: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Poll for new messages in a stream. If new messages are found beyond the last consumed position then they\n will be delivered to the handler up to a limited number of fragments as specified.\n <p>\n Use a controlled fragment assembler to assemble messages which span multiple fragments.\n\n @param image to poll.\n @param handler to which message fragments are delivered.\n @param clientd to pass to the handler.\n @param fragment_limit for the number of fragments to be consumed during one polling operation.\n @return the number of fragments that have been consumed or -1 for error."]
    pub fn aeron_image_controlled_poll(
        image: *mut aeron_image_t,
        handler: aeron_controlled_fragment_handler_t,
        clientd: *mut ::std::os::raw::c_void,
        fragment_limit: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Poll for new messages in a stream. If new messages are found beyond the last consumed position then they\n will be delivered to the handler up to a limited number of fragments as specified or the maximum position specified.\n <p>\n Use a fragment assembler to assemble messages which span multiple fragments.\n\n @param image to poll.\n @param handler to which message fragments are delivered.\n @param clientd to pass to the handler.\n @param limit_position to consume messages up to.\n @param fragment_limit for the number of fragments to be consumed during one polling operation.\n @return the number of fragments that have been consumed or -1 for error."]
    pub fn aeron_image_bounded_poll(
        image: *mut aeron_image_t,
        handler: aeron_fragment_handler_t,
        clientd: *mut ::std::os::raw::c_void,
        limit_position: i64,
        fragment_limit: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Poll for new messages in a stream. If new messages are found beyond the last consumed position then they\n will be delivered to the handler up to a limited number of fragments as specified or the maximum position specified.\n <p>\n Use a controlled fragment assembler to assemble messages which span multiple fragments.\n\n @param image to poll.\n @param handler to which message fragments are delivered.\n @param clientd to pass to the handler.\n @param limit_position to consume messages up to.\n @param fragment_limit for the number of fragments to be consumed during one polling operation.\n @return the number of fragments that have been consumed or -1 for error."]
    pub fn aeron_image_bounded_controlled_poll(
        image: *mut aeron_image_t,
        handler: aeron_controlled_fragment_handler_t,
        clientd: *mut ::std::os::raw::c_void,
        limit_position: i64,
        fragment_limit: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Peek for new messages in a stream by scanning forward from an initial position. If new messages are found then\n they will be delivered to the handler up to a limited position.\n <p>\n Use a controlled fragment assembler to assemble messages which span multiple fragments. Scans must also\n start at the beginning of a message so that the assembler is reset.\n\n @param image to peek.\n @param initial_position from which to peek forward.\n @param handler to which message fragments are delivered.\n @param clientd to pass to the handler.\n @param limit_position up to which can be scanned.\n @return the resulting position after the scan terminates which is a complete message or -1 for error."]
    pub fn aeron_image_controlled_peek(
        image: *mut aeron_image_t,
        initial_position: i64,
        handler: aeron_controlled_fragment_handler_t,
        clientd: *mut ::std::os::raw::c_void,
        limit_position: i64,
    ) -> i64;
}
extern "C" {
    #[doc = " Poll for new messages in a stream. If new messages are found beyond the last consumed position then they\n will be delivered to the handler up to a limited number of bytes.\n <p>\n A scan will terminate if a padding frame is encountered. If first frame in a scan is padding then a block\n for the padding is notified. If the padding comes after the first frame in a scan then the scan terminates\n at the offset the padding frame begins. Padding frames are delivered singularly in a block.\n <p>\n Padding frames may be for a greater range than the limit offset but only the header needs to be valid so\n relevant length of the frame is data header length.\n\n @param image to poll.\n @param handler to which block is delivered.\n @param clientd to pass to the handler.\n @param block_length_limit up to which a block may be in length.\n @return the number of bytes that have been consumed or -1 for error."]
    pub fn aeron_image_block_poll(
        image: *mut aeron_image_t,
        handler: aeron_block_handler_t,
        clientd: *mut ::std::os::raw::c_void,
        block_length_limit: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn aeron_image_is_closed(image: *mut aeron_image_t) -> bool;
}
extern "C" {
    #[doc = " Create an image fragment assembler for use with a single image.\n\n @param assembler to be set when created successfully.\n @param delegate to call on completed.\n @param delegate_clientd to pass to delegate handler.\n @return 0 for success and -1 for error."]
    pub fn aeron_image_fragment_assembler_create(
        assembler: *mut *mut aeron_image_fragment_assembler_t,
        delegate: aeron_fragment_handler_t,
        delegate_clientd: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Delete an image fragment assembler.\n\n @param assembler to delete.\n @return 0 for success or -1 for error."]
    pub fn aeron_image_fragment_assembler_delete(
        assembler: *mut aeron_image_fragment_assembler_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Handler function to be passed for handling fragment assembly.\n\n @param clientd passed in the poll call (must be a aeron_image_fragment_assembler_t)\n @param buffer containing the data.\n @param length of the data in bytes.\n @param header representing the meta data for the data."]
    pub fn aeron_image_fragment_assembler_handler(
        clientd: *mut ::std::os::raw::c_void,
        buffer: *const u8,
        length: usize,
        header: *mut aeron_header_t,
    );
}
extern "C" {
    #[doc = " Create an image controlled fragment assembler for use with a single image.\n\n @param assembler to be set when created successfully.\n @param delegate to call on completed\n @param delegate_clientd to pass to delegate handler.\n @return 0 for success and -1 for error."]
    pub fn aeron_image_controlled_fragment_assembler_create(
        assembler: *mut *mut aeron_image_controlled_fragment_assembler_t,
        delegate: aeron_controlled_fragment_handler_t,
        delegate_clientd: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Delete an image controlled fragment assembler.\n\n @param assembler to delete.\n @return 0 for success or -1 for error."]
    pub fn aeron_image_controlled_fragment_assembler_delete(
        assembler: *mut aeron_image_controlled_fragment_assembler_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Handler function to be passed for handling fragment assembly.\n\n @param clientd passed in the poll call (must be a aeron_image_controlled_fragment_assembler_t)\n @param buffer containing the data.\n @param length of the data in bytes.\n @param header representing the meta data for the data.\n @return The action to be taken with regard to the stream position after the callback."]
    pub fn aeron_controlled_image_fragment_assembler_handler(
        clientd: *mut ::std::os::raw::c_void,
        buffer: *const u8,
        length: usize,
        header: *mut aeron_header_t,
    ) -> aeron_controlled_fragment_handler_action_t;
}
extern "C" {
    #[doc = " Create a fragment assembler for use with a subscription.\n\n @param assembler to be set when created successfully.\n @param delegate to call on completed\n @param delegate_clientd to pass to delegate handler.\n @return 0 for success and -1 for error."]
    pub fn aeron_fragment_assembler_create(
        assembler: *mut *mut aeron_fragment_assembler_t,
        delegate: aeron_fragment_handler_t,
        delegate_clientd: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Delete a fragment assembler.\n\n @param assembler to delete.\n @return 0 for success or -1 for error."]
    pub fn aeron_fragment_assembler_delete(
        assembler: *mut aeron_fragment_assembler_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Handler function to be passed for handling fragment assembly.\n\n @param clientd passed in the poll call (must be a aeron_fragment_assembler_t)\n @param buffer containing the data.\n @param length of the data in bytes.\n @param header representing the meta data for the data."]
    pub fn aeron_fragment_assembler_handler(
        clientd: *mut ::std::os::raw::c_void,
        buffer: *const u8,
        length: usize,
        header: *mut aeron_header_t,
    );
}
extern "C" {
    #[doc = " Create a controlled fragment assembler for use with a subscription.\n\n @param assembler to be set when created successfully.\n @param delegate to call on completed\n @param delegate_clientd to pass to delegate handler.\n @return 0 for success and -1 for error."]
    pub fn aeron_controlled_fragment_assembler_create(
        assembler: *mut *mut aeron_controlled_fragment_assembler_t,
        delegate: aeron_controlled_fragment_handler_t,
        delegate_clientd: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Delete a controlled fragment assembler.\n\n @param assembler to delete.\n @return 0 for success or -1 for error."]
    pub fn aeron_controlled_fragment_assembler_delete(
        assembler: *mut aeron_controlled_fragment_assembler_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Handler function to be passed for handling fragment assembly.\n\n @param clientd passed in the poll call (must be a aeron_controlled_fragment_assembler_t)\n @param buffer containing the data.\n @param length of the data in bytes.\n @param header representing the meta data for the data.\n @return The action to be taken with regard to the stream position after the callback."]
    pub fn aeron_controlled_fragment_assembler_handler(
        clientd: *mut ::std::os::raw::c_void,
        buffer: *const u8,
        length: usize,
        header: *mut aeron_header_t,
    ) -> aeron_controlled_fragment_handler_action_t;
}
extern "C" {
    #[doc = " Return a pointer to the counter value.\n\n @param counter to pointer to.\n @return pointer to the counter value."]
    pub fn aeron_counter_addr(counter: *mut aeron_counter_t) -> *mut i64;
}
#[doc = " Configuration for a counter that does not change during it's lifetime."]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct aeron_counter_constants_stct {
    #[doc = " Return the registration id used to register this counter with the media driver."]
    pub registration_id: i64,
    #[doc = " Identity for the counter within the counters reader and counters manager."]
    pub counter_id: i32,
}
#[test]
fn bindgen_test_layout_aeron_counter_constants_stct() {
    const UNINIT: ::std::mem::MaybeUninit<aeron_counter_constants_stct> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<aeron_counter_constants_stct>(),
        16usize,
        concat!("Size of: ", stringify!(aeron_counter_constants_stct))
    );
    assert_eq!(
        ::std::mem::align_of::<aeron_counter_constants_stct>(),
        8usize,
        concat!("Alignment of ", stringify!(aeron_counter_constants_stct))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).registration_id) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(aeron_counter_constants_stct),
            "::",
            stringify!(registration_id)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).counter_id) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(aeron_counter_constants_stct),
            "::",
            stringify!(counter_id)
        )
    );
}
#[doc = " Configuration for a counter that does not change during it's lifetime."]
pub type aeron_counter_constants_t = aeron_counter_constants_stct;
extern "C" {
    #[doc = " Fill in a structure with the constants in use by a counter.\n\n @param counter to get the constants for.\n @param constants structure to fill in with the constants.\n @return 0 for success and -1 for error."]
    pub fn aeron_counter_constants(
        counter: *mut aeron_counter_t,
        constants: *mut aeron_counter_constants_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Asynchronously close the counter.\n\n @param counter to close.\n @return 0 for success or -1 for error."]
    pub fn aeron_counter_close(
        counter: *mut aeron_counter_t,
        on_close_complete: aeron_notification_t,
        on_close_complete_clientd: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Check if the counter is closed\n @param counter to check\n @return true if closed, false otherwise."]
    pub fn aeron_counter_is_closed(counter: *mut aeron_counter_t) -> bool;
}
extern "C" {
    #[doc = " Return full version and build string.\n\n @return full version and build string."]
    pub fn aeron_version_full() -> *const ::std::os::raw::c_char;
}
extern "C" {
    #[doc = " Return major version number.\n\n @return major version number."]
    pub fn aeron_version_major() -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Return minor version number.\n\n @return minor version number."]
    pub fn aeron_version_minor() -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Return patch version number.\n\n @return patch version number."]
    pub fn aeron_version_patch() -> ::std::os::raw::c_int;
}
#[doc = " Clock function used by aeron."]
pub type aeron_clock_func_t = ::std::option::Option<unsafe extern "C" fn() -> i64>;
extern "C" {
    #[doc = " Return time in nanoseconds for machine. Is not wall clock time.\n\n @return nanoseconds since epoch for machine."]
    pub fn aeron_nano_clock() -> i64;
}
extern "C" {
    #[doc = " Return time in milliseconds since epoch. Is wall clock time.\n\n @return milliseconds since epoch."]
    pub fn aeron_epoch_clock() -> i64;
}
#[doc = " Function to return logging information."]
pub type aeron_log_func_t =
    ::std::option::Option<unsafe extern "C" fn(arg1: *const ::std::os::raw::c_char)>;
extern "C" {
    #[doc = " Determine if an aeron driver is using a given aeron directory.\n\n @param dirname  for aeron directory\n @param timeout_ms  to use to determine activity for aeron directory\n @param log_func to call during activity check to log diagnostic information.\n @return true for active driver or false for no active driver."]
    pub fn aeron_is_driver_active(
        dirname: *const ::std::os::raw::c_char,
        timeout_ms: i64,
        log_func: aeron_log_func_t,
    ) -> bool;
}
extern "C" {
    #[doc = " Load properties from a string containing name=value pairs and set appropriate environment variables for the\n process so that subsequent calls to aeron_driver_context_init will use those values.\n\n @param buffer containing properties and values.\n @return 0 for success and -1 for error."]
    pub fn aeron_properties_buffer_load(
        buffer: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Load properties file and set appropriate environment variables for the process so that subsequent\n calls to aeron_driver_context_init will use those values.\n\n @param filename to load.\n @return 0 for success and -1 for error."]
    pub fn aeron_properties_file_load(
        filename: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Load properties from HTTP URL and set environment variables for the process so that subsequent\n calls to aeron_driver_context_init will use those values.\n\n @param url to attempt to retrieve and load.\n @return 0 for success and -1 for error."]
    pub fn aeron_properties_http_load(url: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Load properties based on URL or filename. If string contains file or http URL, it will attempt\n to load properties from a file or http as indicated. If not a URL, then it will try to load the string\n as a filename.\n\n @param url_or_filename to load properties from.\n @return 0 for success and -1 for error."]
    pub fn aeron_properties_load(
        url_or_filename: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Return current aeron error code (errno) for calling thread.\n\n @return aeron error code for calling thread."]
    pub fn aeron_errcode() -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Return the current aeron error message for calling thread.\n\n @return aeron error message for calling thread."]
    pub fn aeron_errmsg() -> *const ::std::os::raw::c_char;
}
extern "C" {
    #[doc = " Get the default path used by the Aeron media driver.\n\n @param path buffer to store the path.\n @param path_length space available in the buffer\n @return -1 if there is an issue or the number of bytes written to path excluding the terminator `\\0`. If this\n is equal to or greater than the path_length then the path has been truncated."]
    pub fn aeron_default_path(
        path: *mut ::std::os::raw::c_char,
        path_length: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Gets the registration id for addition of the counter. Note that using this after a call to poll the succeeds or\n errors is undefined behaviour. As the async_add_counter_t may have been freed.\n\n @param add_counter used to check for completion.\n @return registration id for the counter."]
    pub fn aeron_async_add_counter_get_registration_id(
        add_counter: *mut aeron_async_add_counter_t,
    ) -> i64;
}
extern "C" {
    #[doc = " Gets the registration id for addition of the publication. Note that using this after a call to poll the succeeds or\n errors is undefined behaviour. As the async_add_publication_t may have been freed.\n\n @param add_publication used to check for completion.\n @return registration id for the publication."]
    pub fn aeron_async_add_publication_get_registration_id(
        add_publication: *mut aeron_async_add_publication_t,
    ) -> i64;
}
extern "C" {
    #[doc = " Gets the registration id for addition of the exclusive_publication. Note that using this after a call to poll the\n succeeds or errors is undefined behaviour. As the async_add_exclusive_publication_t may have been freed.\n\n @param add_exclusive_publication used to check for completion.\n @return registration id for the exclusive_publication."]
    pub fn aeron_async_add_exclusive_exclusive_publication_get_registration_id(
        add_exclusive_publication: *mut aeron_async_add_exclusive_publication_t,
    ) -> i64;
}
extern "C" {
    #[doc = " Gets the registration id for addition of the subscription. Note that using this after a call to poll the succeeds or\n errors is undefined behaviour. As the async_add_subscription_t may have been freed.\n\n @param add_subscription used to check for completion.\n @return registration id for the subscription."]
    pub fn aeron_async_add_subscription_get_registration_id(
        add_subscription: *mut aeron_async_add_subscription_t,
    ) -> i64;
}
extern "C" {
    #[doc = " Gets the registration_id for the destination command supplied. Note that this is the correlation_id used for\n the specified destination command, not the registration_id for the original parent resource (publication,\n subscription).\n\n @param async_destination tracking the current destination command.\n @return correlation_id sent to driver."]
    pub fn aeron_async_destination_get_registration_id(
        async_destination: *mut aeron_async_destination_t,
    ) -> i64;
}
extern "C" {
    #[doc = " Request the media driver terminates operation and closes all resources.\n\n @param directory    in which the media driver is running.\n @param token_buffer containing the authentication token confirming the client is allowed to terminate the driver.\n @param token_length of the token in the buffer.\n @return"]
    pub fn aeron_context_request_driver_termination(
        directory: *const ::std::os::raw::c_char,
        token_buffer: *const u8,
        token_length: usize,
    ) -> ::std::os::raw::c_int;
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct aeron_cnc_stct {
    _unused: [u8; 0],
}
pub type aeron_cnc_t = aeron_cnc_stct;
#[repr(C, packed(4))]
#[derive(Copy, Clone)]
pub struct aeron_cnc_constants_stct {
    pub cnc_version: i32,
    pub to_driver_buffer_length: i32,
    pub to_clients_buffer_length: i32,
    pub counter_metadata_buffer_length: i32,
    pub counter_values_buffer_length: i32,
    pub error_log_buffer_length: i32,
    pub client_liveness_timeout: i64,
    pub start_timestamp: i64,
    pub pid: i64,
}
#[test]
fn bindgen_test_layout_aeron_cnc_constants_stct() {
    const UNINIT: ::std::mem::MaybeUninit<aeron_cnc_constants_stct> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<aeron_cnc_constants_stct>(),
        48usize,
        concat!("Size of: ", stringify!(aeron_cnc_constants_stct))
    );
    assert_eq!(
        ::std::mem::align_of::<aeron_cnc_constants_stct>(),
        4usize,
        concat!("Alignment of ", stringify!(aeron_cnc_constants_stct))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).cnc_version) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(aeron_cnc_constants_stct),
            "::",
            stringify!(cnc_version)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).to_driver_buffer_length) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(aeron_cnc_constants_stct),
            "::",
            stringify!(to_driver_buffer_length)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).to_clients_buffer_length) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(aeron_cnc_constants_stct),
            "::",
            stringify!(to_clients_buffer_length)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).counter_metadata_buffer_length) as usize - ptr as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(aeron_cnc_constants_stct),
            "::",
            stringify!(counter_metadata_buffer_length)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).counter_values_buffer_length) as usize - ptr as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(aeron_cnc_constants_stct),
            "::",
            stringify!(counter_values_buffer_length)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).error_log_buffer_length) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(aeron_cnc_constants_stct),
            "::",
            stringify!(error_log_buffer_length)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).client_liveness_timeout) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(aeron_cnc_constants_stct),
            "::",
            stringify!(client_liveness_timeout)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).start_timestamp) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(aeron_cnc_constants_stct),
            "::",
            stringify!(start_timestamp)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pid) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(aeron_cnc_constants_stct),
            "::",
            stringify!(pid)
        )
    );
}
pub type aeron_cnc_constants_t = aeron_cnc_constants_stct;
extern "C" {
    #[doc = " Initialise an aeron_cnc, which gives user level access to the command and control file used to communicate\n with the media driver. Will wait until the media driver has loaded and the cnc file is created, up to timeout_ms.\n Use a value of 0 for a non-blocking initialisation.\n\n @param aeron_cnc to hold the loaded aeron_cnc\n @param base_path media driver's base path\n @param timeout_ms Number of milliseconds to wait before timing out.\n @return 0 on success, -1 on failure."]
    pub fn aeron_cnc_init(
        aeron_cnc: *mut *mut aeron_cnc_t,
        base_path: *const ::std::os::raw::c_char,
        timeout_ms: i64,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Fetch the sets of constant values associated with this command and control file.\n\n @param aeron_cnc to query\n @param constants user supplied structure to hold return values.\n @return 0 on success, -1 on failure."]
    pub fn aeron_cnc_constants(
        aeron_cnc: *mut aeron_cnc_t,
        constants: *mut aeron_cnc_constants_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Get the current file name of the cnc file.\n\n @param aeron_cnc to query\n @return name of the cnc file"]
    pub fn aeron_cnc_filename(aeron_cnc: *mut aeron_cnc_t) -> *const ::std::os::raw::c_char;
}
extern "C" {
    #[doc = " Gets the timestamp of the last heartbeat sent to the media driver from any client.\n\n @param aeron_cnc to query\n @return last heartbeat timestamp in ms."]
    pub fn aeron_cnc_to_driver_heartbeat(aeron_cnc: *mut aeron_cnc_t) -> i64;
}
pub type aeron_error_log_reader_func_t = ::std::option::Option<
    unsafe extern "C" fn(
        observation_count: i32,
        first_observation_timestamp: i64,
        last_observation_timestamp: i64,
        error: *const ::std::os::raw::c_char,
        error_length: usize,
        clientd: *mut ::std::os::raw::c_void,
    ),
>;
extern "C" {
    #[doc = " Reads the current error log for this driver.\n\n @param aeron_cnc to query\n @param callback called for every distinct error observation\n @param clientd client data to be passed to the callback\n @param since_timestamp only return errors after this timestamp (0 returns all)\n @return the number of distinct errors seen"]
    pub fn aeron_cnc_error_log_read(
        aeron_cnc: *mut aeron_cnc_t,
        callback: aeron_error_log_reader_func_t,
        clientd: *mut ::std::os::raw::c_void,
        since_timestamp: i64,
    ) -> usize;
}
extern "C" {
    #[doc = " Gets a counters reader for this command and control file. This does not need to be closed manually, resources\n are tied to the instance of aeron_cnc.\n\n @param aeron_cnc to query\n @return pointer to a counters reader."]
    pub fn aeron_cnc_counters_reader(aeron_cnc: *mut aeron_cnc_t) -> *mut aeron_counters_reader_t;
}
pub type aeron_loss_reporter_read_entry_func_t = ::std::option::Option<
    unsafe extern "C" fn(
        clientd: *mut ::std::os::raw::c_void,
        observation_count: i64,
        total_bytes_lost: i64,
        first_observation_timestamp: i64,
        last_observation_timestamp: i64,
        session_id: i32,
        stream_id: i32,
        channel: *const ::std::os::raw::c_char,
        channel_length: i32,
        source: *const ::std::os::raw::c_char,
        source_length: i32,
    ),
>;
extern "C" {
    #[doc = " Read all of the data loss observations from the report in the same media driver instances as the cnc file.\n\n @param aeron_cnc to query\n @param entry_func callback for each observation found\n @param clientd client data to be passed to the callback.\n @return -1 on failure, number of observations on success (could be 0)."]
    pub fn aeron_cnc_loss_reporter_read(
        aeron_cnc: *mut aeron_cnc_t,
        entry_func: aeron_loss_reporter_read_entry_func_t,
        clientd: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Closes the instance of the aeron cnc and frees its resources.\n\n @param aeron_cnc to close"]
    pub fn aeron_cnc_close(aeron_cnc: *mut aeron_cnc_t);
}
extern "C" {
    pub fn aeron_randomised_int32() -> i32;
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct aeron_clock_cache_stct {
    pub pre_pad: [u8; 56usize],
    pub cached_epoch_time: i64,
    pub cached_nano_time: i64,
    pub post_pad: [u8; 56usize],
}
#[test]
fn bindgen_test_layout_aeron_clock_cache_stct() {
    const UNINIT: ::std::mem::MaybeUninit<aeron_clock_cache_stct> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<aeron_clock_cache_stct>(),
        128usize,
        concat!("Size of: ", stringify!(aeron_clock_cache_stct))
    );
    assert_eq!(
        ::std::mem::align_of::<aeron_clock_cache_stct>(),
        8usize,
        concat!("Alignment of ", stringify!(aeron_clock_cache_stct))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pre_pad) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(aeron_clock_cache_stct),
            "::",
            stringify!(pre_pad)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).cached_epoch_time) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(aeron_clock_cache_stct),
            "::",
            stringify!(cached_epoch_time)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).cached_nano_time) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(aeron_clock_cache_stct),
            "::",
            stringify!(cached_nano_time)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).post_pad) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(aeron_clock_cache_stct),
            "::",
            stringify!(post_pad)
        )
    );
}
pub type aeron_clock_cache_t = aeron_clock_cache_stct;
extern "C" {
    #[doc = " Update the cached clock with the current epoch and nano time values.\n\n @param cached_clock 'this'\n @param epoch_time current ms since epoch.\n @param nano_time current ns time."]
    pub fn aeron_clock_update_cached_time(
        cached_clock: *mut aeron_clock_cache_t,
        epoch_time: i64,
        nano_time: i64,
    );
}
extern "C" {
    #[doc = " Update the cached clock with the current epoch time value.\n\n @param cached_clock 'this'\n @param epoch_time current ms since epoch."]
    pub fn aeron_clock_update_cached_epoch_time(
        cached_clock: *mut aeron_clock_cache_t,
        epoch_time: i64,
    );
}
extern "C" {
    #[doc = " Update the cached clock with the current nano time value.\n\n @param cached_clock 'this'\n @param nano_time current ns time."]
    pub fn aeron_clock_update_cached_nano_time(
        cached_clock: *mut aeron_clock_cache_t,
        nano_time: i64,
    );
}
extern "C" {
    #[doc = " Retrieves the cached epoch time from supplied cached clock.\n\n @param cached_clock 'this'\n @return The current cached value for the epoch time."]
    pub fn aeron_clock_cached_epoch_time(cached_clock: *mut aeron_clock_cache_t) -> i64;
}
extern "C" {
    #[doc = " Retrieves the cached nano time from supplied cached clock.\n\n @param cached_clock 'this'\n @return The current cached value for the nano time."]
    pub fn aeron_clock_cached_nano_time(cached_clock: *mut aeron_clock_cache_t) -> i64;
}
extern "C" {
    #[doc = " Allocate a cached clock.\n\n @param cached_clock Pointer to the pointer to be initialised with the new cached clock\n @return -1 if allocation fails, e.g. out of memory."]
    pub fn aeron_clock_cache_alloc(
        cached_clock: *mut *mut aeron_clock_cache_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Get the realtime from the system in timespec format\n\n @param time value to fill with the current time\n @return 0 on success, -1 on failure."]
    pub fn aeron_clock_gettime_realtime(time: *mut timespec) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn aeron_thread_set_name(role_name: *const ::std::os::raw::c_char);
}
extern "C" {
    pub fn aeron_nano_sleep(nanoseconds: u64);
}
extern "C" {
    pub fn aeron_micro_sleep(microseconds: ::std::os::raw::c_uint);
}
extern "C" {
    pub fn aeron_thread_set_affinity(
        role_name: *const ::std::os::raw::c_char,
        cpu_affinity_no: u8,
    ) -> ::std::os::raw::c_int;
}
pub type aeron_mutex_t = pthread_mutex_t;
pub type aeron_thread_t = pthread_t;
#[repr(C, packed(4))]
#[derive(Copy, Clone)]
pub struct aeron_error_log_entry_stct {
    pub length: i32,
    pub observation_count: i32,
    pub last_observation_timestamp: i64,
    pub first_observation_timestamp: i64,
}
#[test]
fn bindgen_test_layout_aeron_error_log_entry_stct() {
    const UNINIT: ::std::mem::MaybeUninit<aeron_error_log_entry_stct> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<aeron_error_log_entry_stct>(),
        24usize,
        concat!("Size of: ", stringify!(aeron_error_log_entry_stct))
    );
    assert_eq!(
        ::std::mem::align_of::<aeron_error_log_entry_stct>(),
        4usize,
        concat!("Alignment of ", stringify!(aeron_error_log_entry_stct))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).length) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(aeron_error_log_entry_stct),
            "::",
            stringify!(length)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).observation_count) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(aeron_error_log_entry_stct),
            "::",
            stringify!(observation_count)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).last_observation_timestamp) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(aeron_error_log_entry_stct),
            "::",
            stringify!(last_observation_timestamp)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).first_observation_timestamp) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(aeron_error_log_entry_stct),
            "::",
            stringify!(first_observation_timestamp)
        )
    );
}
pub type aeron_error_log_entry_t = aeron_error_log_entry_stct;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct aeron_distinct_observation_stct {
    pub description: *const ::std::os::raw::c_char,
    pub error_code: ::std::os::raw::c_int,
    pub offset: usize,
    pub description_length: usize,
}
#[test]
fn bindgen_test_layout_aeron_distinct_observation_stct() {
    const UNINIT: ::std::mem::MaybeUninit<aeron_distinct_observation_stct> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<aeron_distinct_observation_stct>(),
        32usize,
        concat!("Size of: ", stringify!(aeron_distinct_observation_stct))
    );
    assert_eq!(
        ::std::mem::align_of::<aeron_distinct_observation_stct>(),
        8usize,
        concat!("Alignment of ", stringify!(aeron_distinct_observation_stct))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).description) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(aeron_distinct_observation_stct),
            "::",
            stringify!(description)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).error_code) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(aeron_distinct_observation_stct),
            "::",
            stringify!(error_code)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).offset) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(aeron_distinct_observation_stct),
            "::",
            stringify!(offset)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).description_length) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(aeron_distinct_observation_stct),
            "::",
            stringify!(description_length)
        )
    );
}
pub type aeron_distinct_observation_t = aeron_distinct_observation_stct;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct aeron_distinct_error_log_observation_list_stct {
    pub num_observations: u64,
    pub observations: *mut aeron_distinct_observation_t,
}
#[test]
fn bindgen_test_layout_aeron_distinct_error_log_observation_list_stct() {
    const UNINIT: ::std::mem::MaybeUninit<aeron_distinct_error_log_observation_list_stct> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<aeron_distinct_error_log_observation_list_stct>(),
        16usize,
        concat!(
            "Size of: ",
            stringify!(aeron_distinct_error_log_observation_list_stct)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<aeron_distinct_error_log_observation_list_stct>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(aeron_distinct_error_log_observation_list_stct)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).num_observations) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(aeron_distinct_error_log_observation_list_stct),
            "::",
            stringify!(num_observations)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).observations) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(aeron_distinct_error_log_observation_list_stct),
            "::",
            stringify!(observations)
        )
    );
}
pub type aeron_distinct_error_log_observation_list_t =
    aeron_distinct_error_log_observation_list_stct;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct aeron_distinct_error_log_stct {
    pub buffer: *mut u8,
    pub observation_list: *mut aeron_distinct_error_log_observation_list_t,
    pub buffer_capacity: usize,
    pub next_offset: usize,
    pub clock: aeron_clock_func_t,
    pub mutex: aeron_mutex_t,
}
#[test]
fn bindgen_test_layout_aeron_distinct_error_log_stct() {
    const UNINIT: ::std::mem::MaybeUninit<aeron_distinct_error_log_stct> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<aeron_distinct_error_log_stct>(),
        80usize,
        concat!("Size of: ", stringify!(aeron_distinct_error_log_stct))
    );
    assert_eq!(
        ::std::mem::align_of::<aeron_distinct_error_log_stct>(),
        8usize,
        concat!("Alignment of ", stringify!(aeron_distinct_error_log_stct))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).buffer) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(aeron_distinct_error_log_stct),
            "::",
            stringify!(buffer)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).observation_list) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(aeron_distinct_error_log_stct),
            "::",
            stringify!(observation_list)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).buffer_capacity) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(aeron_distinct_error_log_stct),
            "::",
            stringify!(buffer_capacity)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).next_offset) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(aeron_distinct_error_log_stct),
            "::",
            stringify!(next_offset)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).clock) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(aeron_distinct_error_log_stct),
            "::",
            stringify!(clock)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mutex) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(aeron_distinct_error_log_stct),
            "::",
            stringify!(mutex)
        )
    );
}
pub type aeron_distinct_error_log_t = aeron_distinct_error_log_stct;
extern "C" {
    pub fn aeron_distinct_error_log_init(
        log: *mut aeron_distinct_error_log_t,
        buffer: *mut u8,
        buffer_size: usize,
        clock: aeron_clock_func_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn aeron_distinct_error_log_close(log: *mut aeron_distinct_error_log_t);
}
extern "C" {
    pub fn aeron_distinct_error_log_record(
        log: *mut aeron_distinct_error_log_t,
        error_code: ::std::os::raw::c_int,
        description: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn aeron_error_log_exists(buffer: *const u8, buffer_size: usize) -> bool;
}
extern "C" {
    pub fn aeron_error_log_read(
        buffer: *const u8,
        buffer_size: usize,
        reader: aeron_error_log_reader_func_t,
        clientd: *mut ::std::os::raw::c_void,
        since_timestamp: i64,
    ) -> usize;
}
extern "C" {
    pub fn aeron_distinct_error_log_num_observations(log: *mut aeron_distinct_error_log_t)
        -> usize;
}
pub type aeron_idle_strategy_func_t = ::std::option::Option<
    unsafe extern "C" fn(state: *mut ::std::os::raw::c_void, work_count: ::std::os::raw::c_int),
>;
pub type aeron_idle_strategy_init_func_t = ::std::option::Option<
    unsafe extern "C" fn(
        state: *mut *mut ::std::os::raw::c_void,
        env_var: *const ::std::os::raw::c_char,
        init_args: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int,
>;
extern "C" {
    pub fn aeron_semantic_version_compose(major: u8, minor: u8, patch: u8) -> i32;
}
extern "C" {
    pub fn aeron_semantic_version_major(version: i32) -> u8;
}
extern "C" {
    pub fn aeron_semantic_version_minor(version: i32) -> u8;
}
extern "C" {
    pub fn aeron_semantic_version_patch(version: i32) -> u8;
}
pub type aeron_fptr_t = ::std::option::Option<unsafe extern "C" fn()>;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct aeron_uri_param_stct {
    pub key: *const ::std::os::raw::c_char,
    pub value: *const ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_aeron_uri_param_stct() {
    const UNINIT: ::std::mem::MaybeUninit<aeron_uri_param_stct> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<aeron_uri_param_stct>(),
        16usize,
        concat!("Size of: ", stringify!(aeron_uri_param_stct))
    );
    assert_eq!(
        ::std::mem::align_of::<aeron_uri_param_stct>(),
        8usize,
        concat!("Alignment of ", stringify!(aeron_uri_param_stct))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).key) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(aeron_uri_param_stct),
            "::",
            stringify!(key)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).value) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(aeron_uri_param_stct),
            "::",
            stringify!(value)
        )
    );
}
pub type aeron_uri_param_t = aeron_uri_param_stct;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct aeron_uri_params_stct {
    pub length: usize,
    pub array: *mut aeron_uri_param_t,
}
#[test]
fn bindgen_test_layout_aeron_uri_params_stct() {
    const UNINIT: ::std::mem::MaybeUninit<aeron_uri_params_stct> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<aeron_uri_params_stct>(),
        16usize,
        concat!("Size of: ", stringify!(aeron_uri_params_stct))
    );
    assert_eq!(
        ::std::mem::align_of::<aeron_uri_params_stct>(),
        8usize,
        concat!("Alignment of ", stringify!(aeron_uri_params_stct))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).length) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(aeron_uri_params_stct),
            "::",
            stringify!(length)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).array) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(aeron_uri_params_stct),
            "::",
            stringify!(array)
        )
    );
}
pub type aeron_uri_params_t = aeron_uri_params_stct;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct aeron_udp_channel_params_stct {
    pub endpoint: *const ::std::os::raw::c_char,
    pub bind_interface: *const ::std::os::raw::c_char,
    pub control: *const ::std::os::raw::c_char,
    pub control_mode: *const ::std::os::raw::c_char,
    pub channel_tag: *const ::std::os::raw::c_char,
    pub entity_tag: *const ::std::os::raw::c_char,
    pub ttl: *const ::std::os::raw::c_char,
    pub additional_params: aeron_uri_params_t,
}
#[test]
fn bindgen_test_layout_aeron_udp_channel_params_stct() {
    const UNINIT: ::std::mem::MaybeUninit<aeron_udp_channel_params_stct> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<aeron_udp_channel_params_stct>(),
        72usize,
        concat!("Size of: ", stringify!(aeron_udp_channel_params_stct))
    );
    assert_eq!(
        ::std::mem::align_of::<aeron_udp_channel_params_stct>(),
        8usize,
        concat!("Alignment of ", stringify!(aeron_udp_channel_params_stct))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).endpoint) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(aeron_udp_channel_params_stct),
            "::",
            stringify!(endpoint)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bind_interface) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(aeron_udp_channel_params_stct),
            "::",
            stringify!(bind_interface)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).control) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(aeron_udp_channel_params_stct),
            "::",
            stringify!(control)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).control_mode) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(aeron_udp_channel_params_stct),
            "::",
            stringify!(control_mode)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).channel_tag) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(aeron_udp_channel_params_stct),
            "::",
            stringify!(channel_tag)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).entity_tag) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(aeron_udp_channel_params_stct),
            "::",
            stringify!(entity_tag)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ttl) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(aeron_udp_channel_params_stct),
            "::",
            stringify!(ttl)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).additional_params) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(aeron_udp_channel_params_stct),
            "::",
            stringify!(additional_params)
        )
    );
}
pub type aeron_udp_channel_params_t = aeron_udp_channel_params_stct;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct aeron_ipc_channel_params_stct {
    pub channel_tag: *const ::std::os::raw::c_char,
    pub entity_tag: *const ::std::os::raw::c_char,
    pub additional_params: aeron_uri_params_t,
}
#[test]
fn bindgen_test_layout_aeron_ipc_channel_params_stct() {
    const UNINIT: ::std::mem::MaybeUninit<aeron_ipc_channel_params_stct> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<aeron_ipc_channel_params_stct>(),
        32usize,
        concat!("Size of: ", stringify!(aeron_ipc_channel_params_stct))
    );
    assert_eq!(
        ::std::mem::align_of::<aeron_ipc_channel_params_stct>(),
        8usize,
        concat!("Alignment of ", stringify!(aeron_ipc_channel_params_stct))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).channel_tag) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(aeron_ipc_channel_params_stct),
            "::",
            stringify!(channel_tag)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).entity_tag) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(aeron_ipc_channel_params_stct),
            "::",
            stringify!(entity_tag)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).additional_params) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(aeron_ipc_channel_params_stct),
            "::",
            stringify!(additional_params)
        )
    );
}
pub type aeron_ipc_channel_params_t = aeron_ipc_channel_params_stct;
pub mod aeron_uri_type_enum {
    pub type Type = ::std::os::raw::c_uint;
    pub const AERON_URI_UDP: Type = 0;
    pub const AERON_URI_IPC: Type = 1;
    pub const AERON_URI_UNKNOWN: Type = 2;
}
pub use self::aeron_uri_type_enum::Type as aeron_uri_type_t;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct aeron_uri_stct {
    pub mutable_uri: [::std::os::raw::c_char; 384usize],
    pub type_: aeron_uri_type_t,
    pub params: aeron_uri_stct__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union aeron_uri_stct__bindgen_ty_1 {
    pub udp: aeron_udp_channel_params_t,
    pub ipc: aeron_ipc_channel_params_t,
}
#[test]
fn bindgen_test_layout_aeron_uri_stct__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<aeron_uri_stct__bindgen_ty_1> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<aeron_uri_stct__bindgen_ty_1>(),
        72usize,
        concat!("Size of: ", stringify!(aeron_uri_stct__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<aeron_uri_stct__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(aeron_uri_stct__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).udp) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(aeron_uri_stct__bindgen_ty_1),
            "::",
            stringify!(udp)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ipc) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(aeron_uri_stct__bindgen_ty_1),
            "::",
            stringify!(ipc)
        )
    );
}
#[test]
fn bindgen_test_layout_aeron_uri_stct() {
    const UNINIT: ::std::mem::MaybeUninit<aeron_uri_stct> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<aeron_uri_stct>(),
        464usize,
        concat!("Size of: ", stringify!(aeron_uri_stct))
    );
    assert_eq!(
        ::std::mem::align_of::<aeron_uri_stct>(),
        8usize,
        concat!("Alignment of ", stringify!(aeron_uri_stct))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mutable_uri) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(aeron_uri_stct),
            "::",
            stringify!(mutable_uri)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        384usize,
        concat!(
            "Offset of field: ",
            stringify!(aeron_uri_stct),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).params) as usize - ptr as usize },
        392usize,
        concat!(
            "Offset of field: ",
            stringify!(aeron_uri_stct),
            "::",
            stringify!(params)
        )
    );
}
pub type aeron_uri_t = aeron_uri_stct;
pub const aeron_uri_ats_status_en_AERON_URI_ATS_STATUS_DEFAULT: aeron_uri_ats_status_en = 0;
pub const aeron_uri_ats_status_en_AERON_URI_ATS_STATUS_ENABLED: aeron_uri_ats_status_en = 1;
pub const aeron_uri_ats_status_en_AERON_URI_ATS_STATUS_DISABLED: aeron_uri_ats_status_en = 2;
pub type aeron_uri_ats_status_en = ::std::os::raw::c_uint;
pub use self::aeron_uri_ats_status_en as aeron_uri_ats_status_t;
pub type aeron_uri_parse_callback_t = ::std::option::Option<
    unsafe extern "C" fn(
        clientd: *mut ::std::os::raw::c_void,
        key: *const ::std::os::raw::c_char,
        value: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int,
>;
extern "C" {
    pub fn aeron_uri_parse_params(
        uri: *mut ::std::os::raw::c_char,
        param_func: aeron_uri_parse_callback_t,
        clientd: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn aeron_udp_uri_parse(
        uri: *mut ::std::os::raw::c_char,
        params: *mut aeron_udp_channel_params_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn aeron_ipc_uri_parse(
        uri: *mut ::std::os::raw::c_char,
        params: *mut aeron_ipc_channel_params_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn aeron_uri_parse(
        uri_length: usize,
        uri: *const ::std::os::raw::c_char,
        params: *mut aeron_uri_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn aeron_uri_close(params: *mut aeron_uri_t);
}
extern "C" {
    pub fn aeron_uri_multicast_ttl(uri: *mut aeron_uri_t) -> u8;
}
extern "C" {
    pub fn aeron_uri_find_param_value(
        uri_params: *const aeron_uri_params_t,
        key: *const ::std::os::raw::c_char,
    ) -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn aeron_uri_get_int32(
        uri_params: *mut aeron_uri_params_t,
        key: *const ::std::os::raw::c_char,
        retval: *mut i32,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn aeron_uri_get_int64(
        uri_params: *mut aeron_uri_params_t,
        key: *const ::std::os::raw::c_char,
        retval: *mut i64,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn aeron_uri_get_bool(
        uri_params: *mut aeron_uri_params_t,
        key: *const ::std::os::raw::c_char,
        retval: *mut bool,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn aeron_uri_get_ats(
        uri_params: *mut aeron_uri_params_t,
        uri_ats_status: *mut aeron_uri_ats_status_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn aeron_uri_sprint(
        uri: *mut aeron_uri_t,
        buffer: *mut ::std::os::raw::c_char,
        buffer_len: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn aeron_uri_get_socket_buf_lengths(
        uri_params: *mut aeron_uri_params_t,
        socket_sndbuf_length: *mut usize,
        socket_rcvbuf_length: *mut usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn aeron_uri_get_receiver_window_length(
        uri_params: *mut aeron_uri_params_t,
        receiver_window_length: *mut usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn aeron_uri_parse_tag(tag_str: *const ::std::os::raw::c_char) -> i64;
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct aeron_driver_managed_resource_stct {
    pub registration_id: i64,
    pub time_of_last_state_change_ns: i64,
    pub clientd: *mut ::std::os::raw::c_void,
    pub decref: ::std::option::Option<unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void)>,
    pub incref: ::std::option::Option<unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void)>,
}
#[test]
fn bindgen_test_layout_aeron_driver_managed_resource_stct() {
    const UNINIT: ::std::mem::MaybeUninit<aeron_driver_managed_resource_stct> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<aeron_driver_managed_resource_stct>(),
        40usize,
        concat!("Size of: ", stringify!(aeron_driver_managed_resource_stct))
    );
    assert_eq!(
        ::std::mem::align_of::<aeron_driver_managed_resource_stct>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(aeron_driver_managed_resource_stct)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).registration_id) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(aeron_driver_managed_resource_stct),
            "::",
            stringify!(registration_id)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).time_of_last_state_change_ns) as usize - ptr as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(aeron_driver_managed_resource_stct),
            "::",
            stringify!(time_of_last_state_change_ns)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).clientd) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(aeron_driver_managed_resource_stct),
            "::",
            stringify!(clientd)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).decref) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(aeron_driver_managed_resource_stct),
            "::",
            stringify!(decref)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).incref) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(aeron_driver_managed_resource_stct),
            "::",
            stringify!(incref)
        )
    );
}
pub type aeron_driver_managed_resource_t = aeron_driver_managed_resource_stct;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct aeron_position_stct {
    pub counter_id: i32,
    pub value_addr: *mut i64,
}
#[test]
fn bindgen_test_layout_aeron_position_stct() {
    const UNINIT: ::std::mem::MaybeUninit<aeron_position_stct> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<aeron_position_stct>(),
        16usize,
        concat!("Size of: ", stringify!(aeron_position_stct))
    );
    assert_eq!(
        ::std::mem::align_of::<aeron_position_stct>(),
        8usize,
        concat!("Alignment of ", stringify!(aeron_position_stct))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).counter_id) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(aeron_position_stct),
            "::",
            stringify!(counter_id)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).value_addr) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(aeron_position_stct),
            "::",
            stringify!(value_addr)
        )
    );
}
pub type aeron_position_t = aeron_position_stct;
pub type aeron_atomic_counter_t = aeron_position_stct;
pub mod aeron_subscription_tether_state_enum {
    pub type Type = ::std::os::raw::c_uint;
    pub const AERON_SUBSCRIPTION_TETHER_ACTIVE: Type = 0;
    pub const AERON_SUBSCRIPTION_TETHER_LINGER: Type = 1;
    pub const AERON_SUBSCRIPTION_TETHER_RESTING: Type = 2;
}
pub use self::aeron_subscription_tether_state_enum::Type as aeron_subscription_tether_state_t;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct aeron_tetherable_position_stct {
    pub is_tether: bool,
    pub state: aeron_subscription_tether_state_t,
    pub counter_id: i32,
    pub value_addr: *mut i64,
    pub subscription_registration_id: i64,
    pub time_of_last_update_ns: i64,
}
#[test]
fn bindgen_test_layout_aeron_tetherable_position_stct() {
    const UNINIT: ::std::mem::MaybeUninit<aeron_tetherable_position_stct> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<aeron_tetherable_position_stct>(),
        40usize,
        concat!("Size of: ", stringify!(aeron_tetherable_position_stct))
    );
    assert_eq!(
        ::std::mem::align_of::<aeron_tetherable_position_stct>(),
        8usize,
        concat!("Alignment of ", stringify!(aeron_tetherable_position_stct))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).is_tether) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(aeron_tetherable_position_stct),
            "::",
            stringify!(is_tether)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).state) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(aeron_tetherable_position_stct),
            "::",
            stringify!(state)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).counter_id) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(aeron_tetherable_position_stct),
            "::",
            stringify!(counter_id)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).value_addr) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(aeron_tetherable_position_stct),
            "::",
            stringify!(value_addr)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).subscription_registration_id) as usize - ptr as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(aeron_tetherable_position_stct),
            "::",
            stringify!(subscription_registration_id)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).time_of_last_update_ns) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(aeron_tetherable_position_stct),
            "::",
            stringify!(time_of_last_update_ns)
        )
    );
}
pub type aeron_tetherable_position_t = aeron_tetherable_position_stct;
pub type aeron_untethered_subscription_state_change_func_t = ::std::option::Option<
    unsafe extern "C" fn(
        tetherable_position: *mut aeron_tetherable_position_t,
        now_ns: i64,
        new_state: aeron_subscription_tether_state_t,
        stream_id: i32,
        session_id: i32,
    ),
>;
extern "C" {
    pub fn aeron_untethered_subscription_state_change(
        tetherable_position: *mut aeron_tetherable_position_t,
        now_ns: i64,
        new_state: aeron_subscription_tether_state_t,
        stream_id: i32,
        session_id: i32,
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct aeron_subscribable_stct {
    pub correlation_id: i64,
    pub length: usize,
    pub capacity: usize,
    pub array: *mut aeron_tetherable_position_t,
    pub add_position_hook_func: ::std::option::Option<
        unsafe extern "C" fn(clientd: *mut ::std::os::raw::c_void, value_addr: *mut i64),
    >,
    pub remove_position_hook_func: ::std::option::Option<
        unsafe extern "C" fn(clientd: *mut ::std::os::raw::c_void, value_addr: *mut i64),
    >,
    pub clientd: *mut ::std::os::raw::c_void,
}
#[test]
fn bindgen_test_layout_aeron_subscribable_stct() {
    const UNINIT: ::std::mem::MaybeUninit<aeron_subscribable_stct> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<aeron_subscribable_stct>(),
        56usize,
        concat!("Size of: ", stringify!(aeron_subscribable_stct))
    );
    assert_eq!(
        ::std::mem::align_of::<aeron_subscribable_stct>(),
        8usize,
        concat!("Alignment of ", stringify!(aeron_subscribable_stct))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).correlation_id) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(aeron_subscribable_stct),
            "::",
            stringify!(correlation_id)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).length) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(aeron_subscribable_stct),
            "::",
            stringify!(length)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).capacity) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(aeron_subscribable_stct),
            "::",
            stringify!(capacity)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).array) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(aeron_subscribable_stct),
            "::",
            stringify!(array)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).add_position_hook_func) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(aeron_subscribable_stct),
            "::",
            stringify!(add_position_hook_func)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).remove_position_hook_func) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(aeron_subscribable_stct),
            "::",
            stringify!(remove_position_hook_func)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).clientd) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(aeron_subscribable_stct),
            "::",
            stringify!(clientd)
        )
    );
}
pub type aeron_subscribable_t = aeron_subscribable_stct;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct aeron_command_base_stct {
    pub func: ::std::option::Option<
        unsafe extern "C" fn(
            clientd: *mut ::std::os::raw::c_void,
            command: *mut ::std::os::raw::c_void,
        ),
    >,
    pub item: *mut ::std::os::raw::c_void,
}
#[test]
fn bindgen_test_layout_aeron_command_base_stct() {
    const UNINIT: ::std::mem::MaybeUninit<aeron_command_base_stct> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<aeron_command_base_stct>(),
        16usize,
        concat!("Size of: ", stringify!(aeron_command_base_stct))
    );
    assert_eq!(
        ::std::mem::align_of::<aeron_command_base_stct>(),
        8usize,
        concat!("Alignment of ", stringify!(aeron_command_base_stct))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).func) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(aeron_command_base_stct),
            "::",
            stringify!(func)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).item) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(aeron_command_base_stct),
            "::",
            stringify!(item)
        )
    );
}
pub type aeron_command_base_t = aeron_command_base_stct;
pub type aeron_feedback_delay_generator_state_t = aeron_feedback_delay_generator_state_stct;
pub type aeron_feedback_delay_generator_func_t = ::std::option::Option<
    unsafe extern "C" fn(state: *mut aeron_feedback_delay_generator_state_t) -> i64,
>;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct aeron_feedback_delay_generator_state_stct {
    pub static_delay: aeron_feedback_delay_generator_state_stct_static_delay_stct,
    pub optimal_delay: aeron_feedback_delay_generator_state_stct_optimal_delay_stct,
    pub should_immediate_feedback: bool,
    pub delay_generator: aeron_feedback_delay_generator_func_t,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct aeron_feedback_delay_generator_state_stct_static_delay_stct {
    pub delay_ns: i64,
}
#[test]
fn bindgen_test_layout_aeron_feedback_delay_generator_state_stct_static_delay_stct() {
    const UNINIT: ::std::mem::MaybeUninit<
        aeron_feedback_delay_generator_state_stct_static_delay_stct,
    > = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<aeron_feedback_delay_generator_state_stct_static_delay_stct>(),
        8usize,
        concat!(
            "Size of: ",
            stringify!(aeron_feedback_delay_generator_state_stct_static_delay_stct)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<aeron_feedback_delay_generator_state_stct_static_delay_stct>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(aeron_feedback_delay_generator_state_stct_static_delay_stct)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).delay_ns) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(aeron_feedback_delay_generator_state_stct_static_delay_stct),
            "::",
            stringify!(delay_ns)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct aeron_feedback_delay_generator_state_stct_optimal_delay_stct {
    pub rand_max: f64,
    pub base_x: f64,
    pub constant_t: f64,
    pub factor_t: f64,
}
#[test]
fn bindgen_test_layout_aeron_feedback_delay_generator_state_stct_optimal_delay_stct() {
    const UNINIT: ::std::mem::MaybeUninit<
        aeron_feedback_delay_generator_state_stct_optimal_delay_stct,
    > = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<aeron_feedback_delay_generator_state_stct_optimal_delay_stct>(),
        32usize,
        concat!(
            "Size of: ",
            stringify!(aeron_feedback_delay_generator_state_stct_optimal_delay_stct)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<aeron_feedback_delay_generator_state_stct_optimal_delay_stct>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(aeron_feedback_delay_generator_state_stct_optimal_delay_stct)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rand_max) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(aeron_feedback_delay_generator_state_stct_optimal_delay_stct),
            "::",
            stringify!(rand_max)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).base_x) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(aeron_feedback_delay_generator_state_stct_optimal_delay_stct),
            "::",
            stringify!(base_x)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).constant_t) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(aeron_feedback_delay_generator_state_stct_optimal_delay_stct),
            "::",
            stringify!(constant_t)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).factor_t) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(aeron_feedback_delay_generator_state_stct_optimal_delay_stct),
            "::",
            stringify!(factor_t)
        )
    );
}
#[test]
fn bindgen_test_layout_aeron_feedback_delay_generator_state_stct() {
    const UNINIT: ::std::mem::MaybeUninit<aeron_feedback_delay_generator_state_stct> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<aeron_feedback_delay_generator_state_stct>(),
        56usize,
        concat!(
            "Size of: ",
            stringify!(aeron_feedback_delay_generator_state_stct)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<aeron_feedback_delay_generator_state_stct>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(aeron_feedback_delay_generator_state_stct)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).static_delay) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(aeron_feedback_delay_generator_state_stct),
            "::",
            stringify!(static_delay)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).optimal_delay) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(aeron_feedback_delay_generator_state_stct),
            "::",
            stringify!(optimal_delay)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).should_immediate_feedback) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(aeron_feedback_delay_generator_state_stct),
            "::",
            stringify!(should_immediate_feedback)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).delay_generator) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(aeron_feedback_delay_generator_state_stct),
            "::",
            stringify!(delay_generator)
        )
    );
}
extern "C" {
    pub fn aeron_driver_subscribable_remove_position(
        subscribable: *mut aeron_subscribable_t,
        counter_id: i32,
    );
}
pub type aeron_on_remove_publication_cleanup_func_t = ::std::option::Option<
    unsafe extern "C" fn(
        session_id: i32,
        stream_id: i32,
        channel_length: usize,
        channel: *const ::std::os::raw::c_char,
    ),
>;
pub type aeron_on_remove_subscription_cleanup_func_t = ::std::option::Option<
    unsafe extern "C" fn(
        id: i64,
        stream_id: i32,
        channel_length: usize,
        channel: *const ::std::os::raw::c_char,
    ),
>;
pub type aeron_on_remove_image_cleanup_func_t = ::std::option::Option<
    unsafe extern "C" fn(
        id: i64,
        session_id: i32,
        stream_id: i32,
        channel_length: usize,
        channel: *const ::std::os::raw::c_char,
    ),
>;
pub type aeron_on_endpoint_change_func_t =
    ::std::option::Option<unsafe extern "C" fn(channel: *const ::std::os::raw::c_void)>;
pub type aeron_driver_context_t = aeron_driver_context_stct;
pub type aeron_driver_t = aeron_driver_stct;
extern "C" {
    pub fn aeron_driver_context_set_dir(
        context: *mut aeron_driver_context_t,
        value: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn aeron_driver_context_get_dir(
        context: *mut aeron_driver_context_t,
    ) -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn aeron_driver_context_set_dir_warn_if_exists(
        context: *mut aeron_driver_context_t,
        value: bool,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn aeron_driver_context_get_dir_warn_if_exists(
        context: *mut aeron_driver_context_t,
    ) -> bool;
}
pub mod aeron_threading_mode_enum {
    pub type Type = ::std::os::raw::c_uint;
    pub const AERON_THREADING_MODE_DEDICATED: Type = 0;
    pub const AERON_THREADING_MODE_SHARED_NETWORK: Type = 1;
    pub const AERON_THREADING_MODE_SHARED: Type = 2;
    pub const AERON_THREADING_MODE_INVOKER: Type = 3;
}
pub use self::aeron_threading_mode_enum::Type as aeron_threading_mode_t;
extern "C" {
    pub fn aeron_driver_context_set_threading_mode(
        context: *mut aeron_driver_context_t,
        mode: aeron_threading_mode_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn aeron_driver_context_get_threading_mode(
        context: *mut aeron_driver_context_t,
    ) -> aeron_threading_mode_t;
}
extern "C" {
    pub fn aeron_driver_context_set_dir_delete_on_start(
        context: *mut aeron_driver_context_t,
        value: bool,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn aeron_driver_context_get_dir_delete_on_start(
        context: *mut aeron_driver_context_t,
    ) -> bool;
}
extern "C" {
    pub fn aeron_driver_context_set_dir_delete_on_shutdown(
        context: *mut aeron_driver_context_t,
        value: bool,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn aeron_driver_context_get_dir_delete_on_shutdown(
        context: *mut aeron_driver_context_t,
    ) -> bool;
}
extern "C" {
    pub fn aeron_driver_context_set_to_conductor_buffer_length(
        context: *mut aeron_driver_context_t,
        length: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn aeron_driver_context_get_to_conductor_buffer_length(
        context: *mut aeron_driver_context_t,
    ) -> usize;
}
extern "C" {
    pub fn aeron_driver_context_set_to_clients_buffer_length(
        context: *mut aeron_driver_context_t,
        length: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn aeron_driver_context_get_to_clients_buffer_length(
        context: *mut aeron_driver_context_t,
    ) -> usize;
}
extern "C" {
    pub fn aeron_driver_context_set_counters_buffer_length(
        context: *mut aeron_driver_context_t,
        length: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn aeron_driver_context_get_counters_buffer_length(
        context: *mut aeron_driver_context_t,
    ) -> usize;
}
extern "C" {
    pub fn aeron_driver_context_set_error_buffer_length(
        context: *mut aeron_driver_context_t,
        length: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn aeron_driver_context_get_error_buffer_length(
        context: *mut aeron_driver_context_t,
    ) -> usize;
}
extern "C" {
    pub fn aeron_driver_context_set_client_liveness_timeout_ns(
        context: *mut aeron_driver_context_t,
        value: u64,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn aeron_driver_context_get_client_liveness_timeout_ns(
        context: *mut aeron_driver_context_t,
    ) -> u64;
}
extern "C" {
    pub fn aeron_driver_context_set_term_buffer_length(
        context: *mut aeron_driver_context_t,
        value: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn aeron_driver_context_get_term_buffer_length(
        context: *mut aeron_driver_context_t,
    ) -> usize;
}
extern "C" {
    pub fn aeron_driver_context_set_ipc_term_buffer_length(
        context: *mut aeron_driver_context_t,
        value: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn aeron_driver_context_get_ipc_term_buffer_length(
        context: *mut aeron_driver_context_t,
    ) -> usize;
}
extern "C" {
    pub fn aeron_driver_context_set_term_buffer_sparse_file(
        context: *mut aeron_driver_context_t,
        value: bool,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn aeron_driver_context_get_term_buffer_sparse_file(
        context: *mut aeron_driver_context_t,
    ) -> bool;
}
extern "C" {
    pub fn aeron_driver_context_set_perform_storage_checks(
        context: *mut aeron_driver_context_t,
        value: bool,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn aeron_driver_context_get_perform_storage_checks(
        context: *mut aeron_driver_context_t,
    ) -> bool;
}
extern "C" {
    pub fn aeron_driver_context_set_spies_simulate_connection(
        context: *mut aeron_driver_context_t,
        value: bool,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn aeron_driver_context_get_spies_simulate_connection(
        context: *mut aeron_driver_context_t,
    ) -> bool;
}
extern "C" {
    pub fn aeron_driver_context_set_file_page_size(
        context: *mut aeron_driver_context_t,
        value: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn aeron_driver_context_get_file_page_size(context: *mut aeron_driver_context_t) -> usize;
}
extern "C" {
    pub fn aeron_driver_context_set_mtu_length(
        context: *mut aeron_driver_context_t,
        value: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn aeron_driver_context_get_mtu_length(context: *mut aeron_driver_context_t) -> usize;
}
extern "C" {
    pub fn aeron_driver_context_set_ipc_mtu_length(
        context: *mut aeron_driver_context_t,
        value: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn aeron_driver_context_get_ipc_mtu_length(context: *mut aeron_driver_context_t) -> usize;
}
extern "C" {
    pub fn aeron_driver_context_set_ipc_publication_term_window_length(
        context: *mut aeron_driver_context_t,
        value: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn aeron_driver_context_get_ipc_publication_term_window_length(
        context: *mut aeron_driver_context_t,
    ) -> usize;
}
extern "C" {
    pub fn aeron_driver_context_set_publication_term_window_length(
        context: *mut aeron_driver_context_t,
        value: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn aeron_driver_context_get_publication_term_window_length(
        context: *mut aeron_driver_context_t,
    ) -> usize;
}
extern "C" {
    pub fn aeron_driver_context_set_publication_linger_timeout_ns(
        context: *mut aeron_driver_context_t,
        value: u64,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn aeron_driver_context_get_publication_linger_timeout_ns(
        context: *mut aeron_driver_context_t,
    ) -> u64;
}
extern "C" {
    pub fn aeron_driver_context_set_socket_so_rcvbuf(
        context: *mut aeron_driver_context_t,
        value: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn aeron_driver_context_get_socket_so_rcvbuf(context: *mut aeron_driver_context_t)
        -> usize;
}
extern "C" {
    pub fn aeron_driver_context_set_socket_so_sndbuf(
        context: *mut aeron_driver_context_t,
        value: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn aeron_driver_context_get_socket_so_sndbuf(context: *mut aeron_driver_context_t)
        -> usize;
}
extern "C" {
    pub fn aeron_driver_context_set_socket_multicast_ttl(
        context: *mut aeron_driver_context_t,
        value: u8,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn aeron_driver_context_get_socket_multicast_ttl(
        context: *mut aeron_driver_context_t,
    ) -> u8;
}
extern "C" {
    pub fn aeron_driver_context_set_send_to_status_poll_ratio(
        context: *mut aeron_driver_context_t,
        value: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn aeron_driver_context_get_send_to_status_poll_ratio(
        context: *mut aeron_driver_context_t,
    ) -> usize;
}
extern "C" {
    pub fn aeron_driver_context_set_rcv_status_message_timeout_ns(
        context: *mut aeron_driver_context_t,
        value: u64,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn aeron_driver_context_get_rcv_status_message_timeout_ns(
        context: *mut aeron_driver_context_t,
    ) -> u64;
}
pub type aeron_flow_control_strategy_t = aeron_flow_control_strategy_stct;
pub type aeron_counters_manager_t = aeron_counters_manager_stct;
pub type aeron_udp_channel_t = aeron_udp_channel_stct;
pub type aeron_flow_control_strategy_supplier_func_t = ::std::option::Option<
    unsafe extern "C" fn(
        strategy: *mut *mut aeron_flow_control_strategy_t,
        context: *mut aeron_driver_context_t,
        counters_manager: *mut aeron_counters_manager_t,
        channel: *const aeron_udp_channel_t,
        stream_id: i32,
        session_id: i32,
        registration_id: i64,
        initial_term_id: i32,
        term_length: usize,
    ) -> ::std::os::raw::c_int,
>;
extern "C" {
    #[doc = " Return a flow control strategy supplier function pointer associated with the given name. This only will find\n strategies built into the driver and will not try to dynamically load nor find any in the current executable.\n\n @param name of the strategy\n @return function pointer to supplier associated with the name"]
    pub fn aeron_flow_control_strategy_supplier_by_name(
        name: *const ::std::os::raw::c_char,
    ) -> aeron_flow_control_strategy_supplier_func_t;
}
extern "C" {
    pub fn aeron_driver_context_set_multicast_flowcontrol_supplier(
        context: *mut aeron_driver_context_t,
        value: aeron_flow_control_strategy_supplier_func_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn aeron_driver_context_get_multicast_flowcontrol_supplier(
        context: *mut aeron_driver_context_t,
    ) -> aeron_flow_control_strategy_supplier_func_t;
}
extern "C" {
    pub fn aeron_driver_context_set_unicast_flowcontrol_supplier(
        context: *mut aeron_driver_context_t,
        value: aeron_flow_control_strategy_supplier_func_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn aeron_driver_context_get_unicast_flowcontrol_supplier(
        context: *mut aeron_driver_context_t,
    ) -> aeron_flow_control_strategy_supplier_func_t;
}
extern "C" {
    pub fn aeron_driver_context_set_image_liveness_timeout_ns(
        context: *mut aeron_driver_context_t,
        value: u64,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn aeron_driver_context_get_image_liveness_timeout_ns(
        context: *mut aeron_driver_context_t,
    ) -> u64;
}
extern "C" {
    pub fn aeron_driver_context_set_rcv_initial_window_length(
        context: *mut aeron_driver_context_t,
        value: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn aeron_driver_context_get_rcv_initial_window_length(
        context: *mut aeron_driver_context_t,
    ) -> usize;
}
pub type aeron_congestion_control_strategy_t = aeron_congestion_control_strategy_stct;
pub type aeron_congestion_control_strategy_supplier_func_t = ::std::option::Option<
    unsafe extern "C" fn(
        strategy: *mut *mut aeron_congestion_control_strategy_t,
        channel: *mut aeron_udp_channel_t,
        stream_id: i32,
        session_id: i32,
        registration_id: i64,
        term_length: i32,
        sender_mtu_length: i32,
        control_address: *mut sockaddr_storage,
        src_address: *mut sockaddr_storage,
        context: *mut aeron_driver_context_t,
        counters_manager: *mut aeron_counters_manager_t,
    ) -> ::std::os::raw::c_int,
>;
extern "C" {
    pub fn aeron_driver_context_set_congestioncontrol_supplier(
        context: *mut aeron_driver_context_t,
        value: aeron_congestion_control_strategy_supplier_func_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn aeron_driver_context_get_congestioncontrol_supplier(
        context: *mut aeron_driver_context_t,
    ) -> aeron_congestion_control_strategy_supplier_func_t;
}
extern "C" {
    pub fn aeron_driver_context_set_loss_report_buffer_length(
        context: *mut aeron_driver_context_t,
        value: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn aeron_driver_context_get_loss_report_buffer_length(
        context: *mut aeron_driver_context_t,
    ) -> usize;
}
extern "C" {
    pub fn aeron_driver_context_set_publication_unblock_timeout_ns(
        context: *mut aeron_driver_context_t,
        value: u64,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn aeron_driver_context_get_publication_unblock_timeout_ns(
        context: *mut aeron_driver_context_t,
    ) -> u64;
}
extern "C" {
    pub fn aeron_driver_context_set_publication_connection_timeout_ns(
        context: *mut aeron_driver_context_t,
        value: u64,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn aeron_driver_context_get_publication_connection_timeout_ns(
        context: *mut aeron_driver_context_t,
    ) -> u64;
}
extern "C" {
    pub fn aeron_driver_context_set_timer_interval_ns(
        context: *mut aeron_driver_context_t,
        value: u64,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn aeron_driver_context_get_timer_interval_ns(context: *mut aeron_driver_context_t) -> u64;
}
extern "C" {
    pub fn aeron_driver_context_set_sender_idle_strategy(
        context: *mut aeron_driver_context_t,
        value: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn aeron_driver_context_get_sender_idle_strategy(
        context: *mut aeron_driver_context_t,
    ) -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn aeron_driver_context_set_conductor_idle_strategy(
        context: *mut aeron_driver_context_t,
        value: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn aeron_driver_context_get_conductor_idle_strategy(
        context: *mut aeron_driver_context_t,
    ) -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn aeron_driver_context_set_receiver_idle_strategy(
        context: *mut aeron_driver_context_t,
        value: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn aeron_driver_context_get_receiver_idle_strategy(
        context: *mut aeron_driver_context_t,
    ) -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn aeron_driver_context_set_sharednetwork_idle_strategy(
        context: *mut aeron_driver_context_t,
        value: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn aeron_driver_context_get_sharednetwork_idle_strategy(
        context: *mut aeron_driver_context_t,
    ) -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn aeron_driver_context_set_shared_idle_strategy(
        context: *mut aeron_driver_context_t,
        value: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn aeron_driver_context_get_shared_idle_strategy(
        context: *mut aeron_driver_context_t,
    ) -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn aeron_driver_context_set_sender_idle_strategy_init_args(
        context: *mut aeron_driver_context_t,
        value: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn aeron_driver_context_get_sender_idle_strategy_init_args(
        context: *mut aeron_driver_context_t,
    ) -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn aeron_driver_context_set_conductor_idle_strategy_init_args(
        context: *mut aeron_driver_context_t,
        value: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn aeron_driver_context_get_conductor_idle_strategy_init_args(
        context: *mut aeron_driver_context_t,
    ) -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn aeron_driver_context_set_receiver_idle_strategy_init_args(
        context: *mut aeron_driver_context_t,
        value: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn aeron_driver_context_get_receiver_idle_strategy_init_args(
        context: *mut aeron_driver_context_t,
    ) -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn aeron_driver_context_set_sharednetwork_idle_strategy_init_args(
        context: *mut aeron_driver_context_t,
        value: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn aeron_driver_context_get_sharednetwork_idle_strategy_init_args(
        context: *mut aeron_driver_context_t,
    ) -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn aeron_driver_context_set_shared_idle_strategy_init_args(
        context: *mut aeron_driver_context_t,
        value: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn aeron_driver_context_get_shared_idle_strategy_init_args(
        context: *mut aeron_driver_context_t,
    ) -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn aeron_driver_context_set_agent_on_start_function(
        context: *mut aeron_driver_context_t,
        value: aeron_agent_on_start_func_t,
        state: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn aeron_driver_context_get_agent_on_start_function(
        context: *mut aeron_driver_context_t,
    ) -> aeron_agent_on_start_func_t;
}
extern "C" {
    pub fn aeron_driver_context_get_agent_on_start_state(
        context: *mut aeron_driver_context_t,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn aeron_driver_context_set_counters_free_to_reuse_timeout_ns(
        context: *mut aeron_driver_context_t,
        value: u64,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn aeron_driver_context_get_counters_free_to_reuse_timeout_ns(
        context: *mut aeron_driver_context_t,
    ) -> u64;
}
extern "C" {
    pub fn aeron_driver_context_set_flow_control_receiver_timeout_ns(
        context: *mut aeron_driver_context_t,
        value: u64,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn aeron_driver_context_get_flow_control_receiver_timeout_ns(
        context: *mut aeron_driver_context_t,
    ) -> u64;
}
extern "C" {
    pub fn aeron_driver_context_set_flow_control_group_tag(
        context: *mut aeron_driver_context_t,
        value: i64,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn aeron_driver_context_get_flow_control_group_tag(
        context: *mut aeron_driver_context_t,
    ) -> i64;
}
extern "C" {
    pub fn aeron_driver_context_set_flow_control_group_min_size(
        context: *mut aeron_driver_context_t,
        value: i32,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn aeron_driver_context_get_flow_control_group_min_size(
        context: *mut aeron_driver_context_t,
    ) -> i32;
}
extern "C" {
    pub fn aeron_driver_context_set_receiver_group_tag(
        context: *mut aeron_driver_context_t,
        is_present: bool,
        value: i64,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn aeron_driver_context_get_receiver_group_tag_is_present(
        context: *mut aeron_driver_context_t,
    ) -> bool;
}
extern "C" {
    pub fn aeron_driver_context_get_receiver_group_tag_value(
        context: *mut aeron_driver_context_t,
    ) -> i64;
}
pub type aeron_driver_termination_validator_func_t = ::std::option::Option<
    unsafe extern "C" fn(state: *mut ::std::os::raw::c_void, buffer: *mut u8, length: i32) -> bool,
>;
extern "C" {
    pub fn aeron_driver_context_set_driver_termination_validator(
        context: *mut aeron_driver_context_t,
        value: aeron_driver_termination_validator_func_t,
        state: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn aeron_driver_context_get_driver_termination_validator(
        context: *mut aeron_driver_context_t,
    ) -> aeron_driver_termination_validator_func_t;
}
extern "C" {
    pub fn aeron_driver_context_get_driver_termination_validator_state(
        context: *mut aeron_driver_context_t,
    ) -> *mut ::std::os::raw::c_void;
}
pub type aeron_driver_termination_hook_func_t =
    ::std::option::Option<unsafe extern "C" fn(clientd: *mut ::std::os::raw::c_void)>;
extern "C" {
    pub fn aeron_driver_context_set_driver_termination_hook(
        context: *mut aeron_driver_context_t,
        value: aeron_driver_termination_hook_func_t,
        state: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn aeron_driver_context_get_driver_termination_hook(
        context: *mut aeron_driver_context_t,
    ) -> aeron_driver_termination_hook_func_t;
}
extern "C" {
    pub fn aeron_driver_context_get_driver_termination_hook_state(
        context: *mut aeron_driver_context_t,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn aeron_driver_context_set_print_configuration(
        context: *mut aeron_driver_context_t,
        value: bool,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn aeron_driver_context_get_print_configuration(
        context: *mut aeron_driver_context_t,
    ) -> bool;
}
extern "C" {
    pub fn aeron_driver_context_set_reliable_stream(
        context: *mut aeron_driver_context_t,
        value: bool,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn aeron_driver_context_get_reliable_stream(context: *mut aeron_driver_context_t) -> bool;
}
extern "C" {
    pub fn aeron_driver_context_set_tether_subscriptions(
        context: *mut aeron_driver_context_t,
        value: bool,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn aeron_driver_context_get_tether_subscriptions(
        context: *mut aeron_driver_context_t,
    ) -> bool;
}
extern "C" {
    pub fn aeron_driver_context_set_untethered_window_limit_timeout_ns(
        context: *mut aeron_driver_context_t,
        value: u64,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn aeron_driver_context_get_untethered_window_limit_timeout_ns(
        context: *mut aeron_driver_context_t,
    ) -> u64;
}
extern "C" {
    pub fn aeron_driver_context_set_untethered_resting_timeout_ns(
        context: *mut aeron_driver_context_t,
        value: u64,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn aeron_driver_context_get_untethered_resting_timeout_ns(
        context: *mut aeron_driver_context_t,
    ) -> u64;
}
extern "C" {
    pub fn aeron_driver_context_set_driver_timeout_ms(
        context: *mut aeron_driver_context_t,
        value: u64,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn aeron_driver_context_get_driver_timeout_ms(context: *mut aeron_driver_context_t) -> u64;
}
extern "C" {
    pub fn aeron_driver_context_set_nak_multicast_group_size(
        context: *mut aeron_driver_context_t,
        value: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn aeron_driver_context_get_nak_multicast_group_size(
        context: *mut aeron_driver_context_t,
    ) -> usize;
}
extern "C" {
    pub fn aeron_driver_context_set_nak_multicast_max_backoff_ns(
        context: *mut aeron_driver_context_t,
        value: u64,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn aeron_driver_context_get_nak_multicast_max_backoff_ns(
        context: *mut aeron_driver_context_t,
    ) -> u64;
}
extern "C" {
    pub fn aeron_driver_context_set_nak_unicast_delay_ns(
        context: *mut aeron_driver_context_t,
        value: u64,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn aeron_driver_context_get_nak_unicast_delay_ns(
        context: *mut aeron_driver_context_t,
    ) -> u64;
}
extern "C" {
    pub fn aeron_driver_context_set_retransmit_unicast_delay_ns(
        context: *mut aeron_driver_context_t,
        value: u64,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn aeron_driver_context_get_retransmit_unicast_delay_ns(
        context: *mut aeron_driver_context_t,
    ) -> u64;
}
extern "C" {
    pub fn aeron_driver_context_set_retransmit_unicast_linger_ns(
        context: *mut aeron_driver_context_t,
        value: u64,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn aeron_driver_context_get_retransmit_unicast_linger_ns(
        context: *mut aeron_driver_context_t,
    ) -> u64;
}
pub mod aeron_inferable_boolean_enum {
    pub type Type = ::std::os::raw::c_uint;
    pub const AERON_FORCE_FALSE: Type = 0;
    pub const AERON_FORCE_TRUE: Type = 1;
    pub const AERON_INFER: Type = 2;
}
pub use self::aeron_inferable_boolean_enum::Type as aeron_inferable_boolean_t;
extern "C" {
    pub fn aeron_driver_context_set_receiver_group_consideration(
        context: *mut aeron_driver_context_t,
        value: aeron_inferable_boolean_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn aeron_driver_context_get_receiver_group_consideration(
        context: *mut aeron_driver_context_t,
    ) -> aeron_inferable_boolean_t;
}
extern "C" {
    pub fn aeron_driver_context_set_rejoin_stream(
        context: *mut aeron_driver_context_t,
        value: bool,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn aeron_driver_context_get_rejoin_stream(context: *mut aeron_driver_context_t) -> bool;
}
extern "C" {
    pub fn aeron_driver_context_set_connect_enabled(
        context: *mut aeron_driver_context_t,
        value: bool,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn aeron_driver_context_get_connect_enabled(
        context: *mut aeron_driver_context_t,
    ) -> ::std::os::raw::c_int;
}
pub type aeron_udp_channel_transport_bindings_t = aeron_udp_channel_transport_bindings_stct;
extern "C" {
    pub fn aeron_driver_context_set_udp_channel_transport_bindings(
        context: *mut aeron_driver_context_t,
        value: *mut aeron_udp_channel_transport_bindings_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn aeron_driver_context_get_udp_channel_transport_bindings(
        context: *mut aeron_driver_context_t,
    ) -> *mut aeron_udp_channel_transport_bindings_t;
}
pub type aeron_udp_channel_interceptor_bindings_t = aeron_udp_channel_interceptor_bindings_stct;
extern "C" {
    pub fn aeron_driver_context_set_udp_channel_outgoing_interceptors(
        context: *mut aeron_driver_context_t,
        value: *mut aeron_udp_channel_interceptor_bindings_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn aeron_driver_context_get_udp_channel_outgoing_interceptors(
        context: *mut aeron_driver_context_t,
    ) -> *mut aeron_udp_channel_interceptor_bindings_t;
}
extern "C" {
    pub fn aeron_driver_context_set_udp_channel_incoming_interceptors(
        context: *mut aeron_driver_context_t,
        value: *mut aeron_udp_channel_interceptor_bindings_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn aeron_driver_context_get_udp_channel_incoming_interceptors(
        context: *mut aeron_driver_context_t,
    ) -> *mut aeron_udp_channel_interceptor_bindings_t;
}
extern "C" {
    pub fn aeron_driver_context_set_publication_reserved_session_id_low(
        context: *mut aeron_driver_context_t,
        value: i32,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn aeron_driver_context_get_publication_reserved_session_id_low(
        context: *mut aeron_driver_context_t,
    ) -> i32;
}
extern "C" {
    pub fn aeron_driver_context_set_publication_reserved_session_id_high(
        context: *mut aeron_driver_context_t,
        value: i32,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn aeron_driver_context_get_publication_reserved_session_id_high(
        context: *mut aeron_driver_context_t,
    ) -> i32;
}
pub type aeron_name_resolver_t = aeron_name_resolver_stct;
pub type aeron_name_resolver_supplier_func_t = ::std::option::Option<
    unsafe extern "C" fn(
        resolver: *mut aeron_name_resolver_t,
        args: *const ::std::os::raw::c_char,
        context: *mut aeron_driver_context_t,
    ) -> ::std::os::raw::c_int,
>;
extern "C" {
    pub fn aeron_driver_context_set_resolver_name(
        context: *mut aeron_driver_context_t,
        value: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn aeron_driver_context_get_resolver_name(
        context: *mut aeron_driver_context_t,
    ) -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn aeron_driver_context_set_resolver_interface(
        context: *mut aeron_driver_context_t,
        value: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn aeron_driver_context_get_resolver_interface(
        context: *mut aeron_driver_context_t,
    ) -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn aeron_driver_context_set_resolver_bootstrap_neighbor(
        context: *mut aeron_driver_context_t,
        value: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn aeron_driver_context_get_resolver_bootstrap_neighbor(
        context: *mut aeron_driver_context_t,
    ) -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn aeron_driver_context_set_name_resolver_supplier(
        context: *mut aeron_driver_context_t,
        value: aeron_name_resolver_supplier_func_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn aeron_driver_context_get_name_resolver_supplier(
        context: *mut aeron_driver_context_t,
    ) -> aeron_name_resolver_supplier_func_t;
}
extern "C" {
    pub fn aeron_driver_context_set_name_resolver_init_args(
        context: *mut aeron_driver_context_t,
        value: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn aeron_driver_context_get_name_resolver_init_args(
        context: *mut aeron_driver_context_t,
    ) -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn aeron_driver_context_set_re_resolution_check_interval_ns(
        context: *mut aeron_driver_context_t,
        value: u64,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn aeron_driver_context_get_re_resolution_check_interval_ns(
        context: *mut aeron_driver_context_t,
    ) -> u64;
}
pub type aeron_duty_cycle_tracker_t = aeron_duty_cycle_tracker_stct;
extern "C" {
    pub fn aeron_driver_context_set_conductor_duty_cycle_tracker(
        context: *mut aeron_driver_context_t,
        value: *mut aeron_duty_cycle_tracker_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn aeron_driver_context_get_conductor_duty_cycle_tracker(
        context: *mut aeron_driver_context_t,
    ) -> *mut aeron_duty_cycle_tracker_t;
}
extern "C" {
    pub fn aeron_driver_context_set_sender_duty_cycle_tracker(
        context: *mut aeron_driver_context_t,
        value: *mut aeron_duty_cycle_tracker_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn aeron_driver_context_get_sender_duty_cycle_tracker(
        context: *mut aeron_driver_context_t,
    ) -> *mut aeron_duty_cycle_tracker_t;
}
extern "C" {
    pub fn aeron_driver_context_set_receiver_duty_cycle_tracker(
        context: *mut aeron_driver_context_t,
        value: *mut aeron_duty_cycle_tracker_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn aeron_driver_context_get_receiver_duty_cycle_tracker(
        context: *mut aeron_driver_context_t,
    ) -> *mut aeron_duty_cycle_tracker_t;
}
extern "C" {
    pub fn aeron_driver_context_set_name_resolver_time_tracker(
        context: *mut aeron_driver_context_t,
        value: *mut aeron_duty_cycle_tracker_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn aeron_driver_context_get_name_resolver_time_tracker(
        context: *mut aeron_driver_context_t,
    ) -> *mut aeron_duty_cycle_tracker_t;
}
extern "C" {
    pub fn aeron_driver_context_set_conductor_cycle_threshold_ns(
        context: *mut aeron_driver_context_t,
        value: u64,
    ) -> i64;
}
extern "C" {
    pub fn aeron_driver_context_get_conductor_cycle_threshold_ns(
        context: *mut aeron_driver_context_t,
    ) -> i64;
}
extern "C" {
    pub fn aeron_driver_context_set_sender_cycle_threshold_ns(
        context: *mut aeron_driver_context_t,
        value: u64,
    ) -> i64;
}
extern "C" {
    pub fn aeron_driver_context_get_sender_cycle_threshold_ns(
        context: *mut aeron_driver_context_t,
    ) -> i64;
}
extern "C" {
    pub fn aeron_driver_context_set_receiver_cycle_threshold_ns(
        context: *mut aeron_driver_context_t,
        value: u64,
    ) -> i64;
}
extern "C" {
    pub fn aeron_driver_context_get_receiver_cycle_threshold_ns(
        context: *mut aeron_driver_context_t,
    ) -> i64;
}
extern "C" {
    pub fn aeron_driver_context_set_name_resolver_threshold_ns(
        context: *mut aeron_driver_context_t,
        value: u64,
    ) -> i64;
}
extern "C" {
    pub fn aeron_driver_context_get_name_resolver_threshold_ns(
        context: *mut aeron_driver_context_t,
    ) -> i64;
}
extern "C" {
    pub fn aeron_driver_context_set_receiver_io_vector_capacity(
        context: *mut aeron_driver_context_t,
        value: u32,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn aeron_driver_context_get_receiver_io_vector_capacity(
        context: *mut aeron_driver_context_t,
    ) -> u32;
}
extern "C" {
    pub fn aeron_driver_context_set_sender_io_vector_capacity(
        context: *mut aeron_driver_context_t,
        value: u32,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn aeron_driver_context_get_sender_io_vector_capacity(
        context: *mut aeron_driver_context_t,
    ) -> u32;
}
extern "C" {
    pub fn aeron_driver_context_set_network_publication_max_messages_per_send(
        context: *mut aeron_driver_context_t,
        value: u32,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn aeron_driver_context_get_network_publication_max_messages_per_send(
        context: *mut aeron_driver_context_t,
    ) -> u32;
}
extern "C" {
    pub fn aeron_driver_context_set_resource_free_limit(
        context: *mut aeron_driver_context_t,
        value: u32,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn aeron_driver_context_get_resource_free_limit(
        context: *mut aeron_driver_context_t,
    ) -> u32;
}
extern "C" {
    #[doc = " Create a aeron_driver_context_t struct and initialize with default values.\n\n @param context to create and initialize\n @return 0 for success and -1 for error."]
    pub fn aeron_driver_context_init(
        context: *mut *mut aeron_driver_context_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Close and delete aeron_driver_context_t struct.\n\n @param context to close and delete\n @return 0 for success and -1 for error."]
    pub fn aeron_driver_context_close(
        context: *mut aeron_driver_context_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Create a aeron_driver_t struct and initialize from the aeron_driver_context_t struct.\n\n The given aeron_driver_context_t struct will be used exclusively by the driver. Do not reuse between drivers.\n\n @param driver  to create and initialize.\n @param context to use for initialization.\n @return 0 for success and -1 for error."]
    pub fn aeron_driver_init(
        driver: *mut *mut aeron_driver_t,
        context: *mut aeron_driver_context_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Start an aeron_driver_t given the threading mode. This may spawn threads for the Sender, Receiver, and Conductor\n depending on threading mode used.\n\n @param driver to start.\n @param manual_main_loop to be called by the caller for the Conductor do_work cycle.\n @return 0 for success and -1 for error."]
    pub fn aeron_driver_start(
        driver: *mut aeron_driver_t,
        manual_main_loop: bool,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Call the Conductor (or Shared) main do_work duty cycle once.\n\n Driver must have been created with manual_main_loop set to true.\n\n @param driver to call do_work duty cycle on.\n @return 0 for success and -1 for error."]
    pub fn aeron_driver_main_do_work(driver: *mut aeron_driver_t) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Call the Conductor (or Shared) Idle Strategy.\n\n @param driver to idle.\n @param work_count to pass to idle strategy."]
    pub fn aeron_driver_main_idle_strategy(
        driver: *mut aeron_driver_t,
        work_count: ::std::os::raw::c_int,
    );
}
extern "C" {
    #[doc = " Close and delete aeron_driver_t struct.\n\n @param driver to close and delete\n @return 0 for success and -1 for error."]
    pub fn aeron_driver_close(driver: *mut aeron_driver_t) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Delete the given aeron directory.\n\n @param dirname to delete.\n @return 0 for success and -1 for error."]
    pub fn aeron_delete_directory(dirname: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Affinity setting function that complies with the aeron_agent_on_start_func_t structure that can\n be used as an agent start function.  The state should be the aeron_driver_context_t* and the function\n will match the values \"conductor\", \"sender\", \"receiver\" and use the respective configuration options from\n the aeron_driver_context_t.\n\n @param state client information passed to function, should be the aeron_driver_context_t*.\n @param role_name name of the role specified on the agent."]
    pub fn aeron_set_thread_affinity_on_start(
        state: *mut ::std::os::raw::c_void,
        role_name: *const ::std::os::raw::c_char,
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct aeron_driver_uri_publication_params_stct {
    pub has_position: bool,
    pub is_sparse: bool,
    pub signal_eos: bool,
    pub spies_simulate_connection: bool,
    pub has_mtu_length: bool,
    pub mtu_length: usize,
    pub has_term_length: bool,
    pub term_length: usize,
    pub term_offset: usize,
    pub initial_term_id: i32,
    pub term_id: i32,
    pub linger_timeout_ns: u64,
    pub has_session_id: bool,
    pub session_id: i32,
    pub entity_tag: i64,
}
#[test]
fn bindgen_test_layout_aeron_driver_uri_publication_params_stct() {
    const UNINIT: ::std::mem::MaybeUninit<aeron_driver_uri_publication_params_stct> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<aeron_driver_uri_publication_params_stct>(),
        72usize,
        concat!(
            "Size of: ",
            stringify!(aeron_driver_uri_publication_params_stct)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<aeron_driver_uri_publication_params_stct>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(aeron_driver_uri_publication_params_stct)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).has_position) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(aeron_driver_uri_publication_params_stct),
            "::",
            stringify!(has_position)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).is_sparse) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(aeron_driver_uri_publication_params_stct),
            "::",
            stringify!(is_sparse)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).signal_eos) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(aeron_driver_uri_publication_params_stct),
            "::",
            stringify!(signal_eos)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).spies_simulate_connection) as usize - ptr as usize },
        3usize,
        concat!(
            "Offset of field: ",
            stringify!(aeron_driver_uri_publication_params_stct),
            "::",
            stringify!(spies_simulate_connection)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).has_mtu_length) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(aeron_driver_uri_publication_params_stct),
            "::",
            stringify!(has_mtu_length)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mtu_length) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(aeron_driver_uri_publication_params_stct),
            "::",
            stringify!(mtu_length)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).has_term_length) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(aeron_driver_uri_publication_params_stct),
            "::",
            stringify!(has_term_length)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).term_length) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(aeron_driver_uri_publication_params_stct),
            "::",
            stringify!(term_length)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).term_offset) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(aeron_driver_uri_publication_params_stct),
            "::",
            stringify!(term_offset)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).initial_term_id) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(aeron_driver_uri_publication_params_stct),
            "::",
            stringify!(initial_term_id)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).term_id) as usize - ptr as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(aeron_driver_uri_publication_params_stct),
            "::",
            stringify!(term_id)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).linger_timeout_ns) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(aeron_driver_uri_publication_params_stct),
            "::",
            stringify!(linger_timeout_ns)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).has_session_id) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(aeron_driver_uri_publication_params_stct),
            "::",
            stringify!(has_session_id)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).session_id) as usize - ptr as usize },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(aeron_driver_uri_publication_params_stct),
            "::",
            stringify!(session_id)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).entity_tag) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(aeron_driver_uri_publication_params_stct),
            "::",
            stringify!(entity_tag)
        )
    );
}
pub type aeron_driver_uri_publication_params_t = aeron_driver_uri_publication_params_stct;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct aeron_driver_uri_subscription_params_stct {
    pub is_reliable: bool,
    pub is_sparse: bool,
    pub is_tether: bool,
    pub is_rejoin: bool,
    pub group: aeron_inferable_boolean_t,
    pub has_session_id: bool,
    pub session_id: i32,
    pub initial_window_length: usize,
}
#[test]
fn bindgen_test_layout_aeron_driver_uri_subscription_params_stct() {
    const UNINIT: ::std::mem::MaybeUninit<aeron_driver_uri_subscription_params_stct> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<aeron_driver_uri_subscription_params_stct>(),
        24usize,
        concat!(
            "Size of: ",
            stringify!(aeron_driver_uri_subscription_params_stct)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<aeron_driver_uri_subscription_params_stct>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(aeron_driver_uri_subscription_params_stct)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).is_reliable) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(aeron_driver_uri_subscription_params_stct),
            "::",
            stringify!(is_reliable)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).is_sparse) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(aeron_driver_uri_subscription_params_stct),
            "::",
            stringify!(is_sparse)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).is_tether) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(aeron_driver_uri_subscription_params_stct),
            "::",
            stringify!(is_tether)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).is_rejoin) as usize - ptr as usize },
        3usize,
        concat!(
            "Offset of field: ",
            stringify!(aeron_driver_uri_subscription_params_stct),
            "::",
            stringify!(is_rejoin)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).group) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(aeron_driver_uri_subscription_params_stct),
            "::",
            stringify!(group)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).has_session_id) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(aeron_driver_uri_subscription_params_stct),
            "::",
            stringify!(has_session_id)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).session_id) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(aeron_driver_uri_subscription_params_stct),
            "::",
            stringify!(session_id)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).initial_window_length) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(aeron_driver_uri_subscription_params_stct),
            "::",
            stringify!(initial_window_length)
        )
    );
}
pub type aeron_driver_uri_subscription_params_t = aeron_driver_uri_subscription_params_stct;
pub type aeron_driver_conductor_t = aeron_driver_conductor_stct;
extern "C" {
    pub fn aeron_diver_uri_publication_params(
        uri: *mut aeron_uri_t,
        params: *mut aeron_driver_uri_publication_params_t,
        conductor: *mut aeron_driver_conductor_t,
        is_exclusive: bool,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn aeron_driver_uri_subscription_params(
        uri: *mut aeron_uri_t,
        params: *mut aeron_driver_uri_subscription_params_t,
        conductor: *mut aeron_driver_conductor_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn aeron_publication_params_validate_mtu_for_sndbuf(
        params: *mut aeron_driver_uri_publication_params_t,
        endpoint_socket_sndbuf: usize,
        channel_socket_sndbuf: usize,
        context_socket_sndbuf: usize,
        os_default_socket_sndbuf: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn aeron_subscription_params_validate_initial_window_for_rcvbuf(
        params: *mut aeron_driver_uri_subscription_params_t,
        endpoint_socket_rcvbuf: usize,
        os_default_socket_rcvbuf: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn aeron_driver_uri_get_timestamp_offset(
        uri: *mut aeron_uri_t,
        key: *const ::std::os::raw::c_char,
        offset: *mut i32,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn aeron_driver_uri_get_offset_info(offset: i32) -> *const ::std::os::raw::c_char;
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct iovec {
    pub iov_base: *mut ::std::os::raw::c_void,
    pub iov_len: usize,
}
#[test]
fn bindgen_test_layout_iovec() {
    const UNINIT: ::std::mem::MaybeUninit<iovec> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<iovec>(),
        16usize,
        concat!("Size of: ", stringify!(iovec))
    );
    assert_eq!(
        ::std::mem::align_of::<iovec>(),
        8usize,
        concat!("Alignment of ", stringify!(iovec))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).iov_base) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(iovec),
            "::",
            stringify!(iov_base)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).iov_len) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(iovec),
            "::",
            stringify!(iov_len)
        )
    );
}
pub type socklen_t = __socklen_t;
pub type sa_family_t = ::std::os::raw::c_ushort;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct sockaddr {
    pub sa_family: sa_family_t,
    pub sa_data: [::std::os::raw::c_char; 14usize],
}
#[test]
fn bindgen_test_layout_sockaddr() {
    const UNINIT: ::std::mem::MaybeUninit<sockaddr> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<sockaddr>(),
        16usize,
        concat!("Size of: ", stringify!(sockaddr))
    );
    assert_eq!(
        ::std::mem::align_of::<sockaddr>(),
        2usize,
        concat!("Alignment of ", stringify!(sockaddr))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sa_family) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sockaddr),
            "::",
            stringify!(sa_family)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sa_data) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(sockaddr),
            "::",
            stringify!(sa_data)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct sockaddr_storage {
    pub ss_family: sa_family_t,
    pub __ss_padding: [::std::os::raw::c_char; 118usize],
    pub __ss_align: ::std::os::raw::c_ulong,
}
#[test]
fn bindgen_test_layout_sockaddr_storage() {
    const UNINIT: ::std::mem::MaybeUninit<sockaddr_storage> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<sockaddr_storage>(),
        128usize,
        concat!("Size of: ", stringify!(sockaddr_storage))
    );
    assert_eq!(
        ::std::mem::align_of::<sockaddr_storage>(),
        8usize,
        concat!("Alignment of ", stringify!(sockaddr_storage))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ss_family) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sockaddr_storage),
            "::",
            stringify!(ss_family)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__ss_padding) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(sockaddr_storage),
            "::",
            stringify!(__ss_padding)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__ss_align) as usize - ptr as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(sockaddr_storage),
            "::",
            stringify!(__ss_align)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct msghdr {
    pub msg_name: *mut ::std::os::raw::c_void,
    pub msg_namelen: socklen_t,
    pub msg_iov: *mut iovec,
    pub msg_iovlen: usize,
    pub msg_control: *mut ::std::os::raw::c_void,
    pub msg_controllen: usize,
    pub msg_flags: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_msghdr() {
    const UNINIT: ::std::mem::MaybeUninit<msghdr> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<msghdr>(),
        56usize,
        concat!("Size of: ", stringify!(msghdr))
    );
    assert_eq!(
        ::std::mem::align_of::<msghdr>(),
        8usize,
        concat!("Alignment of ", stringify!(msghdr))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).msg_name) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(msghdr),
            "::",
            stringify!(msg_name)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).msg_namelen) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(msghdr),
            "::",
            stringify!(msg_namelen)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).msg_iov) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(msghdr),
            "::",
            stringify!(msg_iov)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).msg_iovlen) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(msghdr),
            "::",
            stringify!(msg_iovlen)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).msg_control) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(msghdr),
            "::",
            stringify!(msg_control)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).msg_controllen) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(msghdr),
            "::",
            stringify!(msg_controllen)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).msg_flags) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(msghdr),
            "::",
            stringify!(msg_flags)
        )
    );
}
pub type in_addr_t = u32;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct in_addr {
    pub s_addr: in_addr_t,
}
#[test]
fn bindgen_test_layout_in_addr() {
    const UNINIT: ::std::mem::MaybeUninit<in_addr> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<in_addr>(),
        4usize,
        concat!("Size of: ", stringify!(in_addr))
    );
    assert_eq!(
        ::std::mem::align_of::<in_addr>(),
        4usize,
        concat!("Alignment of ", stringify!(in_addr))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).s_addr) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(in_addr),
            "::",
            stringify!(s_addr)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct in6_addr {
    pub __in6_u: in6_addr__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union in6_addr__bindgen_ty_1 {
    pub __u6_addr8: [u8; 16usize],
    pub __u6_addr16: [u16; 8usize],
    pub __u6_addr32: [u32; 4usize],
}
#[test]
fn bindgen_test_layout_in6_addr__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<in6_addr__bindgen_ty_1> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<in6_addr__bindgen_ty_1>(),
        16usize,
        concat!("Size of: ", stringify!(in6_addr__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<in6_addr__bindgen_ty_1>(),
        4usize,
        concat!("Alignment of ", stringify!(in6_addr__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__u6_addr8) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(in6_addr__bindgen_ty_1),
            "::",
            stringify!(__u6_addr8)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__u6_addr16) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(in6_addr__bindgen_ty_1),
            "::",
            stringify!(__u6_addr16)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__u6_addr32) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(in6_addr__bindgen_ty_1),
            "::",
            stringify!(__u6_addr32)
        )
    );
}
#[test]
fn bindgen_test_layout_in6_addr() {
    const UNINIT: ::std::mem::MaybeUninit<in6_addr> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<in6_addr>(),
        16usize,
        concat!("Size of: ", stringify!(in6_addr))
    );
    assert_eq!(
        ::std::mem::align_of::<in6_addr>(),
        4usize,
        concat!("Alignment of ", stringify!(in6_addr))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__in6_u) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(in6_addr),
            "::",
            stringify!(__in6_u)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct addrinfo {
    pub ai_flags: ::std::os::raw::c_int,
    pub ai_family: ::std::os::raw::c_int,
    pub ai_socktype: ::std::os::raw::c_int,
    pub ai_protocol: ::std::os::raw::c_int,
    pub ai_addrlen: socklen_t,
    pub ai_addr: *mut sockaddr,
    pub ai_canonname: *mut ::std::os::raw::c_char,
    pub ai_next: *mut addrinfo,
}
#[test]
fn bindgen_test_layout_addrinfo() {
    const UNINIT: ::std::mem::MaybeUninit<addrinfo> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<addrinfo>(),
        48usize,
        concat!("Size of: ", stringify!(addrinfo))
    );
    assert_eq!(
        ::std::mem::align_of::<addrinfo>(),
        8usize,
        concat!("Alignment of ", stringify!(addrinfo))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ai_flags) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(addrinfo),
            "::",
            stringify!(ai_flags)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ai_family) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(addrinfo),
            "::",
            stringify!(ai_family)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ai_socktype) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(addrinfo),
            "::",
            stringify!(ai_socktype)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ai_protocol) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(addrinfo),
            "::",
            stringify!(ai_protocol)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ai_addrlen) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(addrinfo),
            "::",
            stringify!(ai_addrlen)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ai_addr) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(addrinfo),
            "::",
            stringify!(ai_addr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ai_canonname) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(addrinfo),
            "::",
            stringify!(ai_canonname)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ai_next) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(addrinfo),
            "::",
            stringify!(ai_next)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct ifaddrs {
    pub ifa_next: *mut ifaddrs,
    pub ifa_name: *mut ::std::os::raw::c_char,
    pub ifa_flags: ::std::os::raw::c_uint,
    pub ifa_addr: *mut sockaddr,
    pub ifa_netmask: *mut sockaddr,
    pub ifa_ifu: ifaddrs__bindgen_ty_1,
    pub ifa_data: *mut ::std::os::raw::c_void,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union ifaddrs__bindgen_ty_1 {
    pub ifu_broadaddr: *mut sockaddr,
    pub ifu_dstaddr: *mut sockaddr,
}
#[test]
fn bindgen_test_layout_ifaddrs__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<ifaddrs__bindgen_ty_1> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ifaddrs__bindgen_ty_1>(),
        8usize,
        concat!("Size of: ", stringify!(ifaddrs__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<ifaddrs__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(ifaddrs__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifu_broadaddr) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ifaddrs__bindgen_ty_1),
            "::",
            stringify!(ifu_broadaddr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifu_dstaddr) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ifaddrs__bindgen_ty_1),
            "::",
            stringify!(ifu_dstaddr)
        )
    );
}
#[test]
fn bindgen_test_layout_ifaddrs() {
    const UNINIT: ::std::mem::MaybeUninit<ifaddrs> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ifaddrs>(),
        56usize,
        concat!("Size of: ", stringify!(ifaddrs))
    );
    assert_eq!(
        ::std::mem::align_of::<ifaddrs>(),
        8usize,
        concat!("Alignment of ", stringify!(ifaddrs))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifa_next) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ifaddrs),
            "::",
            stringify!(ifa_next)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifa_name) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ifaddrs),
            "::",
            stringify!(ifa_name)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifa_flags) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ifaddrs),
            "::",
            stringify!(ifa_flags)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifa_addr) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(ifaddrs),
            "::",
            stringify!(ifa_addr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifa_netmask) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(ifaddrs),
            "::",
            stringify!(ifa_netmask)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifa_ifu) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(ifaddrs),
            "::",
            stringify!(ifa_ifu)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ifa_data) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(ifaddrs),
            "::",
            stringify!(ifa_data)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct pollfd {
    pub fd: ::std::os::raw::c_int,
    pub events: ::std::os::raw::c_short,
    pub revents: ::std::os::raw::c_short,
}
#[test]
fn bindgen_test_layout_pollfd() {
    const UNINIT: ::std::mem::MaybeUninit<pollfd> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<pollfd>(),
        8usize,
        concat!("Size of: ", stringify!(pollfd))
    );
    assert_eq!(
        ::std::mem::align_of::<pollfd>(),
        4usize,
        concat!("Alignment of ", stringify!(pollfd))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fd) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pollfd),
            "::",
            stringify!(fd)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).events) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(pollfd),
            "::",
            stringify!(events)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).revents) as usize - ptr as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(pollfd),
            "::",
            stringify!(revents)
        )
    );
}
pub type aeron_socket_t = ::std::os::raw::c_int;
extern "C" {
    pub fn aeron_set_socket_non_blocking(fd: aeron_socket_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn aeron_socket(
        domain: ::std::os::raw::c_int,
        type_: ::std::os::raw::c_int,
        protocol: ::std::os::raw::c_int,
    ) -> aeron_socket_t;
}
extern "C" {
    pub fn aeron_close_socket(socket: aeron_socket_t);
}
extern "C" {
    pub fn aeron_connect(
        fd: aeron_socket_t,
        address: *mut sockaddr,
        address_length: socklen_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn aeron_bind(
        fd: aeron_socket_t,
        address: *mut sockaddr,
        address_length: socklen_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn aeron_net_init() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn aeron_getsockopt(
        fd: aeron_socket_t,
        level: ::std::os::raw::c_int,
        optname: ::std::os::raw::c_int,
        optval: *mut ::std::os::raw::c_void,
        optlen: *mut socklen_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn aeron_setsockopt(
        fd: aeron_socket_t,
        level: ::std::os::raw::c_int,
        optname: ::std::os::raw::c_int,
        optval: *const ::std::os::raw::c_void,
        optlen: socklen_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn aeron_getifaddrs(ifap: *mut *mut ifaddrs) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn aeron_freeifaddrs(ifa: *mut ifaddrs);
}
extern "C" {
    pub fn aeron_sendmsg(
        fd: aeron_socket_t,
        msghdr: *mut msghdr,
        flags: ::std::os::raw::c_int,
    ) -> isize;
}
extern "C" {
    pub fn aeron_send(
        fd: aeron_socket_t,
        buf: *const ::std::os::raw::c_void,
        len: usize,
        flags: ::std::os::raw::c_int,
    ) -> isize;
}
extern "C" {
    pub fn aeron_recvmsg(
        fd: aeron_socket_t,
        msghdr: *mut msghdr,
        flags: ::std::os::raw::c_int,
    ) -> isize;
}
extern "C" {
    pub fn aeron_poll(
        fds: *mut pollfd,
        nfds: ::std::os::raw::c_ulong,
        timeout: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
pub const aeron_udp_channel_transport_affinity_en_AERON_UDP_CHANNEL_TRANSPORT_AFFINITY_SENDER:
    aeron_udp_channel_transport_affinity_en = 0;
pub const aeron_udp_channel_transport_affinity_en_AERON_UDP_CHANNEL_TRANSPORT_AFFINITY_RECEIVER:
    aeron_udp_channel_transport_affinity_en = 1;
pub const aeron_udp_channel_transport_affinity_en_AERON_UDP_CHANNEL_TRANSPORT_AFFINITY_CONDUCTOR:
    aeron_udp_channel_transport_affinity_en = 2;
pub type aeron_udp_channel_transport_affinity_en = ::std::os::raw::c_uint;
pub use self::aeron_udp_channel_transport_affinity_en as aeron_udp_channel_transport_affinity_t;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct mmsghdr {
    _unused: [u8; 0],
}
pub type aeron_udp_channel_transport_t = aeron_udp_channel_transport_stct;
pub type aeron_network_publication_t = aeron_network_publication_stct;
pub type aeron_publication_image_t = aeron_publication_image_stct;
pub type aeron_udp_transport_poller_t = aeron_udp_transport_poller_stct;
pub type aeron_udp_channel_data_paths_t = aeron_udp_channel_data_paths_stct;
pub type aeron_data_packet_dispatcher_t = aeron_data_packet_dispatcher_stct;
pub type aeron_udp_channel_transport_init_func_t = ::std::option::Option<
    unsafe extern "C" fn(
        transport: *mut aeron_udp_channel_transport_t,
        bind_addr: *mut sockaddr_storage,
        multicast_if_addr: *mut sockaddr_storage,
        connect_addr: *mut sockaddr_storage,
        multicast_if_index: ::std::os::raw::c_uint,
        ttl: u8,
        socket_rcvbuf: usize,
        socket_sndbuf: usize,
        is_media_timestamping: bool,
        context: *mut aeron_driver_context_t,
        affinity: aeron_udp_channel_transport_affinity_t,
    ) -> ::std::os::raw::c_int,
>;
pub type aeron_udp_channel_transport_reconnect_func_t = ::std::option::Option<
    unsafe extern "C" fn(
        transport: *mut aeron_udp_channel_transport_t,
        connect_addr: *mut sockaddr_storage,
    ) -> ::std::os::raw::c_int,
>;
pub type aeron_udp_channel_transport_close_func_t = ::std::option::Option<
    unsafe extern "C" fn(transport: *mut aeron_udp_channel_transport_t) -> ::std::os::raw::c_int,
>;
pub type aeron_udp_transport_recv_func_t = ::std::option::Option<
    unsafe extern "C" fn(
        data_paths: *mut aeron_udp_channel_data_paths_t,
        transport: *mut aeron_udp_channel_transport_t,
        receiver_clientd: *mut ::std::os::raw::c_void,
        endpoint_clientd: *mut ::std::os::raw::c_void,
        destination_clientd: *mut ::std::os::raw::c_void,
        buffer: *mut u8,
        length: usize,
        addr: *mut sockaddr_storage,
        media_timestamp: *mut timespec,
    ),
>;
pub type aeron_udp_channel_transport_recvmmsg_func_t = ::std::option::Option<
    unsafe extern "C" fn(
        transport: *mut aeron_udp_channel_transport_t,
        msgvec: *mut mmsghdr,
        vlen: usize,
        bytes_rcved: *mut i64,
        recv_func: aeron_udp_transport_recv_func_t,
        clientd: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
pub type aeron_udp_channel_transport_send_func_t = ::std::option::Option<
    unsafe extern "C" fn(
        data_paths: *mut aeron_udp_channel_data_paths_t,
        transport: *mut aeron_udp_channel_transport_t,
        address: *mut sockaddr_storage,
        iov: *mut iovec,
        iov_length: usize,
        bytes_sent: *mut i64,
    ) -> ::std::os::raw::c_int,
>;
pub type aeron_udp_channel_transport_get_so_rcvbuf_func_t = ::std::option::Option<
    unsafe extern "C" fn(
        transport: *mut aeron_udp_channel_transport_t,
        so_rcvbuf: *mut usize,
    ) -> ::std::os::raw::c_int,
>;
pub type aeron_udp_channel_transport_bind_addr_and_port_func_t = ::std::option::Option<
    unsafe extern "C" fn(
        transport: *mut aeron_udp_channel_transport_t,
        buffer: *mut ::std::os::raw::c_char,
        length: usize,
    ) -> ::std::os::raw::c_int,
>;
pub type aeron_udp_transport_poller_init_func_t = ::std::option::Option<
    unsafe extern "C" fn(
        poller: *mut aeron_udp_transport_poller_t,
        context: *mut aeron_driver_context_t,
        affinity: aeron_udp_channel_transport_affinity_t,
    ) -> ::std::os::raw::c_int,
>;
pub type aeron_udp_transport_poller_close_func_t = ::std::option::Option<
    unsafe extern "C" fn(poller: *mut aeron_udp_transport_poller_t) -> ::std::os::raw::c_int,
>;
pub type aeron_udp_transport_poller_add_func_t = ::std::option::Option<
    unsafe extern "C" fn(
        poller: *mut aeron_udp_transport_poller_t,
        transport: *mut aeron_udp_channel_transport_t,
    ) -> ::std::os::raw::c_int,
>;
pub type aeron_udp_transport_poller_remove_func_t = ::std::option::Option<
    unsafe extern "C" fn(
        poller: *mut aeron_udp_transport_poller_t,
        transport: *mut aeron_udp_channel_transport_t,
    ) -> ::std::os::raw::c_int,
>;
pub type aeron_udp_transport_poller_poll_func_t = ::std::option::Option<
    unsafe extern "C" fn(
        poller: *mut aeron_udp_transport_poller_t,
        msgvec: *mut mmsghdr,
        vlen: usize,
        bytes_rcved: *mut i64,
        recv_func: aeron_udp_transport_recv_func_t,
        recvmmsg_func: aeron_udp_channel_transport_recvmmsg_func_t,
        clientd: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct aeron_udp_channel_transport_bindings_stct {
    pub init_func: aeron_udp_channel_transport_init_func_t,
    pub reconnect_func: aeron_udp_channel_transport_reconnect_func_t,
    pub close_func: aeron_udp_channel_transport_close_func_t,
    pub recvmmsg_func: aeron_udp_channel_transport_recvmmsg_func_t,
    pub send_func: aeron_udp_channel_transport_send_func_t,
    pub get_so_rcvbuf_func: aeron_udp_channel_transport_get_so_rcvbuf_func_t,
    pub bind_addr_and_port_func: aeron_udp_channel_transport_bind_addr_and_port_func_t,
    pub poller_init_func: aeron_udp_transport_poller_init_func_t,
    pub poller_close_func: aeron_udp_transport_poller_close_func_t,
    pub poller_add_func: aeron_udp_transport_poller_add_func_t,
    pub poller_remove_func: aeron_udp_transport_poller_remove_func_t,
    pub poller_poll_func: aeron_udp_transport_poller_poll_func_t,
    pub meta_info: aeron_udp_channel_transport_bindings_stct_meta_info_fields,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct aeron_udp_channel_transport_bindings_stct_meta_info_fields {
    pub name: *const ::std::os::raw::c_char,
    pub type_: *const ::std::os::raw::c_char,
    pub source_symbol: *const ::std::os::raw::c_void,
}
#[test]
fn bindgen_test_layout_aeron_udp_channel_transport_bindings_stct_meta_info_fields() {
    const UNINIT: ::std::mem::MaybeUninit<
        aeron_udp_channel_transport_bindings_stct_meta_info_fields,
    > = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<aeron_udp_channel_transport_bindings_stct_meta_info_fields>(),
        24usize,
        concat!(
            "Size of: ",
            stringify!(aeron_udp_channel_transport_bindings_stct_meta_info_fields)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<aeron_udp_channel_transport_bindings_stct_meta_info_fields>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(aeron_udp_channel_transport_bindings_stct_meta_info_fields)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).name) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(aeron_udp_channel_transport_bindings_stct_meta_info_fields),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(aeron_udp_channel_transport_bindings_stct_meta_info_fields),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).source_symbol) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(aeron_udp_channel_transport_bindings_stct_meta_info_fields),
            "::",
            stringify!(source_symbol)
        )
    );
}
#[test]
fn bindgen_test_layout_aeron_udp_channel_transport_bindings_stct() {
    const UNINIT: ::std::mem::MaybeUninit<aeron_udp_channel_transport_bindings_stct> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<aeron_udp_channel_transport_bindings_stct>(),
        120usize,
        concat!(
            "Size of: ",
            stringify!(aeron_udp_channel_transport_bindings_stct)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<aeron_udp_channel_transport_bindings_stct>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(aeron_udp_channel_transport_bindings_stct)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).init_func) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(aeron_udp_channel_transport_bindings_stct),
            "::",
            stringify!(init_func)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).reconnect_func) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(aeron_udp_channel_transport_bindings_stct),
            "::",
            stringify!(reconnect_func)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).close_func) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(aeron_udp_channel_transport_bindings_stct),
            "::",
            stringify!(close_func)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).recvmmsg_func) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(aeron_udp_channel_transport_bindings_stct),
            "::",
            stringify!(recvmmsg_func)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).send_func) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(aeron_udp_channel_transport_bindings_stct),
            "::",
            stringify!(send_func)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).get_so_rcvbuf_func) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(aeron_udp_channel_transport_bindings_stct),
            "::",
            stringify!(get_so_rcvbuf_func)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bind_addr_and_port_func) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(aeron_udp_channel_transport_bindings_stct),
            "::",
            stringify!(bind_addr_and_port_func)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).poller_init_func) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(aeron_udp_channel_transport_bindings_stct),
            "::",
            stringify!(poller_init_func)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).poller_close_func) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(aeron_udp_channel_transport_bindings_stct),
            "::",
            stringify!(poller_close_func)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).poller_add_func) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(aeron_udp_channel_transport_bindings_stct),
            "::",
            stringify!(poller_add_func)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).poller_remove_func) as usize - ptr as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(aeron_udp_channel_transport_bindings_stct),
            "::",
            stringify!(poller_remove_func)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).poller_poll_func) as usize - ptr as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(aeron_udp_channel_transport_bindings_stct),
            "::",
            stringify!(poller_poll_func)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).meta_info) as usize - ptr as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(aeron_udp_channel_transport_bindings_stct),
            "::",
            stringify!(meta_info)
        )
    );
}
extern "C" {
    pub fn aeron_udp_channel_transport_bindings_load_media(
        bindings_name: *const ::std::os::raw::c_char,
    ) -> *mut aeron_udp_channel_transport_bindings_t;
}
pub type aeron_udp_channel_interceptor_bindings_load_func_t = ::std::option::Option<
    unsafe extern "C" fn(
        delegate_bindings: *mut aeron_udp_channel_interceptor_bindings_t,
    ) -> *mut aeron_udp_channel_interceptor_bindings_t,
>;
extern "C" {
    pub fn aeron_udp_channel_interceptor_bindings_load(
        existing_interceptor_bindings: *mut aeron_udp_channel_interceptor_bindings_t,
        interceptors: *const ::std::os::raw::c_char,
    ) -> *mut aeron_udp_channel_interceptor_bindings_t;
}
pub type aeron_udp_channel_outgoing_interceptor_t = aeron_udp_channel_outgoing_interceptor_stct;
pub type aeron_udp_channel_incoming_interceptor_t = aeron_udp_channel_incoming_interceptor_stct;
pub const aeron_udp_channel_interceptor_notification_type_en_AERON_UDP_CHANNEL_INTERCEPTOR_ADD_NOTIFICATION : aeron_udp_channel_interceptor_notification_type_en = 0 ;
pub const aeron_udp_channel_interceptor_notification_type_en_AERON_UDP_CHANNEL_INTERCEPTOR_REMOVE_NOTIFICATION : aeron_udp_channel_interceptor_notification_type_en = 1 ;
pub type aeron_udp_channel_interceptor_notification_type_en = ::std::os::raw::c_uint;
pub use self::aeron_udp_channel_interceptor_notification_type_en as aeron_udp_channel_interceptor_notification_type_t;
pub type aeron_udp_channel_interceptor_outgoing_send_func_t = ::std::option::Option<
    unsafe extern "C" fn(
        interceptor_state: *mut ::std::os::raw::c_void,
        delegate: *mut aeron_udp_channel_outgoing_interceptor_t,
        transport: *mut aeron_udp_channel_transport_t,
        address: *mut sockaddr_storage,
        iov: *mut iovec,
        iov_length: usize,
        bytes_sent: *mut i64,
    ) -> ::std::os::raw::c_int,
>;
pub type aeron_udp_channel_interceptor_incoming_func_t = ::std::option::Option<
    unsafe extern "C" fn(
        interceptor_state: *mut ::std::os::raw::c_void,
        delegate: *mut aeron_udp_channel_incoming_interceptor_t,
        transport: *mut aeron_udp_channel_transport_t,
        receiver_clientd: *mut ::std::os::raw::c_void,
        endpoint_clientd: *mut ::std::os::raw::c_void,
        destination_clientd: *mut ::std::os::raw::c_void,
        buffer: *mut u8,
        length: usize,
        addr: *mut sockaddr_storage,
        media_timestamp: *mut timespec,
    ),
>;
pub type aeron_udp_channel_interceptor_init_func_t = ::std::option::Option<
    unsafe extern "C" fn(
        interceptor_state: *mut *mut ::std::os::raw::c_void,
        context: *mut aeron_driver_context_t,
        affinity: aeron_udp_channel_transport_affinity_t,
    ) -> ::std::os::raw::c_int,
>;
pub type aeron_udp_channel_interceptor_close_func_t = ::std::option::Option<
    unsafe extern "C" fn(interceptor_state: *mut ::std::os::raw::c_void) -> ::std::os::raw::c_int,
>;
pub type aeron_udp_channel_interceptor_transport_notification_func_t = ::std::option::Option<
    unsafe extern "C" fn(
        interceptor_state: *mut ::std::os::raw::c_void,
        transport: *mut aeron_udp_channel_transport_t,
        udp_channel: *const aeron_udp_channel_t,
        data_packet_dispatcher: *mut aeron_data_packet_dispatcher_t,
        type_: aeron_udp_channel_interceptor_notification_type_t,
    ) -> ::std::os::raw::c_int,
>;
pub type aeron_udp_channel_interceptor_publication_notification_func_t = ::std::option::Option<
    unsafe extern "C" fn(
        interceptor_state: *mut ::std::os::raw::c_void,
        transport: *mut aeron_udp_channel_transport_t,
        publication: *mut aeron_network_publication_t,
        type_: aeron_udp_channel_interceptor_notification_type_t,
    ) -> ::std::os::raw::c_int,
>;
pub type aeron_udp_channel_interceptor_image_notification_func_t = ::std::option::Option<
    unsafe extern "C" fn(
        interceptor_state: *mut ::std::os::raw::c_void,
        transport: *mut aeron_udp_channel_transport_t,
        image: *mut aeron_publication_image_t,
        type_: aeron_udp_channel_interceptor_notification_type_t,
    ) -> ::std::os::raw::c_int,
>;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct aeron_udp_channel_interceptor_bindings_stct {
    pub outgoing_init_func: aeron_udp_channel_interceptor_init_func_t,
    pub incoming_init_func: aeron_udp_channel_interceptor_init_func_t,
    pub outgoing_send_func: aeron_udp_channel_interceptor_outgoing_send_func_t,
    pub incoming_func: aeron_udp_channel_interceptor_incoming_func_t,
    pub outgoing_close_func: aeron_udp_channel_interceptor_close_func_t,
    pub incoming_close_func: aeron_udp_channel_interceptor_close_func_t,
    pub outgoing_transport_notification_func:
        aeron_udp_channel_interceptor_transport_notification_func_t,
    pub incoming_transport_notification_func:
        aeron_udp_channel_interceptor_transport_notification_func_t,
    pub outgoing_publication_notification_func:
        aeron_udp_channel_interceptor_publication_notification_func_t,
    pub incoming_publication_notification_func:
        aeron_udp_channel_interceptor_publication_notification_func_t,
    pub outgoing_image_notification_func: aeron_udp_channel_interceptor_image_notification_func_t,
    pub incoming_image_notification_func: aeron_udp_channel_interceptor_image_notification_func_t,
    pub meta_info: aeron_udp_channel_interceptor_bindings_stct_interceptor_meta_info_fields,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct aeron_udp_channel_interceptor_bindings_stct_interceptor_meta_info_fields {
    pub name: *const ::std::os::raw::c_char,
    pub type_: *const ::std::os::raw::c_char,
    pub next_interceptor_bindings: *const aeron_udp_channel_interceptor_bindings_t,
    pub source_symbol: ::std::option::Option<unsafe extern "C" fn()>,
}
#[test]
fn bindgen_test_layout_aeron_udp_channel_interceptor_bindings_stct_interceptor_meta_info_fields() {
    const UNINIT: ::std::mem::MaybeUninit<
        aeron_udp_channel_interceptor_bindings_stct_interceptor_meta_info_fields,
    > = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<
            aeron_udp_channel_interceptor_bindings_stct_interceptor_meta_info_fields,
        >(),
        32usize,
        concat!(
            "Size of: ",
            stringify!(aeron_udp_channel_interceptor_bindings_stct_interceptor_meta_info_fields)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<
            aeron_udp_channel_interceptor_bindings_stct_interceptor_meta_info_fields,
        >(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(aeron_udp_channel_interceptor_bindings_stct_interceptor_meta_info_fields)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).name) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(aeron_udp_channel_interceptor_bindings_stct_interceptor_meta_info_fields),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(aeron_udp_channel_interceptor_bindings_stct_interceptor_meta_info_fields),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).next_interceptor_bindings) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(aeron_udp_channel_interceptor_bindings_stct_interceptor_meta_info_fields),
            "::",
            stringify!(next_interceptor_bindings)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).source_symbol) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(aeron_udp_channel_interceptor_bindings_stct_interceptor_meta_info_fields),
            "::",
            stringify!(source_symbol)
        )
    );
}
#[test]
fn bindgen_test_layout_aeron_udp_channel_interceptor_bindings_stct() {
    const UNINIT: ::std::mem::MaybeUninit<aeron_udp_channel_interceptor_bindings_stct> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<aeron_udp_channel_interceptor_bindings_stct>(),
        128usize,
        concat!(
            "Size of: ",
            stringify!(aeron_udp_channel_interceptor_bindings_stct)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<aeron_udp_channel_interceptor_bindings_stct>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(aeron_udp_channel_interceptor_bindings_stct)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).outgoing_init_func) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(aeron_udp_channel_interceptor_bindings_stct),
            "::",
            stringify!(outgoing_init_func)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).incoming_init_func) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(aeron_udp_channel_interceptor_bindings_stct),
            "::",
            stringify!(incoming_init_func)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).outgoing_send_func) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(aeron_udp_channel_interceptor_bindings_stct),
            "::",
            stringify!(outgoing_send_func)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).incoming_func) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(aeron_udp_channel_interceptor_bindings_stct),
            "::",
            stringify!(incoming_func)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).outgoing_close_func) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(aeron_udp_channel_interceptor_bindings_stct),
            "::",
            stringify!(outgoing_close_func)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).incoming_close_func) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(aeron_udp_channel_interceptor_bindings_stct),
            "::",
            stringify!(incoming_close_func)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).outgoing_transport_notification_func) as usize
                - ptr as usize
        },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(aeron_udp_channel_interceptor_bindings_stct),
            "::",
            stringify!(outgoing_transport_notification_func)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).incoming_transport_notification_func) as usize
                - ptr as usize
        },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(aeron_udp_channel_interceptor_bindings_stct),
            "::",
            stringify!(incoming_transport_notification_func)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).outgoing_publication_notification_func) as usize
                - ptr as usize
        },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(aeron_udp_channel_interceptor_bindings_stct),
            "::",
            stringify!(outgoing_publication_notification_func)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).incoming_publication_notification_func) as usize
                - ptr as usize
        },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(aeron_udp_channel_interceptor_bindings_stct),
            "::",
            stringify!(incoming_publication_notification_func)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).outgoing_image_notification_func) as usize - ptr as usize
        },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(aeron_udp_channel_interceptor_bindings_stct),
            "::",
            stringify!(outgoing_image_notification_func)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).incoming_image_notification_func) as usize - ptr as usize
        },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(aeron_udp_channel_interceptor_bindings_stct),
            "::",
            stringify!(incoming_image_notification_func)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).meta_info) as usize - ptr as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(aeron_udp_channel_interceptor_bindings_stct),
            "::",
            stringify!(meta_info)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct aeron_udp_channel_outgoing_interceptor_stct {
    pub interceptor_state: *mut ::std::os::raw::c_void,
    pub outgoing_send_func: aeron_udp_channel_interceptor_outgoing_send_func_t,
    pub close_func: aeron_udp_channel_interceptor_close_func_t,
    pub outgoing_transport_notification_func:
        aeron_udp_channel_interceptor_transport_notification_func_t,
    pub outgoing_publication_notification_func:
        aeron_udp_channel_interceptor_publication_notification_func_t,
    pub outgoing_image_notification_func: aeron_udp_channel_interceptor_image_notification_func_t,
    pub next_interceptor: *mut aeron_udp_channel_outgoing_interceptor_t,
}
#[test]
fn bindgen_test_layout_aeron_udp_channel_outgoing_interceptor_stct() {
    const UNINIT: ::std::mem::MaybeUninit<aeron_udp_channel_outgoing_interceptor_stct> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<aeron_udp_channel_outgoing_interceptor_stct>(),
        56usize,
        concat!(
            "Size of: ",
            stringify!(aeron_udp_channel_outgoing_interceptor_stct)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<aeron_udp_channel_outgoing_interceptor_stct>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(aeron_udp_channel_outgoing_interceptor_stct)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).interceptor_state) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(aeron_udp_channel_outgoing_interceptor_stct),
            "::",
            stringify!(interceptor_state)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).outgoing_send_func) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(aeron_udp_channel_outgoing_interceptor_stct),
            "::",
            stringify!(outgoing_send_func)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).close_func) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(aeron_udp_channel_outgoing_interceptor_stct),
            "::",
            stringify!(close_func)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).outgoing_transport_notification_func) as usize
                - ptr as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(aeron_udp_channel_outgoing_interceptor_stct),
            "::",
            stringify!(outgoing_transport_notification_func)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).outgoing_publication_notification_func) as usize
                - ptr as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(aeron_udp_channel_outgoing_interceptor_stct),
            "::",
            stringify!(outgoing_publication_notification_func)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).outgoing_image_notification_func) as usize - ptr as usize
        },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(aeron_udp_channel_outgoing_interceptor_stct),
            "::",
            stringify!(outgoing_image_notification_func)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).next_interceptor) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(aeron_udp_channel_outgoing_interceptor_stct),
            "::",
            stringify!(next_interceptor)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct aeron_udp_channel_incoming_interceptor_stct {
    pub interceptor_state: *mut ::std::os::raw::c_void,
    pub incoming_func: aeron_udp_channel_interceptor_incoming_func_t,
    pub close_func: aeron_udp_channel_interceptor_close_func_t,
    pub incoming_transport_notification_func:
        aeron_udp_channel_interceptor_transport_notification_func_t,
    pub incoming_publication_notification_func:
        aeron_udp_channel_interceptor_publication_notification_func_t,
    pub incoming_image_notification_func: aeron_udp_channel_interceptor_image_notification_func_t,
    pub next_interceptor: *mut aeron_udp_channel_incoming_interceptor_t,
}
#[test]
fn bindgen_test_layout_aeron_udp_channel_incoming_interceptor_stct() {
    const UNINIT: ::std::mem::MaybeUninit<aeron_udp_channel_incoming_interceptor_stct> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<aeron_udp_channel_incoming_interceptor_stct>(),
        56usize,
        concat!(
            "Size of: ",
            stringify!(aeron_udp_channel_incoming_interceptor_stct)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<aeron_udp_channel_incoming_interceptor_stct>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(aeron_udp_channel_incoming_interceptor_stct)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).interceptor_state) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(aeron_udp_channel_incoming_interceptor_stct),
            "::",
            stringify!(interceptor_state)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).incoming_func) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(aeron_udp_channel_incoming_interceptor_stct),
            "::",
            stringify!(incoming_func)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).close_func) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(aeron_udp_channel_incoming_interceptor_stct),
            "::",
            stringify!(close_func)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).incoming_transport_notification_func) as usize
                - ptr as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(aeron_udp_channel_incoming_interceptor_stct),
            "::",
            stringify!(incoming_transport_notification_func)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).incoming_publication_notification_func) as usize
                - ptr as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(aeron_udp_channel_incoming_interceptor_stct),
            "::",
            stringify!(incoming_publication_notification_func)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).incoming_image_notification_func) as usize - ptr as usize
        },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(aeron_udp_channel_incoming_interceptor_stct),
            "::",
            stringify!(incoming_image_notification_func)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).next_interceptor) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(aeron_udp_channel_incoming_interceptor_stct),
            "::",
            stringify!(next_interceptor)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct aeron_udp_channel_data_paths_stct {
    pub outgoing_interceptors: *mut aeron_udp_channel_outgoing_interceptor_t,
    pub incoming_interceptors: *mut aeron_udp_channel_incoming_interceptor_t,
    pub send_func: aeron_udp_channel_transport_send_func_t,
    pub recv_func: aeron_udp_transport_recv_func_t,
}
#[test]
fn bindgen_test_layout_aeron_udp_channel_data_paths_stct() {
    const UNINIT: ::std::mem::MaybeUninit<aeron_udp_channel_data_paths_stct> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<aeron_udp_channel_data_paths_stct>(),
        32usize,
        concat!("Size of: ", stringify!(aeron_udp_channel_data_paths_stct))
    );
    assert_eq!(
        ::std::mem::align_of::<aeron_udp_channel_data_paths_stct>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(aeron_udp_channel_data_paths_stct)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).outgoing_interceptors) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(aeron_udp_channel_data_paths_stct),
            "::",
            stringify!(outgoing_interceptors)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).incoming_interceptors) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(aeron_udp_channel_data_paths_stct),
            "::",
            stringify!(incoming_interceptors)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).send_func) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(aeron_udp_channel_data_paths_stct),
            "::",
            stringify!(send_func)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).recv_func) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(aeron_udp_channel_data_paths_stct),
            "::",
            stringify!(recv_func)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct aeron_udp_channel_transport_recv_func_holder_stct {
    pub func: aeron_udp_transport_recv_func_t,
}
#[test]
fn bindgen_test_layout_aeron_udp_channel_transport_recv_func_holder_stct() {
    const UNINIT: ::std::mem::MaybeUninit<aeron_udp_channel_transport_recv_func_holder_stct> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<aeron_udp_channel_transport_recv_func_holder_stct>(),
        8usize,
        concat!(
            "Size of: ",
            stringify!(aeron_udp_channel_transport_recv_func_holder_stct)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<aeron_udp_channel_transport_recv_func_holder_stct>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(aeron_udp_channel_transport_recv_func_holder_stct)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).func) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(aeron_udp_channel_transport_recv_func_holder_stct),
            "::",
            stringify!(func)
        )
    );
}
pub type aeron_udp_channel_transport_recv_func_holder_t =
    aeron_udp_channel_transport_recv_func_holder_stct;
extern "C" {
    pub fn aeron_udp_channel_transport_recv_func_holder_close(
        holder: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn aeron_udp_channel_incoming_interceptor_recv_func(
        data_paths: *mut aeron_udp_channel_data_paths_t,
        transport: *mut aeron_udp_channel_transport_t,
        receiver_clientd: *mut ::std::os::raw::c_void,
        endpoint_clientd: *mut ::std::os::raw::c_void,
        destination_clientd: *mut ::std::os::raw::c_void,
        buffer: *mut u8,
        length: usize,
        addr: *mut sockaddr_storage,
        media_timestamp: *mut timespec,
    );
}
extern "C" {
    pub fn aeron_udp_channel_data_paths_init(
        data_paths: *mut aeron_udp_channel_data_paths_t,
        outgoing_interceptor_bindings: *mut aeron_udp_channel_interceptor_bindings_t,
        incoming_interceptor_bindings: *mut aeron_udp_channel_interceptor_bindings_t,
        media_bindings: *mut aeron_udp_channel_transport_bindings_t,
        recv_func: aeron_udp_transport_recv_func_t,
        context: *mut aeron_driver_context_t,
        affinity: aeron_udp_channel_transport_affinity_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn aeron_udp_channel_data_paths_delete(
        data_paths: *mut aeron_udp_channel_data_paths_t,
    ) -> ::std::os::raw::c_int;
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct aeron_frame_header_stct {
    pub frame_length: i32,
    pub version: i8,
    pub flags: u8,
    pub type_: i16,
}
#[test]
fn bindgen_test_layout_aeron_frame_header_stct() {
    const UNINIT: ::std::mem::MaybeUninit<aeron_frame_header_stct> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<aeron_frame_header_stct>(),
        8usize,
        concat!("Size of: ", stringify!(aeron_frame_header_stct))
    );
    assert_eq!(
        ::std::mem::align_of::<aeron_frame_header_stct>(),
        4usize,
        concat!("Alignment of ", stringify!(aeron_frame_header_stct))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).frame_length) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(aeron_frame_header_stct),
            "::",
            stringify!(frame_length)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).version) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(aeron_frame_header_stct),
            "::",
            stringify!(version)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).flags) as usize - ptr as usize },
        5usize,
        concat!(
            "Offset of field: ",
            stringify!(aeron_frame_header_stct),
            "::",
            stringify!(flags)
        )
    );
    assert_eq!(
